[
    {
        "title": "Rachel Reeves hints at support for Heathrow third runway",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Reeves hints at support for Heathrow expansion\n\n26 January 2025 Becky Morton Political reporter\n\nJeff Overs/BBC\n\nThe chancellor has hinted the government would support a third runway at Heathrow Airport, saying \"sustainable aviation and economic growth go hand in hand\". Rachel Reeves told the BBC she would not comment on \"speculation\" and the government would set out its plans in due course. However, she said a third runway at Heathrow \"will mean that instead of circling London, flights can land\" and that sustainable fuel was changing the carbon emissions from flying. Reeves is expected to make an announcement backing airport expansion next week, as part of major speech on plans to boost the economy.\n\nThe government has already said it wants to fast-track permission for housing and commercial developments near train stations, as well as pare back environmental impact assessments. In an interview with the BBC's Sunday with Laura Kuenssberg programme, the chancellor struck a more optimistic tone about the economy than in recent months, when the government has repeatedly warned about the state of the public finances. Reeves said she did not believe \"low growth is our destiny\" and pledged to go \"further and faster\" to remove the barriers blocking investment. Asked if there was also likely to be an announcement on Heathrow next week, she did not answer directly but said the government had already signed off the expansion of London City Airport and Stansted. \"That will be good for investment and trade in our country and also good for families wanting to go on cheap holidays,\" she said. Reeves was challenged over whether she agreed with criticism from Labour mayor of London Sadiq Khan that expanding Heathrow would have a damaging impact on air quality, noise and the capital's ability to reach net zero. In response she said \"a lot has changed in terms of aviation\", with investment in sustainable fuel and electric planes. The chancellor added: \"I believe that clean energy, that reducing our carbon emissions are good for economic growth.\"\n\nLabour has made boosting economic growth central to the government's mission, pledging to raise living standards and deliver the highest sustained economic growth in the G7 group of rich nations by the time of the next election. But between July and September the economy had zero growth and the latest monthly figures for November showed just a small uptick.",
        "word_count": 394,
        "url": "https://www.bbc.com/news/articles/cy08q9d1r2vo"
    },
    {
        "title": "Sir Paul McCartney: Don't let AI rip off musicians",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Paul McCartney: Don't let AI rip off artists\n\n26 January 2025 Laura Kuenssberg • @bbclaurak Presenter, Sunday with Laura Kuenssberg\n\nWatch: Paul McCartney on the risks the next generation of musicians face\n\nSir Paul McCartney has told the BBC proposed changes to copyright law could allow \"rip off\" technology that might make it impossible for musicians and artists to make a living. The government is considering an overhaul of the law that would allow AI developers to use creators' content on the internet to help develop their models, unless the rights holders opt out. In a rare interview for Sunday with Laura Kuenssberg, Sir Paul said \"when we were kids in Liverpool, we found a job that we loved, but it also paid the bills\", warning the proposals could remove the incentive for writers and artists and result in a \"loss of creativity\". The government said it aimed to deliver legal certainty through a copyright regime that provided creators with \"real control\" and transparency.\n\nWatch: Protect creative artists or you won't have them - Paul McCartney\n\nSir Paul, one of the two surviving members of the Beatles, said there was a risk that AI would create a \"Wild West\" in which artists' copyright is not properly protected. \"You get young guys, girls, coming up, and they write a beautiful song, and they don't own it,\" he said. \"They don't have anything to do with it. And anyone who wants can just rip it off. \"The truth is, the money's going somewhere. Somebody's getting paid, so why shouldn't it be the guy who sat down and wrote Yesterday?\" He appealed to the government to think again about its plans, saying: \"We're the people, you're the government! You're supposed to protect us. That's your job. \"So you know, if you're putting through a bill, make sure you protect the creative thinkers, the creative artists, or you're not going to have them.\" In 2023, Sir Paul and Beatles drummer Sir Ringo Starr used AI to extract the vocals from an unfinished demo left by John Lennon to produce a new song, Now and Then. The song, billed as the Beatles' final release, drew widespread praise and has been nominated for two Grammys and a Brit award. \"I think AI is great, and it can do lots of great things,\" Sir Paul said. \"We took an old cassette of John's and cleaned his voice up so it sounded like it had just been recorded yesterday. So it has its uses. \"But it shouldn't rip creative people off. There's no sense in that.\"\n\nReuters Sir Paul performing for his Got Back tour in London, in December 2024\n\nThe government is currently consulting on proposals that would allow AI companies to use material that is available online without respecting copyright if they are using it for text or data mining. Generative AI programmes mine, or learn, from vast amounts of data like text, images, or music online to generate new content which feels like it has been made by a human. The proposals would give artists or creators a so called \"rights reservation\" – the ability to opt out. But critics of the plan believe it is not possible for an individual writer or artist to notify thousands of different AI service providers that they do not want their content used in that way, or to monitor what has happened to their work across the whole internet. An alternative proposal for artists to opt in to give their permission for their content to be used will be put forward in the House of Lords by cross bench peer Baroness Kidron this week. Tom Kiehl, chief executive of music industry body UK Music, said: \"Government plans to change copyright law to make it easier for AI firms to use the music of artists, composers and music companies without their permission put the music industry at a huge risk. \"It would be a wild punt against the creative sector that is already contributing over £120bn to the economy and be counterproductive to the government's own growth ambitions. \"There is no evidence that creatives can effectively 'opt out' of their work from being trained by AI systems and so this apparent concession does not provide any reassurance to those that work in music.\"\n\nPA Media The Beatles: Paul McCartney, George Harrison, Ringo Starr and John Lennon, at a London recording studio in 1967",
        "word_count": 734,
        "url": "https://www.bbc.com/news/articles/c8xqv9g8442o"
    },
    {
        "title": "Hundreds arrested in illegal worker raids last month, government says",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Illegal workers held in raids on nail bars and takeaways\n\n10 February 2025 Ian Aikman BBC News Henry Zeffman Chief Political Correspondent\n\nHome Office Raids took place across the country - including at a car wash in south London\n\nHundreds of migrants were arrested in January as part of a UK-wide crackdown on illegal working, the government has said. Enforcement teams raided 828 premises including nail bars, car washes, and restaurants and made 609 arrests - a 73% increase on the previous January. Home Office Minister Dame Angela Eagle told the BBC the decision to release footage of the arrests was to send a message about the realities of working illegally and she defended the government's approach as \"compassionate\". Later on Monday, MPs will debate the government's immigration bill. Shadow Home Secretary Chris Philp has called it a \"weak bill that won't stop the boats\".\n\nVape shops in Cheshire and a grocery warehouse in south London were among the places raided. Those arrested made the journey to the UK through a mix of routes, including by crossing the Channel and by overstaying legitimately-granted visas. Despite having won a landslide election victory seven months ago, senior Labour strategists are already increasingly worried about losing voters concerned about immigration to Reform come the next election. Chris Mason's analysis: Ministers want to show toughness on immigration\n\nParty figures believe that merely describing the arrests and deportations is not enough – hence the decision to release footage today of them taking place, allowing people to see with their own eyes. But there are others in the Labour Party who fear that focusing on illegal immigration only increases the salience of an issue where they could never and would never want to adopt as hardline an approach as Reform. Some Labour MPs, particularly on the left of the party, believe the government should do more to establish safe and legal routes for people to come to the UK and talk about the benefits of immigration. Speaking to BBC Radio 4's Today programme, Dame Angela was asked if releasing footage of the raids aligned with Sir Keir Starmer's previous pledge to create an immigration system \"based on compassion and dignity\". \"I don't believe for one minute that enforcing the law and ensuring that people who break the law face the consequences of doing that, up to and including deportation, arrest, is not compassionate,\" she said. She added that it is \"important that we show what we are doing and it's important that we send messages to people who may have been sold lies about what will await them in the UK if they get themselves smuggled in\". The government also intends to reduce the number of hotels housing asylum seekers, Dame Angela said. Speaking to BBC Breakfast on Monday, she said there were plans to close nine of the 218 hotels currently in use by the end of March.",
        "word_count": 483,
        "url": "https://www.bbc.com/news/articles/c1lv153ydm6o"
    },
    {
        "title": "Rachel Reeves: What we've learned about her expenses and Labour response",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "What we've learned about Rachel Reeves's expenses - and the Labour response\n\n8 days ago Billy Kenber Politics investigations correspondent Sean Seddon BBC News\n\nReuters\n\nSince BBC News reported on Thursday that Rachel Reeves had exaggerated her online CV and had been investigated over her use of expenses while working at Halifax Bank of Scotland (HBOS), Labour colleagues have mounted a robust defence of the chancellor. Sir Keir Starmer said she had \"dealt with any issues that arise\" from the questions about her CV, and Health Secretary Wes Streeting told BBC Newsnight that she was doing a \"brilliant and difficult job\". But Labour figures have questioned our reporting on the expenses investigation, with one cabinet minister calling it totally inaccurate. Here we examine the key Labour responses and look at the evidence that supports our journalism.\n\nWhat did we reveal about Reeves's expenses?\n\nThe BBC News investigation revealed that concerns were raised about Reeves's expenses while working at HBOS between 2006 and 2009. A detailed six-page whistleblowing complaint was submitted, with dozens of pages of supporting documents including emails, receipts and memos. It accused Reeves and two other managers, one of whom was her boss, of using the bank's money to \"fund a lifestyle\", with spending on events, taxis and gifts, including for each other. We have seen these documents and spoken to more than 20 people, many of whom were former colleagues. The chancellor and her expenses before she became an MP\n\nWhat happened to the whistleblower's complaint?\n\nThe complaint led to an internal investigation by the bank's risk department. This was passed to internal audit, which reviewed the allegations and concluded that they were substantiated and there appeared to be evidence of wrongdoing by Reeves and her two colleagues, according to a senior source with direct knowledge of the investigation. What we have not been able to establish is what happened next and whether the bank ever reached a formal conclusion.\n\nHow are Labour defending Reeves?\n\nReeves has said she was not aware of an investigation or issue with her expenses and said she left the bank on good terms. She said her expenses had always been signed off in the proper way. The person who signed off her expenses, her boss, was also subject to the internal investigation. Other Labour figures have criticised BBC News's reporting on the story, with two MPs repeating similar attacks. On Friday, Science Secretary Peter Kyle told BBC Radio 4's Today programme that the reporting was \"inaccurate\". Both he and Siobhain McDonagh, a Labour MP who appeared on BBC's Politics Live on Thursday, raised comments by a former HR manager, Jane Wayper - which, they said, disproved the BBC News's story.\n\nEPA-EFE/REX/Shutterstock Science Secretary Peter Kyle has criticised the BBC's reporting on Rachel Reeves\n\nWhat did the HR manager say?\n\nWayper spoke to the BBC after being given permission to do so by Reeves's team. She provided an on-the-record statement which said she \"would have been made aware of any investigation which concluded there was a case to answer\" on the basis that she \"would have been required to organise and oversee a disciplinary process\". However, the BBC has not reported that the case reached a formal conclusion, or that there was disciplinary action. Kyle incorrectly claimed that the quote had not been included in our report - but it had been in the article since it was first published on Thursday morning. He also incorrectly referred to Wayper as the head of HR at the bank. In reality she was an HR business partner working in the department where Reeves worked.\n\nWhat has Reeves said?\n\nOn Friday, Reeves was asked about the expenses claims directly. She said: \"No-one ever raised any concerns about my expenses when I worked for Halifax Bank of Scotland.\" She said her expenses had been \"signed off in the proper way\" and \"no issues were ever raised\" during her time at the bank. Her expenses were signed off by her manager, who was also one of the three employees who were the subject of the expenses probe. Reeves left the bank in May 2009, as did her boss. The other senior manager was on sick leave in May and never returned to work at the bank. There is no suggestion any of the departures were linked to the investigation or spending issues and a spokesman for Reeves said the chancellor left the bank on good terms.\n\nWhat has BBC News established about her LinkedIn CV?",
        "word_count": 748,
        "url": "https://www.bbc.com/news/articles/cpvmg924nk1o"
    },
    {
        "title": "Argentina Says It Will Withdraw From WHO",
        "author": "Almudena Calatrava",
        "published_date": "Unknown",
        "content": "BUENOS AIRES — Argentina's president has ordered the country's withdrawal from the World Health Organization due to “profound differences” with the U.N. agency, a presidential spokesperson said Wednesday.\n\nPresident Javier Milei's decision echoes that of his ally, U.S. President Donald Trump, who began the process of pulling the United States out of WHO with an executive order on his first day back in office on Jan. 21.\n\nThe loss of another member country will further fracture cooperation in global health, though Argentina was expected to provide only about $8 million to WHO for the agency’s estimated $6.9 billion 2024-2025 budget.\n\nArgentina’s decision is based on “profound differences in health management, especially during the (COVID-19) pandemic,” spokesperson Manuel Adorni told a news conference in Buenos Aires. He said WHO guidelines at the time led to the largest shutdown “in the history of mankind.”\n\nArgentina will not allow an international organization to intervene in its sovereignty “and much less in our health,” he added.\n\nWHO has no authority to compel countries to take specific health actions, and the organization’s guidelines and recommendations, including in health crises like COVID-19, are often disregarded.\n\nWHO said it was looking into Argentina's announcement.\n\nAdorni did not say when Milei's decision would be implemented. He also asserted that WHO lacks independence because of the political influence of some countries, without naming any.\n\nWHO is the only organization mandated to coordinate global responses to acute health crises, particularly outbreaks of new diseases and persistent threats including Ebola, AIDS and mpox.\n\nMilei was a sharp critic of the lockdown imposed by former President Alberto Fernandez during the pandemic, asserting that it hurt the economy and that the government used it as a mechanism of “repression.\"\n\n\"LONG LIVE FREEDOM,” Milei said Wednesday in a post on X criticizing the U.N. agency.\n\nArgentina does not receive WHO funding for health management, and the president's decision doesn't affect the quality of health services, Adorni said.\n\n“On the contrary, it gives greater flexibility to implement policies adopted to the context of interests that Argentina requires,” he added.\n\nLast year, Milei's government refused to sign an agreement to manage pandemics within the WHO framework, on the grounds that doing so could affect national sovereignty.\n\nThe announcement on the WHO comes ahead of Milei's trip to the U.S. later this month that will coincide with the Conservative Political Action Conference summit of right-wing leaders in Washington. The spokesperson has not confirmed that Milei will attend or that he might meet Trump.\n\n—Associated Press writer Maria Cheng in London contributed.",
        "word_count": 424,
        "url": "https://time.com/7213076/argentina-withdraw-world-health-organization/"
    },
    {
        "title": "Russia is able to fight on in Ukraine for another year but is short on tanks, say military experts",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "By Andrew Osborn and Greg Torode\n\nLONDON (Reuters) -Russia has what it needs to fight on in Ukraine for at least another year and retains the battlefield initiative, but is struggling to replace its destroyed tanks, experts at a leading security research organisation said on Wednesday.\n\nIn what has become a war of attrition now nearing its three-year mark, both sides are sustaining heavy casualties as Moscow's forces slowly but steadily advance at a time when the scale and nature of any future U.S. military aid to Kyiv remains unclear under U.S. President Donald Trump.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nFor now at least, Russia is in a stronger position than Ukraine on the battlefield despite Kyiv seriously reducing the once formidable Russian Black Sea Fleet's room for manoeuvre, experts at the London-based International Institute for Strategic Studies (IISS) said.\n\n\"(With) attrition being such an important factor on land Russia has the initiative and Ukraine is fighting a defensive land battle,\" said IISS senior land warfare analyst Ben Barry.\n\n\"Without any ceasefire the most likely contour of the war over the next few months is more of the same. More bloody attrition on land with very heavy casualties on both sides. If Russia wishes to prolong the war I judge it has the potential human, equipment and logistical resources to continue to do so through the rest of this year.\"\n\nTrump has said he wants to end the war as fast as possible though it’s not yet clear how he intends to do that. Ukraine says it needs both European and U.S. help to ensure its security. Russia says it wants full control of four Ukrainian regions it has claimed as its own, something Kyiv rejects, and for Ukraine to be kept out of NATO.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nRussia and Ukraine accuse each other of not being serious about peace negotiations.\n\nIn its annual assessment of military capabilities, the IISS said that Moscow's total defence spending was higher than total European defence spending in purchasing-power-parity terms.\n\nIt said Russia also appeared better able to maintain the size of its military than Ukraine.\n\n\"While Russia appears to be able to sustain the manning of its forces, evidence suggests that Ukraine, which generally kept its casualty figures secret, has suffered a serious drain on its personnel – with many ground units under-strength,\" the report said.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nUkraine's Defence Ministry this week launched a recruitment drive to attract 18-to-24-year-olds to military service for a year in an attempt to address its manpower problem.\n\n'TANK PROBLEM'\n\nRussia, the report said, had a serious tank and armoured vehicle problem which meant it was taking heavier personnel losses on the battlefield.\n\nMoscow lost 1,400 tanks in 2024 and is struggling to make new tanks at a fast enough rate to replace the old ones despite increasing production of advanced models like the T-90M tank.\n\n\"Russia is increasingly trading quality for quantity to support its war effort,\" the report said.\n\nAdvertisement Advertisement\n\nAdvertisement\n\n\"The scale of its equipment losses fighting against\n\nUkraine has meant that, to keep units equipped, it has had\n\nto draw down from its stocks of Soviet-era armour.\"\n\nThat has seen Moscow fall back on small numbers of vintage armoured personnel carriers built in the 1950s and tanks built in the 1960s, said the IISS, which estimates Russia has lost a total of 4,400 main battle tanks in the war so far.\n\n\"The remaining equipment in store could allow Russia to sustain the current rate of loss in the short term, but a significant number of these platforms would require deep and costly refurbishment,\" the report said.\n\nAdvertisement Advertisement\n\nHenry Boyd, the institute's senior fellow for military capability, said Russia would need to significantly expand its production of new armoured vehicles or look to imports.\n\nAnother problem for Russia, said Nigel Gould-Davies, a Russia specialist at the same research centre, was that the current course of the Russian economy - which he said was suffering from \"fundamental monetary imbalances\" after being put on a war footing - was unsustainable \"in the longer term.\"\n\n(Reporting By Andrew Osborn in London and Greg Torode in Hong Kong; Editing by Gerry Doyle, Jon Boyle and Sharon Singleton)",
        "word_count": 700,
        "url": "https://www.yahoo.com/news/russia-sustaining-loss-forces-better-114217656.html"
    },
    {
        "title": "30% off award flights to Europe on TAP Air Portugal",
        "author": "Caroline Tanner",
        "published_date": "2025-02-18",
        "content": "TAP Air Portugal is offering 30% off award bookings from the U.S. to Portugal and elsewhere in Europe.\n\nRound-trip travel starts at 40,600 Miles&Go miles to select destinations, including Lisbon, Portugal; Madrid; Rome; Paris; and London.\n\nThis deal is available to book through Feb. 24 for travel by March 31.\n\nDeal basics\n\nTAP AIR PORTUGAL\n\nAirline: TAP Air Portugal\n\nRoutes: From New York, Washington, D.C., San Francisco, Miami and others to Portugal, Spain, Italy, France, Germany, Morocco, the U.K. and Denmark, among other destinations\n\nHow to book: Directly through the airline\n\nTravel dates: Through March 31; travel to Venice, Italy, excluded from March 1 to 9\n\nBook by: Feb. 24 at 11:59 p.m. EST\n\nSample flights\n\nTAP AIR PORTUGAL\n\nAs mentioned, round-trip travel starts as low as 40,600 miles from the U.S. to Europe for Miles&Go members only. The following flights were priced as listed at the time of publication, though we cannot guarantee they will be available when you book:\n\nNew York's John F. Kennedy International Airport (JFK) and Miami International Airport (MIA) to Lisbon Airport (LIS), from 49,700 miles\n\nDulles International Airport (IAD) near D.C. to Milan Malpensa Airport (MXP), from 58,000 miles\n\nSan Francisco International Airport (SFO) and Newark Liberty International Airport (EWR) to LIS, from 71,000 miles\n\nMIA to Rome Fiumicino Leonardo da Vinci Airport (FCO), from 84,000 miles\n\nDaily Newsletter Reward your inbox with the TPG Daily newsletter Join over 700,000 readers for breaking news, in-depth guides and exclusive deals from TPG’s experts Email address Sign up By signing up, you will receive newsletters and promotional content and agree to our Terms of Use and acknowledge the data practices in our Privacy Policy . You may unsubscribe at any time.\n\nSale fares are available for economy and business-class fares for MilesOnly tickets and will include the mileage rate plus taxes and fees (which, on average, range from $41 to $120). Economy flights include two free carry-on items and one checked bag.\n\nTAP AIR PORTUGAL\n\nIf you are unable to find your desired routes as advertised, try playing around with your dates if you have flexibility. It's also possible that the advertised rate is no longer available to book.\n\nMaximize your purchase\n\nIf you book this deal, use a credit card that earns bonus points on airfare purchases, such as:\n\nBottom line\n\nThis deal is available for discounted flights from the U.S. to Europe flying TAP Air Portugal. Discounted rates for flights to destinations like Portugal, France, Italy and Germany start as low as 30% off. Given the nature of TAP deals, some flights might not be available as marketed, but flights are available to book through Feb. 24. This deal is exclusive for Miles&Go members, so be sure to sign up if you are not already part of the loyalty program.\n\nAs of last month, you can now also redeem JetBlue TrueBlue points for TAP flights. The best way to redeem TrueBlue points on TAP is for nonstop flights from the U.S. and Canada to TAP's hub cities. Based on our reporting, economy-class flights are available between LIS and various U.S. and Canadian airports starting at 19,000 TrueBlue points each way, plus taxes and fees.\n\nRelated reading:",
        "word_count": 532,
        "url": "https://thepointsguy.com/deals/tap-award-sale/"
    },
    {
        "title": "How the China tariffs will impact what US consumers pay for things",
        "author": "Dan Defrancesco",
        "published_date": "Unknown",
        "content": "This post originally appeared in the Business Insider Today newsletter.\n\nYou can sign up for Business Insider's daily newsletter here.\n\nGood morning. The US Agency for International Development, or USAID, will place nearly all of its direct-hire workforce on administrative leave starting Friday at midnight, according to an email sent to staff on Tuesday evening and posted on the agency's website.\n\nMeanwhile, in today's big story, we're breaking down how the China tariffs will impact what you pay for things .\n\nWhat's on deck\n\nMarkets: What Trump's plan for a US sovereign wealth fund could look like.\n\nTech: An Amazon VP reiterated the company's commitment to DEI initiatives in an internal meeting.\n\nBusiness: The White House says more than 20,000 federal workers have taken buyouts, and more will come .\n\nBut first, the tariff fight isn't over.\n\nIf this was forwarded to you, sign up here.\n\nThe big story\n\nThe cost of a trade war\n\nSAUL LOEB/AFP via Getty Images\n\nThe trade war between Washington and Beijing is set to take place in US consumers' wallets.\n\nFrom new phones to kitchen appliances and clothes, President Donald Trump's additional 10% tax on Chinese imports could result in a slew of higher prices , write Theron Mohamed and Ayelet Sheffey.\n\nWith China sending $427 billion in goods to the US in 2023 (the most recent year of full data), there are no shortages of things that will be affected by the tariffs.\n\nIt's not just expensive tech like computers and cellphones that's at risk. The closure of a loophole allowing importers to avoid taxes on shipments valued less than $800 when sent directly to consumers has left brands like Shein and Temu scrambling .\n\nConcerns about logistics continued yesterday when the US Postal Service said that it is suspending inbound parcels from China and Hong Kong until further notice , effective immediately. While only parcels are impacted, the suspension may cause exporters to use alternative logistics companies like DHL, UPS, and FedEx. That might cause a demand surge that could increase freight costs, an expert told BI.\n\nPDD Holdings, Temu's parent company, was down 6% in premarket trading this morning following the USPS announcement.\n\nCompanies haven't been shy about saying they'll need to raise prices due to tariffs , and the taxes also provide cover to juice their costs regardless of the tariffs' real impact.\n\nEven trade plans that might never come to fruition — Mexico and Canada — could still cause enough uncertainty that they disrupt supply chains, leading to higher prices .\n\nWith so many unknowns, some investors are hedging their bets using outcome ETFs and monitoring 21-day realized volatility to reduce downside risk while not completely cannibalizing their returns.\n\nIf that all sounds like a foreign language to you, there's always the prediction markets. Over there, you can wager on where some of President Trump's next tariffs might land .\n\nGetty Images; Jenny Chang-Rodriguez\n\nAnother corner of the economy is leaving US consumers feeling pretty beat.\n\nRising egg prices are so severe that Waffle House is charging a 50-cent fee for each egg it sells . The restaurant chain said it opted for a surcharge over a blanket price increase across its menu.\n\nThe eggs-tra fee is only supposed to be temporary, but this won't be over easy. Data from the US Department of Agriculture projects the average price for a dozen eggs won't drop from $4.80 to $2.50 until the second quarter .\n\nThat's not egg-celent news, but it's tough to blame anyone. As BI's Emily Stewart previously covered, a combination of bird flu and increased demand has scrambled the egg market .\n\nNews brief\n\nTop headlines\n\nWhat's happening today\n\nDisney, News Corp, Ford, and Uber report earnings.\n\nThe Insider Today team: Dan DeFrancesco, deputy editor and anchor, in New York. Grace Lett, editor, in Chicago. Ella Hopkins, associate editor, in London. Hallam Bullock, senior editor, in London. Amanda Yen, associate editor, in New York. Elizabeth Casolo, fellow, in Chicago.",
        "word_count": 662,
        "url": "https://www.businessinsider.com/how-china-tariffs-impact-us-consumer-wallets-2025-2"
    },
    {
        "title": "New Trailer for 'On Falling' Film - About Loneliness in the Gig Economy",
        "author": "Alex Billington",
        "published_date": "2025-02-17",
        "content": "New Trailer for 'On Falling' Film - About Loneliness in the Gig Economy\n\n\"When you're not at work, what sort of things do you like to do?\" Letterboxd has debuted the full official UK trailer for an indie film titled On Falling, the feature directorial debut of Portuguese filmmaker Laura Carreira. This premiered at TIFF 2024 last year, and also played at the London, San Sebastian, Thessaloniki, and Rome Film Festivals. it focuses on Aurora, a Portuguese worker in a Scottish warehouse, navigating loneliness and alienation in an algorithm-driven gig economy as she seeks meaning and connection amidst solitude and workplace confines. The film stars Joana Santos, Inês Vaz, Piotr Sikora, Jake McGarry, and Neil Leiper. This received mostly positive reviews. It's described as \"social cinema that is worthwhile\" that's a \"clear, cold, tender, merciless and, above all, unforgettable film.\" Fits right alongside Ken Loach's films; the poster states it's from the same producers as I, Daniel Blake & The Old Oak anyway. Take a look.\n\nHere's the official UK trailer (+ first poster) for Laura Carreira's film On Falling, direct from Twitter:\n\nExclusive first look at the new trailer for On Falling, winner of Best Director at San Sebastian and Sutherland Award at @BFI London Film Festival ✨ In cinemas in the UK and Ireland by @ConicFilm on 7 March. pic.twitter.com/cBbFCBXO6e — Letterboxd (@letterboxd) February 17, 2025\n\nSet in Scotland, the plot follows the plight of Portuguese immigrant and warehouse worker named Aurora (starring Joana Santos), trapped in a life governed by wage slavery and social isolation up in Glasgow, depicting her emotional breakdown. On Falling is written and directed by up-and-coming Portuguese indie filmmaker Laura Carreira based in Scotland, making her feature directorial debut after a few other short films previously. Produced by Jack Thomas-O’Brien (Sixteen Films) & Mário Patrocínio (BRO Cinema). This initially premiered at the 2024 Toronto Film Festival last year in the Discovery section, and it also played in the San Sebastian and London Film Festivals. Carreira's On Falling film will open in UK + Ireland cinemas starting March 7th, 2025 coming soon. No US release date is set yet - stay tuned. Who's interested in this?",
        "word_count": 362,
        "url": "https://www.firstshowing.net/2025/new-trailer-for-on-falling-film-about-loneliness-in-the-gig-economy/"
    },
    {
        "title": "Delta SkyMiles flash sale for award travel to Europe",
        "author": "Senitra Horbrook",
        "published_date": "2025-01-28",
        "content": "Searching for a late-winter or spring break getaway? Now's the time to snag a deal with Delta Air Lines' three-day flash sale on award travel to Europe.\n\nYou'll want to book quickly as this sale only lasts through Thursday, Jan. 30.\n\nDeal basics\n\nAirline: Delta\n\nRoutes: From the continental U.S. to select European destinations\n\nHow to book: Online with Delta\n\nTravel dates: Feb. 11-March 31\n\nBook by: Thursday\n\nThis deal is for round-trip flights, both nonstop and connecting, from the continental U.S. to Europe, including Amsterdam, Brussels, Frankfurt, London, Munich, Paris and Zurich.\n\nDiscounted award flights start at 34,000 miles round-trip for basic economy and 54,000 miles round-trip for Main Cabin, plus taxes, fees and baggage charges. If you have a Delta SkyMiles American Express card, you can save an extra 15% when booking award travel on Delta.\n\nDaily Newsletter Reward your inbox with the TPG Daily newsletter Join over 700,000 readers for breaking news, in-depth guides and exclusive deals from TPG’s experts Email address Sign up By signing up, you will receive newsletters and promotional content and agree to our Terms of Use and acknowledge the data practices in our Privacy Policy . You may unsubscribe at any time.\n\nRelated: How to use and maximize Delta's TakeOff 15 feature to save on award tickets\n\nSample fares\n\nTo book, head to the SkyMiles Award Deals page at delta.com. Select your departure city, and then you'll see the list of award deals for select European destinations. The lowest rates can be found departing from larger airports like Hartsfield-Jackson Atlanta International Airport (ATL), Los Angeles International Airport (LAX) and New York's John F. Kennedy International Airport (JFK).\n\nDELTA\n\nHowever, this flash sale is not just limited to hub airports or large cities. Deals can also be found at smaller airports like Eastern Iowa Airport (CID), Dayton International Airport (DAY) and Pensacola International Airport (PNS), albeit at slightly higher rates.\n\nDELTA\n\nThe deals page does not seem to have a comprehensive list of sale flights. You can also search for your departure city and destination right from Delta's homepage to see if a deal is available. Select \"My dates are flexible\" to see the lowest-priced award flights within the time period of Delta's award sale.\n\nFor example, searching for a flight from Dallas Fort Worth International Airport (DFW) or Dallas Love Field (DAL) to Rome Fiumicino Leonardo da Vinci Airport (FCO) brings up a few basic economy options for as low as 36,000 miles round-trip, even though Rome is not on the promoted list of destinations.\n\nDELTA\n\nAnd flights from Dallas to Rome are as low as 54,000 miles round-trip for a Main Cabin award.\n\nDELTA\n\nMaximize your purchase\n\nEven though you are booking with miles, don't forget to use a credit card that earns points for airfare purchases, as you still have to pay taxes and fees.\n\nBottom line\n\nWinter scene of the Amstel River in the center of Amsterdam. ROEVIN/GETTY IMAGES\n\nIf you've been looking to book late-winter or spring break travel to Europe, Delta Air Lines has some deals for round-trip flights starting at 34,000 SkyMiles for basic economy. Be sure to book by Thursday.\n\nRelated reading:",
        "word_count": 527,
        "url": "https://thepointsguy.com/deals/delta-flash-sale-europe/"
    },
    {
        "title": "Wes Streeting accuses Nigel Farage of 'miserablist' vision for UK",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Streeting accuses Farage of 'miserabilist' vision for UK\n\n25 January 2025 Damian Grammaticas Political Correspondent Kathryn Armstrong BBC News\n\nEPA Wes Streeting spoke of the need to counter what he called the \"populist right\"\n\nThe health secretary has accused Reform UK leader Nigel Farage of having a \"miserablist, declinist\" vision of the UK, in the most direct attack yet by a senior Labour figure. Wes Streeting made the comments in a speech on Saturday at the Fabian Society, a left-leaning organisation, warning of the need to take the \"populist right\" seriously. He accused Farage of not believing in a universal health service \"free at the point of use\", and of having a \"poverty of ambition\" for the UK that Labour \"utterly rejects\". Farage responded by saying it was Labour who had the miserable vision and that Reform was the \"optimistic alternative\".\n\n\"The crux of Farage's argument is this: what was possible in the 20th Century isn't possible in the 21st,\" Streeting told his audience. \"People shouldn't have to choose between a health service that treats them on time and an NHS free at the point of use.\" Nigel Farage has previously suggested that the NHS could be replaced by an insurance-based system. However, Reform policy documents say healthcare should always remain free at the point of delivery. \"The populist right are coming for us and we need to be serious about beating them,\" Streeting said, adding that Farage could be defeated by \"turning around the NHS\". The health secretary spoke of meeting people every day on the campaign trail \"who had been let down by the NHS\", being made to wait for ambulances or operations. Some voters had \"the most appalling experiences, and because of how they've been treated, they were voting for Reform\", he said. Farage wrote on social media following the speech that Streeting \"is so scared of Reform that he has now resorted to lying about our plans for the NHS\". \"Let me be clear, the NHS will always be free at the point of delivery under a Reform government,\" he added. Farage has said that his ultimate goal is to win the next general election, building on the momentum that Reform has recently enjoyed. While his party has largely been viewed as a threat to the Conservatives, in recent weeks it has been gaining ground on both Labour and the Tories in opinion polls. One recent YouGov poll, which asked people who would make the best prime minister, suggested similar levels of support for both Nigel Farage and Sir Keir Starmer.",
        "word_count": 425,
        "url": "https://www.bbc.com/news/articles/cwyp548gj8vo"
    },
    {
        "title": "Russia could be allowed to keep its military bases, Syria says",
        "author": "Mia Jankowicz",
        "published_date": "Unknown",
        "content": "Syria is open to allowing Russia to hold onto two key military bases after Bashar Assad's ousting.\n\nSyria's new defense minister said that relations with Russia, which supported Assad, have improved.\n\nHmeimim and Tartus bases are strategic for Russia, offering major air and naval advantages.\n\nSyria is open to allowing Russia to keep hold of its two military bases in the country, two months after rebel groups ousted Kremlin ally Bashar Assad and set in motion a Russian troop and military equipment withdrawal.\n\nIn an interview with the Washington Post, Syrian Defense Minister Murhaf Abu Qasra said that there is a possibility Russia could hold onto the bases — Hmeimim air base and Tartus port — \"if we get benefits for Syria out of this.\"\n\nIt's not clear what military, economic, or political support could be offered, but Abu Qasra said that Russia's stance had \"improved significantly\" toward the new government.\n\nAssad, who ruled Syria for 24 years, fled to Russia in early December after a lightning two-week military campaign by rebel forces.\n\nThis threw Russia's hold on the bases — described by Andreas Krieg, a Gulf specialist at the Institute of Middle Eastern Studies at King's College London, as Russia's \"most important bases outside the direct sphere of Russian influence\" — into question.\n\nRussia was granted a 49-year lease on the bases in 2017 in return for military assistance.\n\nAt the end of January, Russian Deputy Foreign Minister Mikhail Bogdanov said that \"nothing has changed\" and that preserving Russian access to the bases \"requires additional negotiations,\" according to Russian state-controlled news agency TASS.\n\nPrior to his ousting, Assad had enjoyed strong military and political support from Russian President Vladimir Putin, who stationed troops there and helped suppress rebel areas and a 2015 uprising with air and missile strikes.\n\nWithin days of Assad's removal, satellite images picked up a flurry of Russian activity at the bases: equipment being packed up, ships moving in and out of port, and the likely transfer of soldiers.\n\nIn January, Ukraine said that Russia was moving military gear from Tartus to Libya, where it also has a strong influence.\n\nThe Syrian bases are a key foothold in the Middle East and beyond for Russia.\n\nHmeimim affords Russian air forces a base for refueling and overflight for much of Africa. Tartus, on the Mediterranean, is unique in Russia's assets in being its only warm-water port with direct access to the oceans.\n\nThe rebel groups now governing Syria were previously targetted by Russian forces, but Abu Qasra told the Post, \"in politics, there are no permanent enemies.\"\n\nOne trump card held by Russia is Assad himself. According to the Post, the new Syrian government wants Assad's extradition so that he can be held to account for his bloody rule.",
        "word_count": 462,
        "url": "https://www.businessinsider.com/russia-could-keep-hold-of-key-syria-military-bases-minister-2025-2"
    },
    {
        "title": "Assessing Trump's claim that U.S. pays 'unfair' share of dues to WHO",
        "author": "Ari Daniel",
        "published_date": "2025-01-22",
        "content": "Assessing Trump's claim that U.S. pays 'unfair' share of dues to WHO\n\ntoggle caption Fabrice Coffrini/AFP/Getty Images\n\nNewly inaugurated, President Trump took a set of thick, black sharpies on Monday and signed a flurry of executive orders — including one that has people in the global health community deeply concerned. That order would withdraw the United States from the World Health Organization , a U.N. global health agency the U.S. helped found in 1948.\n\nAs he penned his name to the order, Trump began by saying, \"Ooh, that's a big one.\" He then offered a set of spontaneous remarks about the rationale behind the withdrawal, which focused on what he and his team perceive as an unfair allocation of dues.\n\nSponsor Message\n\nHe noted that the U.S. pays WHO $500 million annually compared to China's $39 million contribution. But Trump raised the point: Should the U.S. pay so much more than China when its population (1.4 billion people) is way larger than the American population ( 341 million estimate by the Census Bureau).\n\n\"Seemed a little unfair to me,\" he said.\n\nThe executive order offered a couple of additional rationales for the withdrawal, including an assertion that WHO mishandled the COVID-19 pandemic as well as other global health crises, that member states leverage worrisome political influence and that the body \"fail[ed] to adopt urgently needed reforms.\"\n\nWere Trump's numbers accurate? And did they capture the full picture of the organization's financing?\n\nWho's giving to WHO\n\nThe World Health Organization receives funding from two pots. The first is a set of assessed contributions from its nearly 200 member states. Each assessment is determined by the United Nations and based on a country's \"capacity to pay,\" which involves both the size of its population and wealth . Member states vote to approve the assessments at the World Health Assembly every other year. For the years 2024-2025, WHO says that number has been set at $264 million for the U.S. and $181 million for China.\n\nSponsor Message\n\nThese assessed contributions constitute less than 20% of WHO's total budget.\n\nThe second, larger pool of funding involves voluntary contributions that originate from member states, philanthropic foundations like the Gates Foundation (which is a funder of NPR and this blog), corporations, nongovernmental organizations and private citizens. This voluntary basket is where the discrepancy between countries is more apparent. Across the same 2024-2025 time period, WHO says the U.S. is projected to provide $442 million (the largest voluntary contribution by far) whereas China is set to contribute just $2.5 million.\n\nAdding up those numbers, the U.S. had been on track to pay $706 million (not quite 10% of WHO's budget) and China $184 million (almost 3% of the budget).\n\nIn other words, Trump correctly captured a difference in what the U.S. and China pay WHO but didn't get the numbers or proportions right. If he were referring to a combination of assessed and voluntary contributions, he asserted that China pays not quite 8% of what the U.S. pays. In fact, that number is closer to 26%.\n\nLoading...\n\nWhat Trump's withdrawal means\n\nBeyond the finances, there's the message that a U.S. withdrawal from WHO would send.\n\n\"It would signal an attack by the largest and most economically powerful country in the world on international health cooperation,\" says David McCoy , a public health researcher at the United Nations University International Institute for Global Health based in Kuala Lumpur, Malaysia.\n\nThat cooperation, he argues, is essential for managing pandemics and other cross-border health threats.\n\nIn a statement, WHO expressed regret over the Trump administration's announcement to withdraw.\n\n\"We hope the United States will reconsider,\" the agency said, \"and we look forward to engaging in constructive dialogue to maintain the partnership between the USA and WHO, for the benefit of the health and well-being of millions of people around the globe.\"\n\nAny potential WHO shortfall because of the U.S. withdrawal will have an impact of course, one felt mainly by low- and middle-income countries that \"are attracting more than their fair share of conflict and disaster,\" says Andrew Harmer , a global health policy researcher at Queen Mary University of London.\n\nSponsor Message\n\nAnd it's challenging for a complex intergovernmental organization to shift its operations when it loses a significant slice of its operating budget.\n\n\"WHO's responsibilities to promote and protect public health should be as much as possible safeguarded from the kinds of tensions and conflicts and politics that go on between countries,\" says McCoy.\n\nThe effect will not be immediate, however. WHO's funding for 2025 is already secured, including from the U.S. The question is whether the organization will have to adjust its priorities according to a much-reduced budget starting in 2026.",
        "word_count": 784,
        "url": "https://www.npr.org/sections/goats-and-soda/2025/01/22/g-s1-44066/trump-world-health-organization"
    },
    {
        "title": "Bill Gates: 3-Hour Trump Dinner “Productive;” Elon Musk’s Wading Into Overseas Politics “Insane”",
        "author": "Caroline Frost, .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow, Class, Wp-Block-Co-Authors-Plus, Display Inline, .Wp-Block-Co-Authors-Plus-Avatar, Where Img, Height Auto Max-Width, Vertical-Align Bottom .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow .Wp-Block-Co-Authors-Plus-Avatar, Vertical-Align Middle .Wp-Block-Co-Authors-Plus-Avatar Is .Alignleft .Alignright",
        "published_date": "2025-01-25",
        "content": "Bill Gates has been forthcoming with his take on the recent shift in US politics, after a three-hour dinner with Donald Trump last month that the tech titan called “engaging.”\n\nSpeaking to The Times of London newspaper, Gates confirmed that he’d sat down in December with then-president elect Trump at his Florida home of Mar-a-Lago. Gates recounted:\n\n“On December 27 I had a three-hour dinner with Trump… It was quite an engaging conversation where he listened to me talk about HIV and the need to stay generous and to innovate to get a cure. I talked a lot about polio and energy and nuclear, and he wasn’t dismissive.”\n\nOf his need to work with Trump on his own tireless campaign for funding for vaccines to help eradicate diseases particularly in the developing world, Gates said:\n\nWatch on Deadline\n\n“There is so much up in the air with him — is he going to deport nine million or one million? Is he going to have 60 per cent tariffs or 5 per cent? Is he going to fund infectious disease innovation or end it? I need to stay close. Whoever gets to enthuse President Trump about the right things, that is God’s work.”\n\nGates sounded less enthused by the prospect of Elon Musk’s continuing interest in the politics of the UK and into Europe and Asia, and his propensity to express his opinions on his social media platform X. Gates called it “really insane that he can destabilise the political situations in countries.”\n\nRELATED: Grimes Reacts To Elon Musk Backlash After Controversial Nazi-Like Gesture: “I Am Not Him”\n\nHe expended: “I think in the US foreigners aren’t allowed to give money; other countries maybe should adopt safeguards to make sure super-rich foreigners aren’t distorting their elections. It’s difficult to understand why someone who has a car factory in both China and in Germany, whose rocket business is ultra-dependent on relationships with sovereign nations and who is busy cutting $2 trillion in US government expenses and running five companies, is obsessing about this grooming story in the UK. I’m like, what?\n\n“We can all overreach… If someone is super-smart, and he is, they should think how they can help out. But this is populist stirring.”",
        "word_count": 373,
        "url": "https://deadline.com/2025/01/bill-gates-dinner-donald-trump-engaging-elon-musk-involvement-uk-politics-insane-1236267802/"
    },
    {
        "title": "Griff Witte Joining The Atlantic as a Managing Editor",
        "author": "Unknown",
        "published_date": "2025-01-22",
        "content": "Dear everyone,\n\nWe’re very happy to let you know that Griff Witte is joining The Atlantic as a managing editor. Griff, who is currently the senior editor at The Washington Post in charge of political and democracy coverage, will be leading our growing politics and accountability team. As many of you know already, Griff is a journalistic force, who has led his 50-person team at The Post with energy, creativity, smarts and ambition. His experience on the democracy beat, in particular, will help us in our coverage of the various challenges to the American way of governance.\n\nGriff comes to us after a storied, 23-year run at The Post, where he spent much of his time as a foreign correspondent. As a stalwart of the foreign desk, he covered insurgencies in Afghanistan and Pakistan, wars in Gaza, the Arab Spring uprising in Egypt, the return of autocracy in central Europe, and the dawn of the Brexit era in Britain. His reports on refugees crossing into Europe, and on hate-preachers radicalizing followers in Britain, were recognized, respectively, by the National Press Foundation and the Overseas Press Club. In between international postings, Griff served as the newspaper's deputy foreign editor and guided prize-winning coverage of the wars in Iraq and Afghanistan.\n\nIn his new role for us, Griff will help build and lead our coverage of politics and democracy, with a special focus on government accountability and investigations. In addition to his own impressive track record of reporting stories on these broad beats, Griff has earned the admiration of his reporters for his ability to edit the sort of complicated, scoop-driven, and otherwise revelatory stories that will be critical to our mission as we try to cover and explain the actions of the Trump Administration. Griff is highly collaborative and fearless, qualities that will serve The Atlantic well in the months and years ahead.\n\nGriff’s decision to join The Atlantic represents an intergenerational homecoming, of sorts. His father, the legendary artist Michael Witte, illustrated covers and made other art for The Atlantic in the 1980s (and if we’re lucky, we'll get him drawing for us again).",
        "word_count": 354,
        "url": "https://www.theatlantic.com/press-releases/archive/2025/01/griff-witte-joining-atlantic-managing-editor/681402/"
    },
    {
        "title": "‘We Want The Funk,’ ‘And So It Begins’ And More Coming To Public Television’s ‘Independent Lens’ This Spring",
        "author": "Matthew Carey, .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow, Class, Wp-Block-Co-Authors-Plus, Display Inline, .Wp-Block-Co-Authors-Plus-Avatar, Where Img, Height Auto Max-Width, Vertical-Align Bottom .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow .Wp-Block-Co-Authors-Plus-Avatar, Vertical-Align Middle .Wp-Block-Co-Authors-Plus-Avatar Is .Alignleft .Alignright",
        "published_date": "2025-02-14",
        "content": "EXCLUSIVE: The spring lineup for the Emmy-winning documentary showcase Independent Lens is looking funky, by design.\n\nWE WANT THE FUNK!, “a syncopated voyage through the history of funk music” directed by Stanley Nelson and co-directed and produced Nicole London, is set to debut April 8 on the long-running PBS series. The documentary, featuring James Brown, George Clinton, Questlove, David Bowie, and Elton John, explores “the funk genre’s influence on contemporary music, fashion, freedom of expression, and its role in the rise of hip-hop.” Scroll for the full spring IL lineup.\n\nLeni Robredo (left) campaigns for president of the Philippines in ‘ And So It Begins Independent Lens\n\nAlso coming to Independent Lens soon is And So It Begins, directed by Ramona S. Diaz, the latest in the filmmaker’s examination of the politics of the Philippines in the post-Ferdinand Marcos era. Diaz directed Imelda, a 2004 documentary about former Philippines First Lady (and mother of the country’s current president) Imelda Marcos. Her 2020 film A Thousand Cuts chronicled the fight for press freedom by Nobel Peace Prize winner and journalist Maria Ressa, who came under attack during the presidency of right-wing populist leader Rodrigo Duterte.\n\nWatch on Deadline\n\n“On April 29, Independent Lens features one of America’s most beloved institutions: the public library,” notes a release. “Free for All: The Public Library explores the U.S. public library system, a simple idea that shaped a nation. On May 5, the third and final installment of the informative Matter of Mind series, which examines neurodegenerative diseases, spotlights Alzheimer’s in Matter of Mind: My Alzheimer’s. Who is Michael Jang? will premiere on May 12 and chronicles the work of the elusive street photographer at a flashpoint in his career.”\n\nCommenting on the upcoming IL lineup, Executive Producer Lois Vossen said, “This spring, Independent Lens looks to inspire you. The story of funk music will make you get up and dance. The history and legacy of public libraries remind us why our country endorsed free education. We celebrate the work of caregivers who provide for loved ones with Alzheimer’s and the groundbreaking art of an Asian American photographer celebrates a community and a culture. Prepare to be encouraged.”\n\n(Vossen appears on the newly released episode of Industry Insights – The EFM Podcast. You can listen to that here). She also appeared on Deadline’s Doc Talk podcast recorded at the IDA Awards in December, where Independent Lens won Best Curated Series).\n\nBelow are more details on the spring lineup for Independent Lens:\n\n● WE WANT THE FUNK! – April 8 – We Want the Funk! is a syncopated voyage through the history of funk music, spanning from African, soul, and early jazz roots, to its rise into the public consciousness. Featuring James Brown’s dynamism, the extraterrestrial funk of George Clinton’s Parliament-Funkadelic, transformed girl group Labelle, and Fela Kuti’s Afrobeat, the story also traces funk’s influences on both new wave and hip-hop.\n\n● FREE FOR ALL: THE PUBLIC LIBRARY – April 29 – Free for All: The Public Library tells the story of the quiet revolutionaries who made a simple idea happen. From the pioneering women behind the “Free Library Movement” to today’s librarians who service the public despite working in a contentious age of closures and book bans, meet those who created a civic institution where everything is free and the doors are open to all.\n\n● MATTER OF MIND: MY ALZHEIMER’S – May 5 – Matter of Mind: My Alzheimer’s is an intimate portrayal of three families confronting the unique challenges of Alzheimer’s and how this progressive neurodegenerative disease transforms roles and relationships. Whether it’s a partner becoming a caregiver or an adult child shifting into being their parent’s caretaker, these stories show how families evolve when a loved one is diagnosed.\n\n● AND SO IT BEGINS – May 12 – And So It Begins follows the Philippines’ turbulent 2022 presidential race, with the son of ousted former dictator Ferdinand Marcos waging a combative social media campaign against his more progressive opponent, incumbent Vice President Leni Robredo. Following it all is independent journalist and Nobel Prize-winner Maria Ressa, with an eye toward the specter of increasing autocracy.\n\n● WHO IS MICHAEL JANG? – May 19 – After a long career as a commercial and portrait photographer, mischievous San Francisco artist Michael Jang sat for decades on a hidden treasure of pictures taken in his 20s—both candid celebrity shots and a down-to-earth cross-section of Chinese American family life rarely captured so playfully. Then, during the pandemic, Jang set out to share his work with the world, street guerilla-style.\n\nAll films will also be available to stream on the PBS app following premiere day.",
        "word_count": 777,
        "url": "https://deadline.com/2025/02/independent-lens-spring-2025-lineup-1236289019/"
    },
    {
        "title": "Alleged spy thought she was helping find fugitive, trial hears",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Alleged spy 'thought she was helping find fugitive'\n\nVanya Gaberova, Katrin Ivanova and Tihomir Ivanchev, all from London, deny a charge of conspiracy to spy\n\nThe Bulgarian nationals were allegedly involved in multiple espionage operations against people and places of interest to the Russian state.\n\nMs Ivanova, 33, Vanya Gaberova, 30, and Tihomir Ivanchev, 39, all from London, deny a charge of conspiracy to spy.\n\nAppearing at the Old Bailey, Katrin Ivanova said she did trail a Russian man in Montenegro but believed that he was \"wanted\" for financial fraud.\n\nA woman accused of spying for Russia believed she was helping to find a fugitive wanted by Interpol, she has told a court.\n\nMs Ivanova also denies possessing multiple false identify documents.\n\nShe was asked by her barrister what she thought she was doing in Montenegro on an operation related to Kiril Kachur, designated as a foreign agent by Russia.\n\nMs Ivanova told jurors that her partner Biser Dzhambazov had said Mr Kachur was a \"fugitive\" wanted by Interpol.\n\n\"I'm looking for the bad man who stole a lot of money from people in Russia,\" she said.\n\nMs Ivanova said she believed she would share in a \"big reward\" from Interpol when Mr Kachur was captured, and that information she gathered was passed to Orlin Roussev, who in turn passed it to Interpol.\n\nRoussev, 46, from Great Yarmouth, and Dzhambazov, 43, from London, have already pleaded guilty to conspiracy to spy for Russia.\n\nAnswering questions from Mozammel Hossain KC, barrister for Mr Ivanchev, Ms Ivanova wiped away as tears as she agreed that Dzhambazov was \"deceitful and dishonest\" and had \"fooled\" her.\n\nProsecutor Alison Morgan KC opened her questioning of Ms Ivanova by asking: \"Are you a good actress?\"\n\n\"I don't think so,\" Ms Ivanova said.\n\nMs Morgan went on to list examples of the defendant's \"lies\" and asked Ms Ivanova if she was as \"deceitful\" as Roussev and Dzhambazov. Ms Ivanova said she was not but had been \"in denial for a very long time\".\n\nMs Ivanova said she was not aware of false passports found by police in a London flat she shared with Dzhambazov.\n\nWhen asked if Roussev and Dzhambazov had \"used her for three years\", she said \"yes, the same as the other two in the dock\", as Ms Gaberova and Mr Ivanchev looked on.",
        "word_count": 389,
        "url": "https://www.bbc.com/news/articles/c0lzk6xdwg1o"
    },
    {
        "title": "War in Ukraine: Teen's journey from home to Oxford University",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "'I fled Ukraine speaking basic English - now I'm off to Oxford University'\n\n2 February 2025 Nicola Bryan BBC News\n\nWestbourne School, Penarth Illia and his mother fled Ukraine in May 2022 and live with a host family in south Wales\n\nWhen war broke out in Ukraine 15-year-old Illia Mitiushnikov was forced to flee his home and family, and claim asylum in Wales. Almost three years on, he is about to follow in the footsteps of no fewer than five British prime ministers after securing a place on one of the most prestigious degree courses at the University of Oxford. Philosophy, Politics and Economics (PPE) at Oxford has been described by the Guardian as \"the Oxford degree that runs Britain\". Its list of alumni includes former prime ministers David Cameron, Rishi Sunak, Liz Truss, Edward Heath and Harold Wilson, as well as other British and global political heavyweights such as Tony Benn, Bill Clinton and Aung San Suu Kyi. It is a remarkable achievement for the 18-year-old, who said his English was \"not so good\" before arriving in the UK.\n\nIllia Mitiushnikov Illia's dad (far left) remains in Ukraine\n\nUntil May 2022, Illia lived in Vinnytsia, central Ukraine, with his parents and their now 11-year-old cocker spaniel Simba. After being accepted onto the Homes for Ukraine Sponsorship Scheme, Illia and his mother packed a suitcase each and made the journey to Wales, taking a train to Poland, a flight to London and a bus to Cardiff where they were met by their hosts. \"It was both emotionally hard and physically hard,\" said Illia, recalling the long journey. They moved in with their hosts, a couple with three young children, in Barry, Vale of Glamorgan. \"I was very delighted when I came here,\" said Illia. \"I was really grateful to my host family that they agreed to accept me and my mum because it's quite stressful to just meet completely new strangers and just let them stay in your house.\" It was his host family who suggested he apply to Westbourne School, an independent school in nearby Penarth, and he was offered a free place under its refugee scholarship scheme.\n\nWestbourne School, Penarth Illia had been studying for an International Baccalaureate Diploma Programme at Westbourne School in Penarth\n\nIn the summer of 2023, he sat his GCSEs, achieving 10 A*s. He then began the school's International Baccalaureate Diploma Programme in place of A-Levels. Thoughts of studying at the University of Oxford were prompted by a visit to the city. \"That's when the dream started to appear in my mind,\" he said. Then when on work experience at a bank in London last summer he spoke to graduates and decided to go for it.\n\nBut initially he had doubts he could achieve his ambition. \"Part of me was like, 'it's too much for me'... and then another part of me was thinking 'if others can do it, why can't I do it also'.\" Knowing what people in Ukraine were experiencing drove him to work hard. \"I can't let myself have a lot of rest because I know how people are feeling in Ukraine,\" he said. \"I imagine the lives of all the soldiers who fight 24/7 for Ukraine and I can't let myself chill out. \"It was like a new goal for me, I just had to do this, I had no other chance.\"\n\nWestbourne School, Penarth Illia was one of six students from Ukraine offered a free place to study at Westbourne\n\nThe day he was accepted was emotional. \"I called my family straight away and they were just crying from happiness,\" he said. He is full of gratitude for his host family and his teachers and is looking forward to receiving an \"insanely good\" education and making new friends at St Hilda's College, Oxford. And what are his plans for the future? He said he hoped Oxford would give him knowledge he could use to \"improve the worldwide situation\". But initially he intends to work in banking, \"just to stabilise in life, to help my family\". Like many of his PPE predecessors he also has his eye on a career in politics. \"I would like to help the world, help nations to develop, solve international crises, like the current war with Ukraine and Russia,\" he said. \"I hope it will end before then obviously but there are other conflicts to solve.\"\n\nWestbourne School, Penarth Illia hopes to have a career in politics",
        "word_count": 742,
        "url": "https://www.bbc.com/news/articles/c5ye0py04xpo"
    },
    {
        "title": "London police crackdown on phone snatching sees 230 arrests in one week",
        "author": "Ben Lovejoy, Chance Miller, Ryan Christoffel, Michael Burkhardt, Dell Curved Monitor",
        "published_date": "2025-02-07",
        "content": "A Metropolitan Police crackdown on phone snatching in London has seen 230 people arrested and more than 1,000 phones recovered in the space of just one week.\n\nThe police service also reported that a gang found guilty of handling more than 5,000 stolen phones have been sentenced to a total of 18 years in prison …\n\nLondon police crackdown on phone snatching\n\nBBC News reports that the police used a mix of phone tracking and deployment of plain-clothes officers in known crime-spots to catch the thieves.\n\nA clampdown on the “industrial-scale” crime of mobile phone-snatching across London has resulted in 230 people being arrested by the Metropolitan Police in the past week. In its battle against the “scourge of mobile phone crime”, the force said it had also seized more than 1,000 handsets. It said its work had been “ramped up” to deal with the £50m-a-year trade in stolen phones across the capital, with those responsible for thefts, handling, and onward criminal supply all being targeted.\n\nThe most common tactic employed by smartphone thieves is to ride stolen scooters and ebikes looking for people using their phones on the street. They then ride onto sidewalks, coming up behind victims in order to snatch the devices.\n\nEarly on, safety concerns had led police to discontinue pursuits of scooter riders when the risks to the riders were deemed too high. However, after complaints from the public about this, the policy was changed, allowing officers to continue pursuit and use “tactical contact” to knock them off the vehicles.\n\nYou can enjoy a few examples of this here:\n\nApple’s introduction of Activation Lock way back in 2013 led to dramatic reductions in iPhone thefts in some cities, though the impact was variable as they could still be stolen for parts.\n\nThe later launch of parts pairing offered further deterrent, though the practice proved extremely controversial due to issues with DIY repairs. Apple later provided a solution to this through a process of “blessing” replacement parts.\n\nImage: Metropolitan Police",
        "word_count": 334,
        "url": "https://9to5mac.com/2025/02/07/london-police-crackdown-on-phone-snatching-sees-230-arrests-in-one-week/"
    },
    {
        "title": "Berlin film festival to try to keep politics at bay",
        "author": "Unknown",
        "published_date": "2025-02-11",
        "content": "Preparations are well underway for the 75th edition of the Berlinale\n\nBy Femke COLBORNE and Adam PLOWRIGHT\n\nThe Berlin Film Festival, which begins this week, is set for a challenge faced by the entire Western arts industry: how to stop politics from taking over the conversation.\n\nThe first major European film festival of the year saw its 2024 edition overshadowed by a row about Israel's bombardment of Gaza that left a mark on many filmmakers.\n\nThis year, Germany's national election -- which polls suggest could see unprecedented gains for the far-right AfD party -- falls on the final Sunday of the festival on February 23.\n\nThe festival's new director Tricia Tuttle said the Berlinale would not \"shy away\" from current events, but she hoped they would not entirely eclipse the on-screen stories.\n\n\"For all festivals and all culture right now, the news agenda can often dominate the discourse,\" she added as she presented this year's lineup on January 21.\n\n\"But we really hope that the films that audiences are going to see over the next weeks of the festival are going to get people talking about the vibrancy of the art form itself and the films themselves.\"\n\nThat may be the stated aim, but the opening night on Thursday will pitch the festival firmly into political territory with a film that touches on one of Germany's most sensitive issues -- immigration.\n\n\"Das Licht\" (\"The Light\") by German director Tom Tykwer features a middle-class German family whose lives are transformed by their mysterious Syrian housekeeper.\n\nThe mass arrival of Syrian refugees and other migrants in Germany in 2015-16 has helped fuel support for the AfD, which is forecast to emerge as one of the biggest parties nationally according to polls.\n\nLast year, organizers made headlines by barring five previously invited AfD politicians and telling them they were \"not welcome\".\n\n\"It would be nice if the main talking points were the films that are going to be shown, but I don't think that's the world we live in right now,\" Scott Roxborough, The Hollywood Reporter's European bureau chief, told AFP.\n\nU.S. President Donald Trump and his radical rightwing agenda are on everyone's minds, he said, as well as AfD-backing Elon Musk and the rise of artificial intelligence.\n\n\"There is definitely a general angst around AI in particular in the film industry,\" Roxborough added.\n\nThe selection of films set for Berlin stays true to the festival's mission of showcasing independent arthouse filmmakers from around the world, with a sprinkling of A-listers.\n\nHollywood director Richard Linklater's latest movie starring Ethan Hawke \"Blue Moon\" is in official competition, 11 years after Linklater won Berlin's Silver Bear for Best Director for \"Boyhood\".\n\nSouth Korean director Bong Joon-ho will present his new film \"Mickey 17\" with Robert Pattinson out of competition, while British actor Tilda Swinton will receive a lifetime achievement award.\n\nJessica Chastain, Marion Cotillard and Timothee Chalamet will add some stardust, while the jury is helmed by American director Todd Haynes.\n\nTuttle took up her job running the Berlinale in April last year, arriving with a reputation burnished by her time as head of the growing London Film Festival.\n\nThe American admitted that her first year had been \"challenging\" following controversy linked to criticism of Israel over its war in Gaza at the awards ceremony in 2024.\n\nUS filmmaker Ben Russell, wearing a Palestinian scarf, accused Israel of committing \"genocide\", while Palestinian filmmaker Basel Adra said the Gaza population was being \"massacred\".\n\nA spokeswoman for the German government, a staunch ally of Israel, and Berlin's mayor condemned the remarks afterwards as \"unacceptable\".\n\nTuttle admitted that the criticism had led some filmmakers to worry about whether they could exercise their right to freedom of expression.\n\nOne independent film producer told AFP on condition of anonymity that some directors had decided not to return until they had seen how Tuttle manages the issue.\n\nThe 2025 festival is set to screen a new documentary about an Israeli actor taken hostage by Hamas, as well as Claude Lanzmann's monumental 1985 epic on the Holocaust, \"Shoah\", which is more than nine hours long.\n\n\"Berlin has always been a place of big political discussion,\" Roxborough said.\n\n© 2025 AFP",
        "word_count": 698,
        "url": "https://japantoday.com/category/entertainment/berlin-film-festival-to-try-to-keep-politics-at-bay"
    },
    {
        "title": "‘Your Honor’ Becomes First Israeli Drama To Be Remade In China",
        "author": "Max Goldbart, .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow, Class, Wp-Block-Co-Authors-Plus, Display Inline, .Wp-Block-Co-Authors-Plus-Avatar, Where Img, Height Auto Max-Width, Vertical-Align Bottom .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow .Wp-Block-Co-Authors-Plus-Avatar, Vertical-Align Middle .Wp-Block-Co-Authors-Plus-Avatar Is .Alignleft .Alignright",
        "published_date": "2025-02-12",
        "content": "EXCLUSIVE: Your Honor has become the first Israeli drama to be adapted for the Chinese market.\n\nIsrael’s Yes Studios has struck a deal with William Lau‘s Hong Kong-based Ladder Ideas Limited to produce and a broadcasting partner will be unveiled in March, the studio said.\n\nTitled Kvodo, the legal thriller originated in Israel but is familiar to American audiences due to the popular Showtime adaptation starring Bryan Cranston, which ran for two seasons. It tells the story of a respected senior judge whose son is involved in a hit-and-run accident, leading to difficult choices, moral dilemmas and terrible consequences as he attempts to keep the crime a secret. Outside the U.S., Your Honor has been adapted in France, Germany, Spain, Italy, South Korea, Turkey, India and Russia.\n\nThe news is an intriguing deal with a Chinese market that has never before dipped into the ever-popular Israeli drama content well, although Chinese buyers have previously remade Israeli unscripted formats. The London TV Screenings and inaugural MIP London get underway later this month and a number of Chinese execs are expected to attend. Last week, we revealed Israeli major Keshet is taking its “most ambitious drama to date” to the English capital as it launches international sales on Unconditional.\n\nWatch on Deadline\n\nYes Studios boss Sharon Levi said: “With its relatable father-and-son relationship at its heart and universal themes around family and parents protecting their children at any cost, Your Honor continues to appeal to producers, broadcasters and, of course, audiences worldwide. There have been very few international scripted drama adaptations in the region, so we are extremely proud to be among the first, collaborating with William’s team in Hong Kong.”\n\nLau added: “Your Honor is one of the top scripted formats and we are so excited to have this great opportunity to remake it in Chinese.”\n\nLau, who is also COO of MediaQuiz Production and Distribution Company Limited (Empress of China, Scarlet Heart: Ryeo), worked with Boat Rocker’s SVP, Strategic Partnerships, Asia, Henry Or, to help broker the format deal with Yes Studios.\n\nYour Honor was created by Ron Ninio and Shlomo Mashiach and produced by Yes TV and Koda Communications. Yes Studios represents the original drama and the format worldwide. The series has been an Official Selection at nearly 20 international festivals, including SerienCamp in Germany and the Chicago International TV Festival and was the Grand Prix Winner at Series Mania in 2017.",
        "word_count": 403,
        "url": "https://deadline.com/2025/02/your-honor-china-deal-william-lau-yes-studios-amc-bryan-cranston-1236285443/"
    },
    {
        "title": "Medical experts dispute evidence in Lucy Letby’s baby killing conviction",
        "author": "Unknown",
        "published_date": "2025-02-04",
        "content": "Lucy Letby is serving 15 life sentences for seven baby deaths at neonatal units between 2015 and 2016.\n\nThe case of a British nurse sentenced to life imprisonment for killing seven newborn babies is being reviewed as medical experts argued there was no evidence to support her conviction for murder.\n\nLucy Letby is serving 15 life sentences for the deaths of babies at neonatal units in the northwest of England where she worked between 2015-16.\n\nLetby was convicted of murdering seven infants and attempting to kill seven others at the Countess of Chester Hospital neonatal unit, making her the United Kingdom’s most prolific serial killer of children in modern history.\n\nBut her defence team on Tuesday applied to the independent Criminal Cases Review Commission (CCRC) to probe whether there had been a possible miscarriage of justice in her two trials in 2023-24.\n\nLetby, 35, who maintains her innocence, was accused of attacking the babies by various means, including injecting air into their bloodstreams that caused an air embolism that blocked the blood supply.\n\nBut Dr Shoo Lee – a retired Canadian physician who co-authored a 1989 academic paper on air embolism in babies that featured in Letby’s 10-month trial – told a London news conference that Letby had exhausted all her appeals “and yet it remains that the evidence was wrong”.\n\nAdvertisement\n\n“The evidence that was used to convict her was wrong and for me that is a problem,” he said, presenting the findings of an international panel of 14 independent experts in the care of young babies.\n\nLee said the panel’s conclusion was the evidence “does not support murder in any of these cases”.\n\nThe group of paediatric specialists concluded natural causes or bad medical care led to the deaths of each of the newborns, Lee added.\n\nLetby is “sitting in prison for the rest of her life for a crime that just never happened”, her lawyer Mark McDonald said.\n\n“The reason why Lucy Letby was convicted was because of the medical evidence presented to the jury. That today has been demolished.”\n\nA spokesperson for the CCRC said, “We have received a preliminary application in relation to Ms Letby’s case and work has begun to assess the application.”\n\nThe commission has the power to refer cases back to the Court of Appeal if it determines there may have been a miscarriage of justice.",
        "word_count": 394,
        "url": "https://www.aljazeera.com/news/2025/2/4/medical-experts-dispute-evidence-in-lucy-letbys-baby-killing-conviction"
    },
    {
        "title": "Prince Charles Cinema: Beloved London institution faces closure",
        "author": "Unknown",
        "published_date": "2025-01-28",
        "content": "The PCC has interpreted this demand as an attempt to “bully” it off the building once the current lease ends later this year, and accused its landlords of demanding a rent increase “far above market rates, at a level which no cinema proprietor would consider reasonable”.\n\nAny time a beloved institution comes under threat in London, you know that a property developer will be there at the scene of the crime, and this time is no exception. “We are beyond disappointed that our landlords Zedwell LSQ Ltd and their ultimate parent company Criterion Capital, have demanded the inclusion of a break clause in our new lease,” the PCC wrote in an Instagram post . This means the cinema could be homeless with only six months’ notice if the landlords receive planning permission to redevelop the property.\n\nFirst opened in 1962, the Prince Charles Cinema is one of the few repertory cinemas in London, where alongside new releases you can watch classic films. Its celebrity admirers include Paul Thomas Anderson, who once said: “The Prince Charles has a place in my heart. It’s the people, the programming, the accessibility, feeling, texture… you cannot go wrong. You also know that on any given day, you can close your eyes, press your finger to the programme, and you’ll hit something great. It’s like tuning into your favourite radio station.” Quentin Tarantino has described it as a “mecca for lovers of quality films” and John Waters as “the most depraved and beautiful movie theatre in London.”\n\nThe PCC is without a doubt one of my favourite things in London, an opinion I share with many, many people. The programming is so fun and diverse: it’s one of the few places you can watch foreign-language art-house cinema, 1920s silent films and sing-a-long screenings of The Muppets Christmas Carol. For me there are few pleasures greater than having a random weekday off and seeing what’s on at the PCC: it might be Goodbye, Dragon Inn, it might be Scream 2, but as Paul Thomas Anderson says, you’re guaranteed to find something worth watching.\n\nIt always seemed that Prince Charles was too good, and too eccentric, to be allowed to exist in the middle of London, right by Piccadilly Circus, so I’m not surprised that property developers are circling. But its loss is not inevitable. We don’t have to capitulate to an ugly, short-sighted model of urban governance which holds that profit-maximisation is the only thing that matters, or the forces that seek to rob London of everything that makes it an interesting place to live. You can sign the petition to save the PCC here.",
        "word_count": 439,
        "url": "https://www.dazeddigital.com/film-tv/article/65959/1/prince-charles-cinema-beloved-london-institution-faces-closure?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=prince-charles-cinema-beloved-london-institution-faces-closure"
    },
    {
        "title": "Switzerland releases, deports Palestinian American journalist Ali Abunimah",
        "author": "Al Jazeera Staff",
        "published_date": "2025-01-28",
        "content": "The Electronic Intifada’s executive director says his offence was ‘being a journalist who speaks up for Palestine’.\n\nWashington, DC – Palestinian American journalist Ali Abunimah has confirmed that Swiss authorities have released and deported him after holding him for three days.\n\nAbunimah, the executive director of the Electronic Intifada publication, suggested in a social media post on Monday that Switzerland detained him because of his advocacy for Palestinian rights.\n\n“My ‘crime’? Being a journalist who speaks up for Palestine and against Israel’s genocide and settler-colonial savagery and those who aid and abet it,” he wrote.\n\nAbunimah was arrested in Zurich on Saturday before he was set to deliver a speech in the city, sparking outrage from Palestinian rights advocates.\n\nThe Swiss embassy in Washington, DC, did not immediately respond to Al Jazeera’s request for comment.\n\nThe Reuters news agency reported on Sunday that the Swiss police cited an entry ban and other measures under the country’s immigration law as the reason for Abunimah’s arrest.\n\nThe Palestinian American journalist said that when he was questioned by police officers, they accused him of “offending against Swiss law” without providing specific charges.\n\nAdvertisement\n\nHe said he was “cut off from communication with the outside world, in a cell 24 hours a day”, adding that he was unable to contact his family. He added that he was only given back his phone at the gate of the plane that flew him to Istanbul.\n\nAbunimah noted that during the period when he was taken to prison like a “dangerous criminal”, Switzerland welcomed Israeli President Isaac Herzog to the World Economic Forum in Davos.\n\nHerzog has sparked controversy for his stance on Israel’s war on Gaza, which has killed more than 47,000 Palestinians. He previously said that there are no “uninvolved civilians” in Gaza.\n\n“This ordeal lasted three days but that taste of prison was more than enough to leave me in even greater awe of the Palestinian heroes who endure months and years in the prisons of the genocidal oppressor,” Abunimah said.\n\n“More than ever, I know that the debt we owe them is one we can never repay and all of them must be free and they must remain our focus.”\n\nI’m free! I wrote this on the plane and I’m posting it just after landing at Istanbul. On Monday evening I was brought to Zurich airport in handcuffs, in a small metal cage inside a windowless prison van and led all the way to the plane by police. This is after three days and two… pic.twitter.com/S4BF2eEYYQ — Ali Abunimah (@AliAbunimah) January 27, 2025\n\nUnited Nations experts had decried Abunimah’s detention as an assault on free speech.\n\nIrene Khan, a UN special rapporteur for freedom of opinion and expression, described Abunimah’s arrest as “shocking news” on Saturday and urged his release.\n\nAdvertisement\n\nFrancesca Albanese, the UN special rapporteur on human rights in the occupied Palestinian territories, also called for an investigation into the incident.\n\n“The climate surrounding freedom of speech in Europe is becoming increasingly toxic, and we should all be concerned,” Albanese wrote in a social media post.\n\nAbunimah’s detention came amid an increased clampdown on pro-Palestine voices in Europe amid the war on Gaza, which UN experts have compared with genocide.\n\nIn April, Germany shut down a conference for Palestinian rights advocates and denied entry to the British doctor Ghassan Abu Sittah, who had worked in Gaza.\n\nActivists have also accused German authorities of cracking down on protests throughout the war.\n\nIn October 2024, British counterterrorism police raided the home of Abunimah’s Electronic Intifada colleague Asa Winstanley — an incident that the Committee to Protect Journalists (CPJ) said was part of a “disturbing pattern of weaponizing counter-terrorism laws against reporters”.\n\nMonths earlier, British authorities held journalist Richard Medhurst, who is vocally critical of Israeli policies, for 24 hours as he arrived in London.\n\nMedhurst said on Saturday that the “terrorism” investigation against him was extended until May.\n\nIn Gaza, Israel has killed 205 journalists since the start of the war in October 2023, according to local authorities.",
        "word_count": 675,
        "url": "https://www.aljazeera.com/news/2025/1/28/switzerland-releases-deports-palestinian-american-journalist-ali-abunimah"
    },
    {
        "title": "Amidst Divorce From Cash Warren, Bizarre Rumors from 2005 About Jessica Alba Being Kidnapped Resurface",
        "author": "Sarah Barrett, .Wp-Block-Gamurs-Author-Drawer__Wrapper Display Grid Grid-Template-Columns Height, Overflow-Y Scroll Position Fixed Right Top Transition Transform Ease-Out Width Z-Index -Ms-Overflow-Style None Scrollbar-Width None .Wp-Block-Gamurs-Author-Drawer__Wrapper, -Webkit-Scrollbar Display None .Wp-Block-Gamurs-Author-Drawer__Wrapper.Bg-Minimal Background-Color Var --Wp--Custom--General-Color-Bg--Minimal, .Wp-Block-Gamurs-Author-Drawer__Wrapper.Bg-Subtle Background-Color Var --Wp--Custom--General-Color-Bg--Subtle, .Wp-Block-Gamurs-Author-Drawer__Wrapper.Bg-Bold Background-Color Var --Wp--Custom--General--Color-Bg--Bold, .Wp-Block-Gamurs-Author-Drawer__Wrapper.Bg-Strong Background-Color Var --Wp--Custom--General-Color-Bg--Strong, .Wp-Block-Gamurs-Author-Drawer__Wrapper.Bg-Sponsored Background-Color Var --Wp--Custom--General-Color-Bg--Sponsored, .Wp-Block-Gamurs-Author-Drawer__Wrapper.Is-Visible Transform Translatex, .Wp-Block-Gamurs-Author-Drawer__Inner-Wrapper Border-Radius Calc Var --Wp--Custom--General-Container--All-Devices--Border-Radius",
        "published_date": "2025-01-30",
        "content": "It’s been a wild few weeks for Jessica Alba fans. For a start, the Fantastic Four actress is now officially divorcing her husband, Cash Warren. People saw it coming based on cryptic messages Alba posted, and now that it’s confirmed, there’s been a tsunami of comments about her personal life.\n\nRecommended Videos\n\nInsiders recently spoke to RadarOnline about the situation. They painted a picture of a less-than-amicable split. “Cash may be a good dad and has some high points, but it’s well known among Jessica’s circle that he’s had a roving eye for a good period of their relationship,” one person in the know told the website. Warren and Alba share three kids – Honor (16), Haven (13) and Hayes (7).\n\n“She was always the one bringing home the bacon and she was the one who kept the marriage together,” another insider said. Alba has pulled in millions from her acting and business ventures. “Her friends don’t know what she saw in Cash. He seemed like a ne’er-do-well.”\n\nYep, money is likely to be a considerable factor in the divorce. “It’s not known if they had a prenup and certainly it’s not going to be a pretty settlement either way,” an anonymous source told RadarOnline. “She’ll have to cough up a huge portion of her $100million fortune even if they do have a prenup. Cash may pass himself off as a producer, but he hasn’t worked on anything in years. One thing’s for sure – her friends are glad to see her moving on and they think she can find a man who is worthy of her.”\n\nBut search for Alba’s name today, and you won’t find as much about the divorce as you’ll find breathless reporting on a resurfaced incident from when Alba was a teen. According to reports, she was kidnapped while filming the TV series Flipper in 1996. There are suddenly articles and TikTok videos springing up everywhere about it.\n\nRelated: Orlando Bloom Reacts to Keira Knightley’s Bad Pirates of the Caribbean Experience\n\nThe story goes like this: Alba went missing from the set of Flipper and a 14-hour search took place. Eventually, the teenager was found tied up in the trunk of a car. There was a police investigation, naturally, and it was revealed that Alba had been receiving weird phone calls in the run-up to the kidnapping. However, there was no evidence regarding who had actually committed the crime. Alba couldn’t offer any help because she had been blindfolded the entire time.\n\nObviously, that was a horrible ordeal for anyone to have to go through, and the tale strikes fear into the hearts of anyone hearing it. There’s just one problem: it’s not true. It’s a fake story that’s been around for ages now and has made a resurgence with Jessica Alba back in the news.\n\nOutlets such as Hello and the London Evening Standard have reported the rumor as if it really happened, but we know from Alba herself that it never did. The Tab debunked the story by going back to a 2005 interview with the actress.\n\nAlba spoke to Complex that year to promote Fantastic Four, and the magazine outright asked her about the kidnapping rumors. “According to the Internet, while you were filming the remake of Flipper you were kidnapped! Is that accurate?” they asked her. She responded with a simple, “No.” When pressed, she answered with another firm “No.” And that’s that.\n\nThe Complex interview makes for a saddening reading now if you were a fan of the Alba-Warren relationship. Back then, they were just boyfriend and girlfriend, and people were fascinated by where their relationship might go. Complex asked if Alba planned to marry him, and she answered, “Yes.” That marriage lasted sixteen years, but it’s over now.\n\nThe Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. Learn more about our Affiliate Policy",
        "word_count": 657,
        "url": "https://www.escapistmagazine.com/amidst-divorce-from-cash-warren-bizarre-rumors-from-2005-about-jessica-alba-being-kidnapped-resurface/"
    },
    {
        "title": "School and mosques vandalised with anti-Muslim graffiti in London",
        "author": "Sky Uk Limited",
        "published_date": "Unknown",
        "content": "Anti-Muslim graffiti has been found daubed on seven London buildings this month, including mosques, community centres and a primary school.\n\nThe Metropolitan Police said it is investigating \"several incidents of criminal damage\" and is treating them as \"shocking\" hate crimes.\n\nThe first incident took place on Monday 6 January, with the most recent recorded on Saturday 25 January. The force is looking into whether they are linked, including examining CCTV footage.\n\nThe incidents are reported to have been fuelled by a Telegram hate group, which was offering £100 to people who committed acts of vandalism. The Met said its inquiries are continuing.\n\nThe force has stepped up reassurance patrols in the affected areas and is in contact with local faith leaders.\n\nHere are the sites that were targeted and when:\n\n• West Norwood Mosque, SE27, on Monday 6 January\n\n• South Norwood Islamic Community Centre, Croydon, SE25, on Monday 6 January\n\n• Thornton Heath Islamic Centre, CR7, on Thursday 16 January\n\n• Stratford mosque, Newham, E15, on Thursday 23 January\n\n• Leyton Jamia Masjid, E10, on Thursday 23 January\n\n• Albirr Foundation mosque, E10, on Thursday 23 January\n\n• Noor Ul Islam Primary School, E10, on Saturday 25 January\n\nRead more from Sky News:\n\nFresh warnings for strong winds and flooding across UK\n\nThree teenagers die after car hits tree\n\nImage: Leyton Jamia Masjid was also targeted\n\n'Hate has no place on our streets'\n\nWorshippers at the Stratford mosque and Leyton Jamia Masjid contacted Sky News saying their buildings had been vandalised with anti-Islamic graffiti.\n\nThe Met's Deputy Assistant Commissioner Jon Savell said: \"We understand that Muslim communities will be feeling particularly concerned for their safety following this series of shocking hate crimes.\n\n\"Hate has no place on our streets, and tackling it is at the centre of our efforts to make Londoners from all backgrounds and communities feel safe.\n\n\"Our local officers will continue to work with community leaders and ensure that a thorough investigation is being conducted\".\n\nGet Sky News on WhatsApp Follow our channel and never miss an update. Tap here to follow\n\nBe the first to get Breaking News Install the Sky News app for free\n\n'This is not an act of faith - it's an act of cowardice'\n\nA statement from Stratford Islamic Association to Sky News said: \"Our mosque has been part of this community since 1993, and in all that time, we've only known kindness and respect from our neighbours.\n\n\"We are proud to be an integral part of this community, and today, we've been deeply moved by the overwhelming support from people of all backgrounds.\"\n\nIt added: \"The council and the police have stood with us, and we are truly grateful for their swift and compassionate response.\n\n\"Those responsible for this act of hate have shamed only themselves. This is not an act of faith - it's an act of cowardice. But they will not intimidate us. We will not live in fear. Together, as a united community, we will stand strong.\"\n\nPolice are urging anyone with information about the incidents to contact them on 101.\n\nNo arrests have been made.",
        "word_count": 519,
        "url": "https://news.sky.com/story/school-and-mosques-vandalised-with-anti-muslim-graffiti-in-london-13295911"
    },
    {
        "title": "Switzerland arrests Palestinian-American journalist",
        "author": "Russia Today",
        "published_date": "Unknown",
        "content": "It is unclear whether Electronic Intifada founder Ali Abunimah has been charged with a crime\n\nPolice in Switzerland have arrested Palestinian-American journalist Ali Abunimah ahead of a speaking event in Zurich, according to Electronic Intifada, a pro-Palestine news outlet run by Abunimah.\n\nAbunimah was detained in Zurich on Saturday, hours before he was due to speak at the event, Electronic Intifada reported. It is unclear whether he has been charged with a crime, but he has had access to legal counsel, the outlet stated.\n\nOne day earlier, the 53-year-old journalist was questioned for an hour by officers when he arrived at Zurich Airport.\n\n“Abunimah’s arrest appears to be part of a growing backlash from Western governments against expressions of solidarity with the Palestinian people,” Electronic Intifada wrote.\n\nBorn in Washington DC to parents from the West Bank, Abunimah co-founded Electronic Intifada in 2001. The site reports on events in the Middle East from a Palestinian perspective, and Abunimah regularly appears on mainstream news networks to advocate for the Palestinian cause.\n\nAbunimah’s arrest came three months after British police raided the home of Electronic Intifada associate editor Asa Winstanley. Nearly a dozen officers entered Winstanley’s London home at dawn and seized several electronic devices, telling him that they were investigating him for possible “encouragement of terrorism” in connection with his social media posts.\n\nWinstanley was not arrested or charged with any crime.\n\nPro-Palestinian activists Mick Napier and Tony Greenstein have both been arrested by British police since the Israel-Hamas war began in October 2023, while in August, police arrested British journalist Richard Medhurst on charges of “expressing an opinion or a belief that is supportive of a proscribed organization.” He was eventually released, but his phone and work equipment were seized, while Medhurst himself was subjected to a search and questioning.\n\nAbunimah’s arrest “appears to be a direct result of his outspoken advocacy,” the American-Arab Anti-Discrimination Committee wrote in a statement on Saturday. The organization called on the US State Department to intervene and secure his release.\n\nThe State Department has not commented on the arrest.",
        "word_count": 345,
        "url": "https://www.rt.com/news/611660-switzerland-arrests-palestinian-journalist/"
    },
    {
        "title": "Uber, Bolt and Addison Lee drivers strike on Valentine's Day",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Uber and Bolt drivers strike on Valentine's Day\n\n8 days ago Jacqueline Howard BBC News\n\nReuters\n\nThousands of Uber, Bolt and Addison Lee drivers are logging off during peak hours on Valentine's Day in a campaign for better pay and working conditions, a union says. The strike action is taking place across the UK from 16:00 to 22:00 GMT. The Independent Workers Union of Great Britain (IWGB) said it would unite \"drivers up and down the country faced with low pay and insecure conditions\". Uber, Bolt and Addison and Lee have defended their working conditions after the IWGB said drivers in cities including London, Birmingham, Manchester, Cardiff and Brighton were backing the strike.\n\nVasilica Dumitrescu has been working for various platforms, including Uber and Bolt, for the last nine years. The 51-year-old said she works seven days a week, clocking up more than 80 hours, just to make ends meet. \"It's really bad financially, emotionally physically, everything,\" Ms Dumitrescu said. \"I can't afford to make bills, rent, food, which is so expensive now. It's really, really bad.\"\n\nSupplied Vasilica Dumitrescu is taking part in the strike\n\nMs Dumitrescu said she hopes the strike leads to higher pay agreements. \"The customers, they are with us,\" she added. \"Every driver is upset because they don't earn enough. They ask you how much you get from this trip and are surprised at how little we get.\" An Uber spokesperson said all its drivers are guaranteed to earn at least the national living wage, and that the majority can and do earn more. \"On average, drivers across the UK earn more than £30 per hour when taking trips on Uber,\" the spokesperson said. \"They also have access to industry-leading protections such as holiday pay, a pension and free sickness and injury cover, as well as formal representation through GMB Union.\" A spokesperson for Bolt said the company was \"committed to ensuring our prices balance the earning needs of drivers with affordability for passengers\". \"All drivers receive holiday pay and monetary supplements to ensure they earn at least the national living wage, alongside a pension,\" the spokesperson added. Just over an hour into the strike, a Bolt spokesperson said service levels were \"unaffected\" and users were \"able to book rides as normal\". Addison Lee has been contacted for comment. The company previously told the PA news agency: \"We have a close working relationship with our drivers, which was further reinforced in our recent bi-annual driver satisfaction survey. We do not expect to see any disruption to volumes or service levels on February 14.\" In September 2024, Bolt drivers won a claim against the company after an employment tribunal ruled they were \"workers\" under UK law and entitled to rights and protections, including the national minimum wage. In January 2025, Addison Lee drivers won a similar case.\n\n'Breaking point'\n\nHelio Santos, who is based in Stratford in east London, is another driver taking part in the strike. He has been driving with Uber for three years and said that while he spent 70 to 80 hours per week online, that often translates to just 25 to 30 hours of driving. Mr Santos said that Friday's strike action shows that drivers across UK are \"reaching a breaking point\". \"This is unsustainable,\" he said. \"Fees are too low, there is no safety, no transparency. Uber keeps ignoring us.\"\n\nSupplied/IWGB union Helio Santos has been driving with Uber for three years",
        "word_count": 572,
        "url": "https://www.bbc.com/news/articles/c4g7189x9wno"
    },
    {
        "title": "Breaking News - Geoff Bell, Daniel Betts, Lisa Dwan, and Emily Barber Join New Guy Ritchie Project for MTV Entertainment Studios and Paramount+",
        "author": "Unknown",
        "published_date": "2025-02-13",
        "content": "GEOFF BELL, DANIEL BETTS, LISA DWAN, AND EMILY BARBER JOIN NEW GUY RITCHIE PROJECT FOR MTV ENTERTAINMENT STUDIOS AND PARAMOUNT+ New Global Organized Crime Series, Starring Tom Hardy, Pierce Brosnan, and Helen Mirren Commissioned by Paramount+ and produced in association with MTV Entertainment Studios and 101 Studios Feb 13, 2025 - Geoff Bell (Top Boy), Daniel Betts (Fate: The Winx Saga), Lisa Dwan (Top Boy), and Emily Barber (Industry) have joined Guy Ritchie's new global crime series NEW GUY RITCHIE PROJECT for Paramount+ in a recurring role. As previously announced, production is currently underway in London with Tom Hardy (Venom: The Last Dance), Pierce Brosnan (Die Another Day), Helen Mirren (The Queen), Paddy Considine (House of the Dragon), Joanne Froggatt (Downton Abbey), Lara Pulver (Da Vinci's Demons), Anson Boon (Pistol), Mandeep Dhillon (CSI: Vegas) and Jasmine Jobson (Top Boy). NEW GUY RITCHIE PROJECT is produced in association with MTV Entertainment Studios and 101 Studios. The series will debut in 2025 globally on Paramount+. Bell will play \"Richie,\" The redoubtable leader of the up-and-coming south London Stevenson gang. Betts will play \"Brendan,\" Conrad (Brosnan) and Maeve's (Mirren) oldest son. Dwan will play \"O'Hara,\" the Harrigan Family lawyer. Barber will play \"Alice,\" Jan's (Froggatt) friend, whom she meets in group therapy. NEW GUY RITCHIE PROJECT is an electrifying, new global crime series centered around two warring families based in London whose enterprises stretch all corners of the globe and the fiercely loyal \"fixer\" charged with protecting one of them at all costs. The series is executive produced by Keith Cox, Nina L. Diaz, David C. Glasser, Guy Ritchie, Jez Butterworth, Ronan Bennett, Kris Thykier, Ivan Atkinson, Tom Hardy, Dean Baker, Ron Burkle, David Hutkin and Bob Yari. *** About Paramount+ Paramount+, part of Paramount's (Nasdaq: PARA, PARAA) global portfolio of multimedia entertainment and news brands, is a direct-to-consumer digital subscription video on-demand and live streaming service, combining live sports, breaking news and A Mountain of Entertainment(TM). The streaming service features an expansive library of original series, hit shows and popular movies across every genre from world-renowned brands and production studios, including BET, CBS, Comedy Central, MTV, Nickelodeon, Paramount Pictures and the Smithsonian Channel. Paramount+ with SHOWTIME, the service's cornerstone plan, is also home to SHOWTIME(R) content, including scripted hits and critically acclaimed nonfiction projects and films. This premium plan includes unmatched events and sports programming through the local live CBS stream, including golf, basketball and more. All Paramount+ subscribers have streaming access to CBS News Network for 24/7 news and CBS Sports HQ for sports news and analysis. For more information about Paramount+, please visit www.paramountplus.com, and follow @ParamountPlus on social media. About SHOWTIME/MTV Entertainment Studios & Paramount Media Networks SHOWTIME/MTV Entertainment Studios & Paramount Media Networks is a global network of media assets that reaches over one billion people in more than 180 countries featuring some of the most iconic brands in entertainment including SHOWTIME, MTV, Comedy Central and Paramount Network among others - and, its Studios arm which produces 120+ series annually, including some of today's biggest hits such as Yellowstone, YELLOWJACKETS(R), Emily in Paris, 1883, 1923, GEORGE & TAMMY, South Park, TULSA KING, Rupaul's Drag Race, The Challenge and Jersey Shore to name a few. About 101 Studios 101 Studios is a global entertainment company dedicated to the acquisition, financing, development, production and distribution of high-caliber, creator-driven content. With an unmatched television slate partnered with outstanding filmmakers and talent, 101 Studios productions include the award-winning series Yellowstone, GEORGE & TAMMY, 1883 and 1923. We also produce some of the most critically acclaimed shows, such as LAWMEN: BASS REEVES, MAYOR OF KINGSTOWN, TULSA KING, LIONESS and LANDMAN. Building upon this success, 101 Studios' Unscripted Division works with talented storytellers in bringing their vision to life. Some of these projects include Amazon Prime documentary Kickback, which is an expose on the corruption inside the largest sport's organization in the world: FIFA; The Last Cowboy, a documentary on the high stakes world of professional horse reining; and the upcoming HBO docuseries about the sexual abuse and cover-up at Ohio State University, co-produced by George Clooney and Grant Heslov's Smokehouse Pictures. On the scripted film side, past releases include the Sundance Audience award winner Burden, as well as the family comedy The War with Grandpa, the historical drama The Current War: Director's Cut, and FINESTKIND. 101 Studios advocates for first-class collaboration and innovation. As an example, we are partnered with iHeartRadio and Sports Illustrated Studios on the Ambie nominated podcast Choosing Sides: F1. 101 Studios also produces high-profile sports content under its own label, 101 Sports. Additionally, 101 Studios' Brand Division increases the exposure for the properties of our partners to millions across the world. @ParamountPlus #ParamountPlus",
        "word_count": 784,
        "url": "http://www.thefutoncritic.com/news/2025/02/13/geoff-bell-daniel-betts-lisa-dwan-and-emily-barber-join-new-guy-ritchie-project-for-mtv-entertainment-studios-and-paramountplus-219515/20250213cbs01/"
    },
    {
        "title": "King Charles and Queen Camilla visit Middlesbrough",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Queen plays ping-pong as Royals tour Teesside\n\n13 February 2025 Evie Lake BBC News, North East and Cumbria Louise Hobson BBC Radio Tees Reporting from Middlesbrough\n\nReuters Queen Camilla joined teenagers in Middlesbrough for a game of table tennis\n\nQueen Camilla joined in a game of table tennis as she and King Charles took a tour of Middlesbrough. The Queen, a fan of the sport, joined teenagers for an impromptu knockabout during a day of meetings, entertainment and activities. The Royal Couple attended several engagements before a celebratory walkabout in Centre Square. It is the first time the King has officially visited north-east England since he was crowned in 2022 and the first visit to the town by a reigning monarch since Queen Elizabeth II opened Pallister Park in 1993.\n\nAhead of greeting the crowd in Centre Square, the King and Queen attended the International Centre to meet representatives of a number of charities and organisations including a group from the King's Trust supporting an initiative to tackle knife crime.\n\nDave Charnley Photography \"Funny and sarcastic\" Rona Grafton received a 100th birthday surprise\n\nAmong those introduced to the Royals was Rona Grafton, originally from Teesville, on what was her 100th birthday. Described as \"funny and sarcastic\" by staff at Gables Care Home where she lives, Rona had her surprise treat arranged by the local council and Buckingham Palace.\n\nPA Media King Charles toured SeAH Wind's XXXL factory\n\nEarlier the King put on a hard hat and fluorescent jacket to tour SeAH Wind's XXXL wind turbine factory on Teesside. But official business soon gave way to fun as Queen Camilla grabbed a bat and partnered another birthday celebrant, 15-year-old Alesha Hussain, in a game with Kaleb Autsun, 14. Alesha, who was representing a young carers' group, said: \"She was good, I didn't know she liked table tennis.\" Kaleb added: \"It was nice, that was a new experience because I've never seen any of the Royal Family before.\"\n\nReuters King Charles greeted people at Middlesbrough's Centre Square\n\nLater, in Centre Square, local musician and mental health campaigner Mike McGrother led performances of songs and poetry that celebrated the area. He was joined by the Infant Hercules Choir and The Wildcats of Kilkenny.\n\nBBC Radio Tees reporter Louise Hobson said: \"Excited cheers erupted from the crowds as King Charles and Queen Camilla emerged on the steps of the town hall.\" One woman travelled up from London to witness the visit because she thought it would be \"an adventure\". She said she was \"a real fan\" of Queen Elizabeth II and wanted to \"honour her memory by supporting her son\".\n\nReuters Protesters against the monarchy were also in attendance\n\nAnti-monarchy protesters also gathered. A representative of the charity Republic told BBC Radio Tees they were there to \"demonstrate that there is a significant and growing proportion of people who don't agree with the monarchy\".\n\nGetty Images Queen Elizabeth II visited Middlesbrough in May 1993\n\nThe year of the last big royal visit to the town saw mixed fortunes for football, the arts, leisure and petty thieves. Middlesbrough were playing in what was then the all-new Premier League having been one of its founder members, although the joy did not last long as they were relegated from it in May. One of the town's most eye-catching sculptures, the 30ft (9.1m) Bottle of Notes, was installed in the same year, having been made by steelworkers in Hebburn, South Tyneside, as part of plans to regenerate the region. Elsewhere in the town, the Victorian-built Empire Theatre reopened as a bar and Marks & Spencer introduced CCTV - then becoming increasingly prevalent - to help its security guards identify shoplifters in its now-closed Linthorpe Road branch.\n\nFollow BBC Tees on X, Facebook, Nextdoor and Instagram. Send your story ideas here.",
        "word_count": 632,
        "url": "https://www.bbc.com/news/articles/c247j8lrlleo"
    },
    {
        "title": "‘Dodgy boxes’: Why are they in the news and could I be prosecuted for using one?",
        "author": "Conor Pope, Conor Pope Is Consumer Affairs Correspondent, Pricewatch Editor, Tue Feb -",
        "published_date": "2025-02-18",
        "content": "The Federation Against Copyright Theft says the latest action has resulted in thousands of prohibited streams being shut down. Photograph: iStock\n\nWhy are dodgy boxes back in the news again?\n\nThirteen illegal operators across the country have been served with legal notices warning them to shut down illicit streaming services or face possible criminal prosecution. The action was taken by the Federation Against Copyright Theft (Fact) and followed a two-week operation in December.\n\nWhat did the dodgy box operators do after getting these Fact notices?\n\nAccording to the London-based industry group, the initiative has been a great success and has resulted in the shutting down of thousands of prohibited streams, and the demise of services for those using the illegal operations. Social media profiles selling dodgy boxes have also disappeared while subscriptions have been terminated and paid settlements agreed.\n\n[ Legal notices served on 13 illegal dodgybox operators, according to anti-piracy groupOpens in new window ]\n\nAnd why is Fact so concerned?\n\nIt says that many consumers are unaware that piracy networks are often linked to organised crime, with their profits potentially funding other illegal activities.\n\nWell, that’s not good but is this the first time Fact has acted?\n\nNo. There have been three previous actions since March 2023, with almost 70 illegal services across the Republic shut down. There have also been legal actions taken against individuals, with one operator of an illegal dodgy box TV streaming service being jailed for 16 months last year.\n\nREAD MORE\n\nCould dodgy box owners go to to jail?\n\nIt is highly unlikely, not least because there are tens of thousands of dodgy boxes in homes all over the country and nowhere near enough cell spaces for all of you. But by knowingly circumventing properly applied restrictions to access copyrighted content, you could be exposed to prosecution – at least potentially but breathe easy because potentially is a long way from actually.\n\nWhy so?\n\nWell, those targeting illegal streaming, including the Garda Síochána and the copyright holders – are focused on people who are suspected of being involved in providing illegal access to premium TV content and not – as yet – the end users. Garda sources have even expressed doubt that the force would have any jurisdiction when it comes to the use of such boxes, suggesting it would be a civil rather than a criminal matter.\n\nBut owning a dodgy boxes is illegal, right?\n\nYes and no. The boxes themselves are not illegal. They are also called Android boxes. And Android is just an operating system and one that runs on all manner of different technologies including phones, tablets and firesticks. Android boxes are commonly sold in entirely reputable electrical shops in Ireland and on online platforms.\n\nSo what is illegal?\n\nEver since the web was born those who make and sell content have been fighting a fierce battle with those who want to make it freely available online by breaking it down into ones and zeros that can be easily shared online. There was Napster and then Torrents and they ultimately led us to dodgy boxes.\n\nWhat are they exactly?\n\nThey plug into a television and if they have certain apps installed they can stream content directly from the internet to televisions. As mentioned, the boxes are not illegal but they have the capacity to do illegal things. A person who buys a clean dodgy box can easily download dodgy apps themselves. Then there are those who sell the boxes pre-loaded with apps to facilitate questionable streaming and provide codes to dodgy platforms.\n\nSo, in short, it is not the boxes that are dodgy but the apps that facilitate illegal streaming. And it is not the selling of the boxes that is illegal but the selling of boxes and access to copyrighted content that fall foul of the law. And it is those people who are being targeted by Fact.",
        "word_count": 650,
        "url": "https://www.irishtimes.com/ireland/2025/02/18/dodgy-boxes-why-are-they-in-the-news-and-could-i-be-prosecuted-for-using-one/"
    },
    {
        "title": "Scotland frees hundreds of inmates as U.K. grapples with prison overcrowding crisis",
        "author": "Astha Rajvanshi, Astha Rajvanshi Is A Reporter For Nbc News Digital, Based In London. Previously, She Worked As A Staff Writer Covering International News For Time.",
        "published_date": "2025-02-18",
        "content": "LONDON — Hundreds of prisoners will be freed in Scotland as part of a broader emergency response to ease the burden of overcrowded prisons across the United Kingdom.\n\n“We have been managing an extremely high and complex prison population for more than a year, putting considerable pressure on all those living and working in our establishments,” a Scottish Prison Service spokesperson told NBC News on Tuesday via email, after the first of almost 400 prisoners were released.\n\nScotland’s prisons housed almost 8,000 prisoners every day in 2024 — a 6% increase on the previous year, according to its government statistics.\n\n“In line with trends seen elsewhere in the U.K., Scotland’s prison population has significantly grown in recent years and, consequently, this rise has impacted prisons and the wider justice system,” a Scottish government spokesperson told NBC News on Tuesday.\n\nScotland is part of the United Kingdom but, like Wales and Northern Ireland, has its own semi-autonomous government with broad powers over areas including health care, education and law, meaning its government can unilaterally decide to free the prisoners without seeking the consent of the British Parliament in London.\n\nThe prison population across the U.K. was just more than 97,000 people in March 2024, according the most recent British government data which projected that number to grow by around 4,500 every year while prisons remained “almost full,” it stated.\n\nIn response, the U.K. government last year launched a major review over its sentencing laws and allowed judges to sentence offenders to house arrest. It also freed more than 1,700 prisoners across England and Wales in September.\n\nUnder emergency legislation passed last November, Scottish inmates sentenced to less than four years are eligible for early release after serving 40% of their term, unless convicted of domestic abuse or sexual offenses.\n\nThis means between 260 and 390 short-term prisoners are set to be freed over a six-week period starting Tuesday.\n\nThe new legislation, which came into effect Feb. 11, will “bring a sustained reduction to prisoner numbers so the prison estate can continue to function effectively,” the government spokesperson said.\n\nThe early release is expected to reduce the prison population by 5%, although the government has also acknowledged the new law is not a complete solution to overcrowded jails.\n\nAnother 470 Scottish inmates were released early from prison last August, but 61 ended up back in custody before their original planned release date, according to Scottish Prison Service data.\n\n“While not a complete solution, this Act will bring sustained reduction to prisoner numbers so the prison estate can continue to function effectively,” Scottish Justice Secretary Angela Constance stated in a press release in January.\n\nBut the early release could be “distressing for victims of crime” and “raise questions and cause concern,” Constance added.\n\nIn response, the Scottish Police Service has urged victims to sign up for a joint scheme with Victim Support Scotland, a charity that provides support to those affected by crime, so that they will be notified if their offender’s release date changes.\n\nThe charity told NBC news in a statement Tuesday that there had been “no improvements” to the main mechanism intended to inform victims since the new legislation was passed.\n\n“The last time prisoners were released early, only 2% of victims were notified,” said Kate Wallace, Victim Support Scotland's chief executive.\n\nShe added that the early release would have a “profoundly damaging impact on victim confidence and trust in the justice system” if the number of victims contacted did not increase this time.\n\nThe spokesperson for Scottish Prison Service said it would work with the government and the justice sector to look at “all possible actions which will deliver a manageable population” in its prisons.\n\nSupport and rehabilitation of prisoners would continue to reduce “their risk of reoffending, and helping to build safer communities across Scotland,” he added.",
        "word_count": 639,
        "url": "https://www.nbcnews.com/news/world/scotland-frees-hundreds-inmates-uk-grapples-prison-overcrowding-crisis-rcna192546"
    },
    {
        "title": "AI-generated content raises risks of more bank runs, UK study shows",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "PARIS : Fake news generated by artificial intelligence and spread on social media is heightening the risks of bank runs, according to a new British study that says lenders must improve monitoring to detect when disinformation risks impacting customer behaviour.\n\nGenerative AI can be used to create fake news stories saying that customer money is not safe, or memes appearing to joke about security issues, which can be spread on social media using paid adverts, said the study, published by UK research company Say No to Disinfo and communications firm Fenimore Harper.\n\nBanks and regulators are increasingly concerned about the risks of bank runs fuelled by social media, following the collapse of Silicon Valley Bank in 2023, in which depositors withdrew $42 billion in 24 hours.\n\nAdvances in AI have supercharged these risks. The G20's Financial Stability Board warned in November that generative AI \"could enable malicious actors to generate and spread disinformation that causes acute crises\", including flash crashes and bank runs.\n\nSay No to Disinfo showed sample AI-generated content to UK bank customers and found that a third were \"extremely likely\" to move their money after seeing it, with a further 27 per cent \"somewhat likely\".\n\n\"As AI is making disinformation campaigns easier, cheaper, quicker and more effective than ever before, the emerging risk to the financial sector is rapidly growing but often overlooked,\" the report said, noting that online and mobile banking meant people can move money in seconds.\n\nThe study estimated that for every 10 pounds ($12.48) spent on social media adverts to amplify the fake content, as much as 1 million pounds of customer deposits could be moved.\n\nThe estimate was calculated by using average deposits held by UK customers, the cost of social media adverts, and estimates for how many people would see them.\n\nBanks need to monitor media and social media mentions, and such monitoring must be integrated with withdrawal monitoring systems to identify when malicious information is affecting customer behaviour, the researchers said.\n\nAsked about the study, Revolut's head of financial crime, Woody Malouf, said the London-based fintech conducts real-time monitoring for emerging threats among its customers and \"across the broader ecosystem\".\n\n\"Whilst we believe an industry event like this is unlikely, it is still possible, so it's essential that financial institutions are prepared,\" he said, adding that social media platforms must play a bigger role in stopping threats.\n\nOther financial institutions contacted by Reuters, including NatWest and Barclays, declined to comment or did not respond to requests for comment.\n\nWhile regulators have expressed concern about AI's overall impact on financial stability, banks are broadly optimistic about the technology's impact.\n\n\"Banks are working hard to manage and mitigate risks around AI and the regulatory authorities are looking at the potential financial stability challenges the technology poses,\" industry body UK Finance said.\n\nThe report's release was unrelated to an AI Summit in France this week, at which politicians and industry executives focused on promoting the spread of AI, a marked shift from the previous summit's focus on managing its risks.\n\n($1 = 0.8013 pounds)",
        "word_count": 511,
        "url": "https://www.channelnewsasia.com/business/ai-generated-content-raises-risks-more-bank-runs-uk-study-shows-4938446"
    },
    {
        "title": "Hair today, here forever: Woman accused of using 'array of wigs' in elaborate citizenship scheme",
        "author": "Astha Rajvanshi, Astha Rajvanshi Is A Reporter For Nbc News Digital, Based In London. Previously, She Worked As A Staff Writer Covering International News For Time.",
        "published_date": "2025-01-29",
        "content": "In a hair-raisingly elaborate scheme, a woman in Britain has been arrested and accused of using an “array of wigs” to pose as at least 14 people and take their U.K. citizenship tests for them.\n\nThe Home Office, the government department that handles crime and immigration, said the 61-year-old woman, whose name was not released, helped the applicants — both male and female — gain “an unfair advantage” in the compulsory \"Life in the UK\" tests.\n\nInvestigators issued an arrest warrant for the woman Monday at an address in north London after they received a tip alleging she attended test centers around the country from June 2022 to August 2023, using fake IDs and multiple disguises to avoid detection.\n\nOfficers seized “several false documents and an array of wigs alleged to have been used in the fraudulent scheme” at the address, they said.\n\nThe woman remains in custody, the Home Office said.\n\nSurveillance video from 2022 shows a woman alleged to be the suspect being photographed in disguise. U.K. Home Office\n\nImmigration enforcement inspector Phillip Parr told NBC News’ international partner Sky News that a “complex investigation” had “put a stop to this dangerous scheme.”\n\nThe woman “is believed to have orchestrated a premeditated plan to avoid detection,” he said, adding that he believed her main motive was financial gain.\n\nThe Life in the UK test is a compulsory requirement for those applying to become naturalized British citizens. The Labour government introduced it in 2005 when Tony Blair was prime minister.\n\nThe test consists of 24 questions aimed at “proving the applicant has sufficient knowledge of British values, history and society,” the Home Office said. Questions cover a wide variety of topics relating to their adopted home, including the 14th century literature of Geoffrey Chaucer, the U.K.'s first curry house and the Grand National horse race.\n\nLast year, a study found that only 42% of British citizens would be able to pass the test without studying.\n\nThe Home Office warned on Facebook that fraudsters’ completing the test for others could “lead to people wrongly being granted the right to remain” in the country, putting “the public at risk.”",
        "word_count": 358,
        "url": "https://www.nbcnews.com/news/world/woman-arrested-using-array-wigs-fraudulently-take-citizenship-tests-rcna189758"
    },
    {
        "title": "Met Police launches crackdown on mobile phone thefts",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Met Police blitz to fight phone-snatching 'scourge'\n\n6 February 2025 Jessica Ure BBC London Victoria Cook BBC London\n\nThe Met Police said it seized more than 1,000 handsets in the crackdown\n\nA clampdown on the \"industrial-scale\" crime of mobile phone-snatching across London has resulted in 230 people being arrested by the Metropolitan Police in the past week. In its battle against the \"scourge of mobile phone crime\", the force said it had also seized more than 1,000 handsets. The Met has deployed plain-clothed officers in \"hotspot\" areas, including the West End and Westminster, and is also using tracking technology to recover phones and catch criminals. It said its work had been \"ramped up\" to deal with the £50m-a-year trade in stolen phones across the capital, with those responsible for thefts, handling, and onward criminal supply all being targeted.\n\nMetropolitan Police The Met says there is a £50m-a-year trade in stolen phones in London\n\nIt came as police and tech companies pledged to work closer together to tackle smartphone theft. During a summit on Thursday, Home Secretary Yvette Cooper urged tech companies including Apple, Samsung and Google to join forces with police to improve anti-theft measures and make smartphones effectively worthless to criminals.\n\nA recent victim, Richard, told the BBC that the theft of his phone had left him feeling \"uncomfortably nervous\". Richard said he was walking along Highbury Fields in north London when someone dressed \"entirely in black\" who was riding an e-bike snatched his phone from his hand. He said: \"It's frustrating because that's exactly where this sort of thing typically happens. I'm always telling people to be careful, but for one moment I forgot and my phone went off into the distance.\" He said he was initially angry, but his thoughts soon turned to worries about his banking details being obtained by the thief - although this did not happen.\n\nRichard's phone was snatched from his hand while he was walking through Highbury Fields\n\nRichard said he was surprised by the police response to his phone being stolen. He explained how officers visited him at home, and by using a tracker they could see his device had been taken to a phone repair shop, where Richard said the police explained there had been previous criminal activity. Despite this, the phone could not be recovered. The way police responded to this crime is markedly different from what other Londoners say they have experienced, even recently. In December, a designer from Tottenham told the BBC how she had felt unsupported by police after her phone was stolen, and ended up using tracking technology to trace it herself. Izzy Du located the phone hidden in a hedge, along with six other handsets.\n\nGetty Images Police say by intensifying their efforts they expect to catch more phone-snatchers and \"protect more people\"\n\nThe Met's Cdr Owain Richards said: \"We are seeing phone thefts on an industrial scale, fuelled by criminals making millions by being able to easily sell on stolen devices either here or abroad. \"By intensifying our efforts we're catching more perpetrators and protecting people from having their phone stolen in the capital.\" He added that there were calls for other agencies and the government to do more, and for tech companies to make stolen phones unusable. The force wants the phone industry to prevent stolen handsets from being reconnected to cloud services. The Met said it had used tracking technology, and victims reporting phone-thefts, to recently prosecute four members of a gang who were later sentenced to a combined 18 years in prison. The gang had been caught handling more than 5,000 stolen phones.\n\nMayor of London Sir Sadiq Khan said the Met was \"spearheading targeted work to prevent and tackle mobile phone theft in London\", adding: \"I'm determined to eliminate the scourge of mobile phone theft in our city for good.\"\n\nAdvice from police: Register all phones with immobilise.com, a national property register\n\nSet up a strong password and two-factor authentication\n\nTurn off message previews so thieves cannot see any messages\n\nWrite down and safely store the phone's IMEI number\n\nListen to the best of BBC Radio London on Sounds and follow BBC London on Facebook, X and Instagram. Send your story ideas to hello.bbclondon@bbc.co.uk",
        "word_count": 705,
        "url": "https://www.bbc.com/news/articles/c4g39ldprr3o"
    },
    {
        "title": "AI-enabled satellites could help the US evade a crippling cyber attack",
        "author": "Tom Porter",
        "published_date": "Unknown",
        "content": "The Pentagon is developing AI-enabled satellite technology.\n\nAI satellites offer advantages amid intensifying competition in space.\n\nThey could supercharge data analysis and help evade the consequences of a Chinese cyber-attack.\n\nA vast network of military satellites belonging to the US has long underpinned its dominance in space. But China is challenging the US status as the space superpower, and its satellite system is in the crosshairs.\n\nDefense News reported last month that the US Navy is moving forward with plans to build a network of fully autonomous satellites that are able to navigate independently without GPS or ground control.\n\nAnalysts say that AI could help the US stay ahead, providing its satellites with the capacity to evade the consequences of a potentially crippling attack, as well as more power to collect and analyze large amounts of data.\n\nThe race for satellite dominance\n\nThe stakes in the battle for satellite supremacy are high, Melanie Garson, an associate professor in International Conflict Resolution & International Security at University College London, told Business Insider.\n\nThe winner would control a vital aspect of space infrastructure, which would also provide an advantage in intelligence gathering and precision strikes in the event of a war.\n\nAI \"will provide additional capabilities for surveillance and espionage as well as being able to interfere with the other's space assets through spectrum warfare or cyberattacks,\" Garson said.\n\nThe US has hundreds of military satellites in orbit, with China and Russia not far behind.\n\nIf a war were to break out between the US and China, military experts say that China has the capability to do serious damage to US space-based assets through a range of anti-satellite, or ASAT, capabilities, including programming its satellites to attack others.\n\nA CIA report that leaked in 2023 said China was focusing its efforts in the event of a war on hacking the systems used to control US satellite networks.\n\nSystems confrontation and destruction warfare is believed to be a preferred Chinese military tactic for 21st-century warfare.\n\nCrippling these systems would leave satellites unable to transfer communications and data, or even coordinate with each other, the report said.\n\nRelated stories\n\nAI could be the key\n\nAI for satellites could be crucial to preserving US capabilities. Unlike satellites that require human input, autonomous satellites can operate independently, processing and analyzing data to make their own decisions.\n\nThe autonomy makes them less vulnerable to possible attacks on bases or communications networks or to being cut off from operators by electronic warfare like signal jamming, said Clayton Swope, deputy director of the Aerospace Security Project and a senior fellow in the Defense and Security Department at the Center for Strategic and International Studies.\n\n\"Decentralized decision-making may add resilience by decreasing the reliance on ground-based infrastructure,\" Krista Langeland, deputy lead of the RAND Space Enterprise Initiative, told BI. \"AI capabilities could also help with detection and characterization of an attack.\"\n\nAnother advantage is that AI could help process vast amounts of data in space, and identify potentially hostile satellites more quickly.\n\n\"Space is huge,\" Swope said, \"so AI will help satellites better understand what's happening around them and keep track of what other satellites are doing.\"\n\n\"That could help US satellites maneuver to avoid accidental collisions but also stay clear of potentially hostile adversarial satellites,\" he said.\n\nA distant goal\n\nThe power of the technology to revolutionize US satellite technology and security is significant, Alison Grey, a satellites expert at PA Consulting, told BI.\n\n\"Ultimately, AI-enabled automation can enable a network to react and recover from various threats in space,\" she said, \"whether that's from natural phenomena, anomalies in one's own system, or potentially hostile activity.\"\n\nHowever, while the technology is already being applied in some military satellites, realizing its full potential is likely to be some way off.\n\nSpace Force's former top acquisition official, Frank Calvelli, told an event last year that he expects satellites to be \"significantly more autonomous\" within the next 10 to 15 years.\n\nEven so, efforts are intensifying to begin realizing its potential. Defense News said that the US Navy is researching a fully autonomous model, the Autosat, and wants to take the tests further.\n\n\"We've done a demo of this and proven out the principles and are looking for the next step,\" Steven Meier, director of space technology at the Naval Research Laboratory, said at a recent summit in Virginia. \"We want to get funding to actually build a system along these lines and launch it.\"",
        "word_count": 743,
        "url": "https://www.businessinsider.com/ai-could-help-us-satellites-evade-crippling-cyber-attack-china-2025-2"
    },
    {
        "title": "Bowel cancer prediction test for IBD patients 90% accurate",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Bowel cancer prediction test for IBD patients 90% accurate\n\n30 January 2025 Dominic Hughes Health correspondent, BBC News\n\nPA\n\nA new method for detecting bowel cancer is more than 90% accurate at predicting which higher-risk people will develop the disease, according to research. About 500,000 people in the UK live with inflammatory bowel disease (IBD), including Crohn's and ulcerative colitis. Currently, they are offered regular checks for pre-cancerous growths in their gut, which, if detected, indicate about a 30% chance of bowel cancer developing over 10 years. But the UK research found DNA changes in those pre-cancerous cells, when analysed by an algorithm, were more than 90% accurate in predicting who would develop bowel cancer over the next five years.\n\nThe researchers used tissue samples from IBD patients - but it is hoped their method can be used to develop a simple blood test to identify those IBD patients most at risk.\n\nCraig Foster Craig Foster's wife, Fariba, died of bowel cancer last year\n\n\"Research like this will save lives,\" Craig Foster, from Waterlooville, Hants, whose wife, Fariba, died of bowel cancer in February 2024, said. Fariba had lived with ulcerative colitis since she was 18, when three-quarters of her bowel were removed. \"It gives me comfort to know that there are scientists working right now so that no-one has to experience the same situation Fariba was in,\" Craig said. \"Fariba died just six months after she was diagnosed. \"Even though it was a short time, it was the worst time. \"Cancer takes no prisoners - and it doesn't matter who you are or from what walk of life, everyone is affected in some way,\"\n\nThe Institute of Cancer Research Prof Trevor Graham says the new test should help identify those at high risk, putting the minds of many others at rest\n\nProf Trevor Graham, from the Institute of Cancer Research in London, said: \"Most people with ulcerative colitis or Crohn's disease won't develop bowel cancer. \"But for those that have these conditions and are showing signs of pre-cancer in their colon, there are some tough decisions to make. \"Either they have it monitored regularly, in the hope that it doesn't become cancer, or they have their bowel removed to guarantee they don't get cancer in the future. \"Neither of these options are particularly pleasant. \"Our test and algorithm give people with IBD, and the doctors who care for them, the best possible information so that they can make the right decision about how to manage their cancer risk.\"\n\n'Hugely exciting'\n\nMarianne Radcliffe, of the charity Crohn's & Colitis UK, said this was really positive news for those living with the conditions. \"People tell us that one of the hardest things about living with Crohn's or colitis is the uncertainty - in everyday life and in the long term. \"Just as with inflammatory bowel disease, we know the earlier you find out about cancer, the better. \"Anything that enables early detection with quicker, less invasive diagnostic tests, removing some of that uncertainty, is hugely exciting.\"\n\n'Focus resources'",
        "word_count": 507,
        "url": "https://www.bbc.com/news/articles/c87d4e2v8l0o"
    },
    {
        "title": "Timothée Chalamet and the 'Saturday Night Live' cast parody the state of AI in schools",
        "author": "Lauren Edmonds, Katie Balevic",
        "published_date": "Unknown",
        "content": "Timothée Chalamet hosted 'SNL' and joked about AI's role in education.\n\nAI is being integrated into classrooms around the world.\n\nWhile it could help with personalized learning, AI's use in education has risks.\n\nTimothée Chalamet hosted NBC's 'Saturday Night Live' this weekend. In one skit, he and the cast poked fun at the use of AI in education.\n\nIn a scene set in a classroom, cast members playing students tuned into an AI podcast meant to help them learn.\n\nSome of the answers given by the AI hosts — played by Chalamet and cast member Bowen Yang — were humorously false, referencing AI's tendency to \"hallucinate\" and sometimes provide users with bizarre answers to prompts.\n\n\"The school has invested in a new AI program that takes your textbooks and turns them into an educational podcast,\" Ego Nwodim, portraying a teacher, said in the skit. \"The technology isn't perfect, but they make it sound so casual that it doesn't even feel like homework.\"\n\nAfter Yang experienced a glitch, the pair attempted to explain photosynthesis.\n\n\"What do plants eat if it's not, like, burgers?\" Chalamet asked.\n\n\"Thank you for asking me that,\" Bowen said. \"Plants, legit, eat light.\"\n\nBy the end, Chalamet and Yang undergo an existential crisis during which they question where they came from.\n\n\"Do we exist?\" Chalamet asked.\n\n\"What are we? Who made us?\" Yang asked. \"Now, I'm mad. Now, I want revenge.\"\n\nAI technology is now a major part of most industries, including business, entertainment, and law, so it's not surprising that it's also becoming a tool in the teacher's toolbox.\n\nLocal media reported this month that in Arizona, students at a virtual academy will be taught by AI for two hours each day. In London, high school students prepared for exams with personalized learning using AI, which replaced their teachers.\n\n\"Students will benefit enormously from AI-powered adaptive learning, which allows every student to learn at their own pace rather than having to keep pace with a class, which often progresses too quickly for some students and too slowly for others,\" a coprincipal from the David Game College told BI in August.\n\nHowever, educators have also had to grapple with the pitfalls of AI, like plagiarism and wrong information.",
        "word_count": 371,
        "url": "https://www.businessinsider.com/timothee-chalamet-snl-joke-ai-schools-2025-1"
    },
    {
        "title": "Microsoft is shutting down its flagship retail storefront in the UK — cuts lease short in the heart of London",
        "author": "Zac Bowden, Senior Editor, Laura Knotek, Social Links Navigation",
        "published_date": "2025-01-23",
        "content": "Microsoft's flagship UK \"Experience Centre\" storefront in London will close its doors next month, the company has confirmed. In a statement to Windows Central, a Microsoft spokesperson said \"To better align with its focus on digital growth, Microsoft has decided to exit the lease at the Microsoft Experience Centre in London early.\"\n\nThe 21,000 square foot Microsoft Store in London first opened in July 2019 to much fanfare. It was designed to be a hub for technology from both Microsoft and its partners, showcasing high-end hardware from third-party OEMs as well as the latest products from Surface and Xbox.\n\nThe store also included an Answer Desk and support area, where Surface and Xbox customers could bring their devices for technical support should they need it. With the only physical storefront now closing, this will no longer be an avenue for support for customers with Surface PCs or Xbox consoles.\n\nUnfortunately, even though the Microsoft Store is located in a prime location in the heart of London's Oxford Street, the store seemingly hasn’t seen much footfall since its original launch date. \"We regularly review our locations and our workforce to ensure we are aligning to market opportunities and make changes to meet the demands of the business\" said the Microsoft spokesperson.\n\nIn addition to being a storefront and experience centre, Microsoft also used the space for business meetings with partners and colleagues. The store featured three floors, with the first two being used as retail space, and the third floor consisting of meeting spaces that the company frequently used.\n\nThe closure of the Microsoft Store in the UK is another blow for Microsoft's consumer facing products and services, which will no longer have a home on the streets of London. The company has been significantly scaling back on Surface and consumer efforts in the last handful of years, and the UK Microsoft Store is the latest victim.",
        "word_count": 316,
        "url": "https://www.windowscentral.com/microsoft/microsoft-is-shutting-down-its-flagship-retail-storefront-in-the-uk-cuts-lease-short-in-the-heart-of-london"
    },
    {
        "title": "Telling Time Used To Be A Ball",
        "author": "Al Williams, Carl Breen, Tim Andersson",
        "published_date": "2025-02-04",
        "content": "If you watch the New Year’s festivities from New York, you know that they mark midnight with the dropping of a big, gaudy ball. You might assume this was just an arbitrary gimmick, but it turns out dropping balls has a place in the history of timekeeping, especially for ships at sea. The New York ball doesn’t work precisely the same, but it was clearly inspired by an ancient method of indicating the time.\n\nApparently, even the ancient Greeks used ball dropping to indicate time. But the modern ball got its start with [Captain Robert Wauchope], who installed one at Portsmouth, England, in 1829. The Royal Observatory in Greenwich got one in 1833, which you can see working in the video below.\n\nThe Problem to Solve\n\nShips need accurate timing for navigation purposes, so when you made harbor, you wanted to set your clocks in case they were a bit off. But if you were far from the nearby town, you might not be able to hear a clocktower bell or a cannon shot at noon. Even if you did, the speed of sound could be significant. The signal needs to be something visible and preferably something that can indicate that it is “almost” time to get people’s attention.\n\nYou want something tall so it can be easily seen. You also need something that clearly indicates the exact moment of the time mark, so that precludes something like raising or dropping a signal flag.\n\nThe Solution\n\n[Wauchope’s] idea was to put a tower with a ball near a solar observatory with an accurate clock. Every day at noon, someone would sight the sun and determine the exact moment of noon, setting the accurate clock.\n\nThen, at 1300, an hour later, you’d drop the ball. Everyone could set their clock to coincide with the ball drop. The moment the ball started falling was 1300.\n\nAbout 1255, you’d raise the ball halfway. Around 1258, it would go to the top of the rod going through the center of the ball. The release would be at exactly 1300.\n\nThe American Take\n\nWell, that’s not usually true in the United States. The first ball in the US was at the United States Naval Observatory in 1845. They would drop their ball at noon, exactly.\n\nThe Times Square ball first dropped on January 1, 1908. However, in another American difference, the stroke of midnight is when the ball reaches the bottom, not the instant it starts to drop.\n\nEnd of the Ball\n\nOf course, radio time signals made this technology obsolete. Still, there are about sixty balls still around, including many in Australia, the United Kingdom, and several scattered in other parts of the world. In the United States, you can find time balls at the Naval Observatory, the New York City Titanic Memorial, and the Plymouth Light in Massachusetts.\n\nThe Greenwich Time Ball located at the Royal Observatory in London still drops its ball every day at 1300, as you saw in the earlier video. The guide at Greenwich mentions that the expression “on the ball” relates to time balls, but we’ve also read it is a sports idiom, so we aren’t sure about that. Surprisingly, it isn’t the tallest Time Ball in England. That honor goes to the one in Hull, which, as you can see below, was recently restored and is once again operational. You can also watch a deep dive into the history of that particular ball.\n\nShips at sea have driven our time-keeping technology in many ways. Not to mention things like GPS or LORAN.\n\nFeatured image: “Working New Years Eve Social Media for NBC” by Anthony Quintano. Thumbnail: “Newyearseve loz batrch” by Alex Lozupone.",
        "word_count": 615,
        "url": "https://hackaday.com/2025/02/04/telling-time-used-to-be-a-ball/"
    },
    {
        "title": "DOGE has officially arrived, but it looks pretty different from what was promised",
        "author": "Hallam Bullock",
        "published_date": "Unknown",
        "content": "This excerpt originally appeared in the Business Insider Today newsletter.\n\nYou can sign up for Business Insider's daily newsletter here.\n\nTrump wasted no time establishing the \"Department of Government Efficiency\" (DOGE).\n\nAnnounced after his win in November, DOGE promised to \"provide advice and guidance from outside of government\" to help roll back bad regulations and slash government spending. It would also be helmed by billionaires Elon Musk and Vivek Ramaswamy. The pair had big plans .\n\nBut the DOGE that was signed into life via executive order on Monday is markedly different, BI's Jack Newsham, Alice Tecotzky, and Brent Griffiths write. It's now officially part of the White House , rather than operating as an outside advisory committee.\n\nThe executive order also didn't create a new department, but rather renamed another — DOGE will replace the Obama-era US Digital Service (USDS), a unit that primarily works on improving government websites and tech. The USDS's unit had grown to more than 200 people, while Musk's new team is reported to consist of 20 staff.\n\nOh, and Ramaswamy is no longer a co-leader . Instead of running the group with Musk, he's expected to run for governor of Ohio, according to various media reports.\n\nPresident-elect Donald Trump tapped Elon Musk and Vivek Ramaswamy to lead the Department of Government Efficiency, or DOGE, in November. Brandon Bell via Getty Images\n\nSo, why all the changes?\n\nExperts said bringing DOGE inside the federal government could avoid legal headaches (minutes after Trump became president, DOGE was hit with three lawsuits ). But it also raises new issues. DOGE is now subject to new transparency and ethical rules, particularly around public information laws.\n\nBeing part of the government also means Musk can't use his private fortune to fund DOGE's operations — though one expert told BI that there would likely be easy ways for Musk to get around those limits .\n\nDOGE's mission, per the executive order, is now to \"implement the President's DOGE Agenda, by modernizing Federal technology and software to maximize governmental efficiency and productivity.\"\n\nMeanwhile, Trump's Office of Personnel Management is making moves reminiscent of DOGE's initial goals: asking federal agencies to put together lists of workers they could easily fire .\n\nThe Insider Today team: Dan DeFrancesco, deputy editor and anchor, in New York. Grace Lett, editor, in Chicago. Lisa Ryan, executive editor, in New York. Ella Hopkins, associate editor, in London. Hallam Bullock, senior editor, in London. Amanda Yen, associate editor, in New York. Elizabeth Casolo, fellow, in Chicago. Lisa Ryan, executive editor, in New York.",
        "word_count": 425,
        "url": "https://www.businessinsider.com/doge-different-musk-official-white-house-trump-2025-1"
    },
    {
        "title": "How to watch the first supersonic flight of Boom Supersonic’s XB-1 aircraft",
        "author": "Trevor Mogg, Published January",
        "published_date": "2025-01-27",
        "content": "Boom Supersonic is just hours away from performing the first supersonic flight of its XB-1 test plane. A successful test will take it a big step toward its goal of launching supersonic passenger flights before the end of this decade.\n\nBoom Supersonic will live stream the first supersonic flight of Boom’s demonstrator aircraft, which is set for Tuesday morning at the Mojave Air & Space Port in Mojave, California. Read on for full details on how to watch.\n\nRecommended Videos\n\nXB-1 is the world’s first independently developed supersonic jet and the first civil supersonic jet built in the U.S. The aircraft has so far completed 11 test flights since its first one in March 2024. Its most recent outing saw it reach speeds of Mach 0.95 — just below the supersonic threshold of Mach 1.\n\nPlease enable Javascript to view this content\n\nTuesday’s test, however, will see the aircraft break the sound barrier for the first time, “setting the stage for the return of supersonic travel” that was lost with the retirement of Concorde in 2003, Colorado-based Boom said.\n\nXB-1 contains the technology that will help Boom build its supersonic commercial airliner, Overture, with the likes of United and American Airlines having already placed orders.\n\nOverture will have a top speed of Mach 1.7, slower than Concorde’s maximum speed of Mach 2.04, but still fast enough to cut in half the seven hours that it takes to fly from New York to London on a conventional passenger jet.\n\nPowered by sustainable aviation fuel, Overture will fly up to 80 passengers at a cruising altitude of about 60,000 feet, more than 20,000 feet higher than today’s commercial jets.\n\nHow to watch\n\nThe first-ever supersonic flight of Boom’s XB-1 test plane is set to take place at the Mojave Air & Space Port in Mojave, California, at at 7:45 a.m. PT (10:45 a.m. E.T) on Tuesday, January 28, though the schedule could change depending on weather conditions or any last-minute technical issues that surface.\n\nYou can watch the live stream on Boom’s website.\n\nViewers will get to see air-to-air footage of the XB-1 aircraft during its supersonic flight, as well as a Q&A session hosted by former Concorde pilot Mike Bannister with Boom CEO Blake Scholl and chief test pilot Tristan “Geppetto” Brandenburg.",
        "word_count": 381,
        "url": "https://www.digitaltrends.com/news/how-to-watch-the-first-supersonic-flight-of-boom-supersonics-xb-1-aircraft/"
    },
    {
        "title": "Cooking Up Success: Jamie Oliver’s Web Design Transformation",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Discover how Rotateº reimagined Jamie Oliver’s digital platform with sleek web design and a content-first approach.\n\nThe Jamie Oliver Group, a culinary brand synonymous with approachable and joyful cooking, has embarked on a digital transformation led by London-based technology studio Rotateº. The project reimagines JamieOliver.com as a unified hub, aligning the group’s diverse offerings—including media, products, and restaurants—under a cohesive web design strategy.\n\nA Unified Vision for Web Design\n\nJamieOliver.com’s redesign prioritizes functionality and aesthetics, presenting a content-first experience. By placing recipes, food stories, and seasonal content at the forefront, the new platform seamlessly reflects the brand’s ethos. Every visual element, from the color palette to the typography, reinforces Jamie Oliver’s identity, ensuring a unified and engaging user experience.\n\nModular Systems for Dynamic Content\n\nA key aspect of the redesign is its modular design system, which empowers content teams to craft rich, flexible stories while maintaining consistency. This scalable system allows for an intuitive balance between bold headlines and precise subheadings, using a custom typeface that feels modern and approachable.\n\nSanity’s Content Management System (CMS) plays a vital role, acting as a custom page builder for brand-focused storytelling. This integration enables seamless updates, ensuring the website evolves alongside the Jamie Oliver Group’s ambitions.\n\nElegance in Simplicity\n\nThe refreshed platform uses sleek, curved design elements to achieve a balance between minimalism and vibrancy. The clean layouts elevate content, making recipes and features easier to explore. This simplicity enhances usability while celebrating the seasonal and colorful nature of Jamie Oliver’s culinary world.\n\nConsolidation for a Global Audience\n\nThe redesign isn’t just about aesthetics. It consolidates multiple digital properties under one cohesive domain, creating a streamlined experience for global audiences. This strategy strengthens brand consistency while laying the groundwork for future innovations.\n\n“We are excited to collaborate with the Jamie Oliver Group on this transformative project. At Rotate°, we are committed to blending modern technologies with creative design to deliver exceptional digital experiences. This partnership with Jamie Oliver is a testament to their enthusiasm for innovation in the digital space.” - Chris Harris, CXO, Rotate°\n\nThis redesign marks a significant milestone in the Jamie Oliver Group’s evolution as a global food brand. Rotateº’s thoughtful integration of design and technology ensures the platform meets user needs while showcasing the brand’s personality.\n\nThe collaboration is a reminder of how modern web design can bring flavor and functionality together. For more on this project, visit Rotateº or Jamie Oliver.\n\nWeb design artifacts",
        "word_count": 406,
        "url": "https://abduzeedo.com/node/88731"
    },
    {
        "title": "This artist collaborates with AI and robots",
        "author": "Stephen Ornes",
        "published_date": "2025-02-17",
        "content": "“[Chung] comes from drawing, and then they start to work with AI, but not like we’ve seen in this generative AI movement where it’s all about generating images on screen,” says Sofian Audry, an artist and scholar at the University of Quebec in Montreal, who studies the relationships that artists establish with machines in their work. “[Chung is] really into this idea of performance. So they’re turning their drawing approach into a performative approach where things happen live.”\n\nAudiences watch as Chung works alongside or surrounded by robots, human and machine drawing simultaneously.\n\nThe artwork, Chung says, emerges not just in the finished piece but in all the messy in-betweens. “My goal,” they explain, “isn’t to replace traditional methods but to deepen and expand them, allowing art to arise from a genuine meeting of human and machine perspectives.” Such a meeting took place in January 2025 at the World Economic Forum in Davos, Switzerland, where Chung presented Spectral, a performative art installation featuring painting by robotic arms whose motions are guided by AI that combines data from earlier works with real-time input from an electroencephalogram.\n\n“My alpha state drives the robot’s behavior, translating an internal experience into tangible, spatial gestures,” says Chung, referring to brain activity associated with being quiet and relaxed. Works like Spectral, they say, show how AI can move beyond being just an artistic tool—or threat—to become a collaborator.\n\nSpectral, a performative art installation presented in January, featured robotic arms whose drawing motions were guided by real-time input from an EEG worn by the artist. COURTESY OF THE ARTIST\n\nThrough AI, says Chung, robots can perform in unexpected ways. Creating art in real time allows these surprises to become part of the process: “Live performance is a crucial component of my work. It creates a real-time relationship between me, the machine, and an audience, allowing everyone to witness the system’s unpredictabilities and creative possibilities.”\n\nChung grew up in Canada, the child of immigrants from Hong Kong. Their father was a trained opera singer, their mom a computer programmer. Growing up, Chung played multiple musical instruments, and the family was among the first on the block to have a computer. “I was raised speaking both the language of music and the language of code,” they say. The internet offered unlimited possibilities: “I was captivated by what I saw as a nascent, optimistic frontier.”\n\nTheir early works, mostly ink drawings on paper, tended to be sprawling, abstract explosions of form and line. But increasingly, Chung began to embrace performance. Then in 2015, at 29, after studying visual and interactive art in college and graduate school, they joined the MIT Media Lab as a research fellow. “I was inspired by … the idea that the robotic form could be anything—a sculptural embodied interaction,” they say.\n\nDrawing Operations Unit: Generation 1 (DOUG 1) was the first of Chung’s collaborative robots. COURTESY OF THE ARTIST\n\nChung found open-source plans online and assembled a robotic arm that could hold its own pencil or paintbrush. They added an overhead camera and computer vision software that could analyze the video stream of Chung drawing and then tell the arm where to make its marks to copy Chung’s work. The robot was named Drawing Operations Unit: Generation 1, or DOUG 1.\n\nThe goal was mimicry: As the artist drew, the arm copied. Except it didn’t work out that way. The arm, unpredictably, made small errant movements, creating sketches that were similar to Chung’s—but not identical. These “mistakes” became part of the creative process. “One of the most transformative lessons I’ve learned is to ‘poeticize error,’” Chung says. “That mindset has given me a real sense of resilience, because I’m no longer afraid of failing; I trust that the failures themselves can be generative.”",
        "word_count": 627,
        "url": "https://www.technologyreview.com/2025/02/17/1111387/ai-sougwen-chung-art-robots-collaboration/"
    },
    {
        "title": "The CEOs of Microsoft and Alphabet have bought part of the London Hundred cricket franchise",
        "author": "Mike Moore, Deputy Editor, Techradar Pro, Social Links Navigation",
        "published_date": "2025-02-03",
        "content": "Microsoft and Alphabet CEOs are among the latest investors in a London cricket team\n\nLondon Spirit seals £145m deal for 49% stake in franchise\n\nBid led by Palo Alto Networks chairman Nikesh Arora\n\nThe CEOs of Alphabet and Microsoft are among several technology heads behind a record-breaking bid for a minority stake in a franchise of the UK's Hundred cricket competition.\n\nSatya Nadella and Sundar Pichai have joined a number of other cricket fans holding major roles at technology firms who have come together for a £145 million bid for a 49% in the London Spirit franchise.\n\nThe bid is the largest in this year's tender, and values the London Spirit, which plays its matches at the iconic Lord's cricket ground in the capital, at over £300 million.\n\nLondon Spirit deal\n\nLeading the bid, officially made by a consortium called the Cricket Investor Holdings Limited, is Nikesh Arora, the chief executive of security firm Palo Alto Networks, who heads up what the Marylebone Cricket Club (MCC), owner of Lord's, called \"11 high net-worth individuals\".\n\nAlong with Nadella and Pichai, this includes Shantanu Narayen, chief executive of Adobe, Egon Durban, the chief executive of Silver Lake Management, and Satyan Gajwani, the co-founder of Major League Cricket and vice-chairman of Times Internet.\n\nNadella and Pichai are both huge fans of cricket, which enjoys a huge fan base in their home nation of India. Nadella in particular is known for sneaking cricket references into the background of online talks and addresses, and is also an investor in the new Major League Cricket competition, co-owning the Seattle Orcas team.\n\nThe group was only able to bid for a 49% stake due to the remainder being retained by the MCC. Each of the hosts for the eight teams were given a 51% stake in their franchise, which they can sell or keep, with the ECB then selling the remaining 49%.\n\nAre you a pro? Subscribe to our newsletter Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nElsewhere in the auction, Indian-American IT entrepreneur Sanjay Govil, the founder and chairman of Infinite Computer Solutions, also spent £80m for a stake in the Welsh Fire franchise.\n\nIndia's richest man, Mukesh Ambani, founder of the Reliance Group, snapped up the stake in the Oval Invincibles, London's other franchise in the competition.\n\nVia Cricket.com",
        "word_count": 421,
        "url": "https://www.techradar.com/pro/the-ceos-of-microsoft-and-alphabet-have-bought-part-of-the-london-hundred-cricket-franchise"
    },
    {
        "title": "Energiewende: Schottland bietet Deutschland Versorgung mit grünem Wasserstoff an",
        "author": "Grüner Wasserstoff",
        "published_date": "2025-01-22",
        "content": "Schottland will Deutschland in Zukunft als großer Lieferant mit grünem Wasserstoff versorgen. \"Wir werden mehr Strom erzeugen, als wir verbrauchen können\", sagte die schottische Energieministerin Gillian Martin den Zeitungen der Funke Mediengruppe. \"Mit dem überschüssigen Strom produzieren wir grünen Wasserstoff. Und den können wir nach Deutschland liefern.\"\n\nDer gelieferte Wasserstoff könnte große Teile des Bedarfs 2030 decken, sagte die Politikerin der Scottish National Party. \"Transportiert werden soll der Wasserstoff zunächst per Schiff\", sagte Martin. \"Wir hoffen auf eine Pipeline, die von Schottland über Nordengland nach Deutschland verläuft.\"\n\n\n\nPipeline von Schottland nach Emden\n\nEine Studie im Auftrag des staatlichen Net Zero Technology Centers in Aberdeen schätzt, die Pipeline könnte rund 3,1 Milliarden Euro kosten. Endpunkt wäre Emden in Niedersachsen.\n\nMit der Pipeline könne es aber noch dauern, fügte Schottlands Energieministerin hinzu. \"Eine Pipeline kostet sehr viel Geld. Das kann kein Land allein stemmen\", sagte sie. \"Wir sind aber jetzt zuversichtlicher als in den vergangenen Jahren, dass es vorangeht.\"\n\nGrund sei der Wechsel der britischen Regierung in London. Dort hat Labour nach Jahren die Konservativen abgelöst und nähert sich der EU an. \"Es ist alles da\", sagte Martin mit Blick auf London und Brüssel. \"Wir brauchen den politischen Willen zu handeln.\"\n\n\n\nGrüner Wasserstoff gilt als Hoffnung der Energiewende\n\nGrüner Wasserstoff aus erneuerbarem Strom gilt als großes Versprechen bei der Energiewende. Deutschland hofft, mit dem Stoff seine Klimaziele zu erreichen und eine Industrienation zu bleiben. Doch in den vergangenen Monaten haben sich immer mehr Produzenten zurückgezogen, und die anfängliche Begeisterung ist verblasst. Schon im Sommer warnte der Europäische Rechnungshof, die EU werde ihre Wasserstoffziele vermutlich nicht erreichen. Im Herbst verkündete der norwegische Energiekonzern Equinor, seine geplante Wasserstoffpipeline nach Deutschland nun doch nicht zu verlegen.\n\n© ZEIT ONLINE Newsletter Cashkurs Tschüss, Finanzchaos: In acht Wochen erklären wir Schritt für Schritt, wie Sie bessere Geldroutinen aufbauen und das mit den ETFs endlich angehen. Anschließend erhalten Sie unseren Geld-Newsletter mit den besten Artikeln rund um Finanzen. Registrieren Mit Ihrer Registrierung nehmen Sie die Datenschutzerklärung zur Kenntnis. Vielen Dank! Wir haben Ihnen eine E-Mail geschickt. Prüfen Sie Ihr Postfach und bestätigen Sie das Newsletter-Abonnement. Diese E-Mail-Adresse ist bereits registriert. Bitte geben Sie auf der folgenden Seite Ihr Passwort ein.\n\nFalls Sie nicht weitergeleitet werden, klicken Sie bitte hier .\n\nVerwandelt man Strom aus erneuerbaren Quellen in Wasserstoff, das leichteste Element der Welt, lässt er sich in Pipelines gut transportieren. Um ihn zu verschiffen, muss man den Wasserstoff aber verflüssigen und dafür auf minus 253 Grad abkühlen. Die dafür notwendige Infrastruktur ist bisher noch nicht in nennenswerter Größe vorhanden. Entsprechend lassen sich auch die Kosten für Projekte mit grünem Wasserstoff bisher meist nur schätzen.",
        "word_count": 436,
        "url": "https://www.zeit.de/wirtschaft/2025-01/schottland-gruener-wasserstoff-lieferung-deutschland"
    },
    {
        "title": "Good news: the average cost of UK rent is falling",
        "author": "Unknown",
        "published_date": "2025-01-28",
        "content": "The good news is average private rents in Great Britain have fallen for the first time since 2019. The bad news? They’ve fallen by precisely £3.\n\nNew figures from Rightmove show that the average rent outside London dropped to £1,341 a month in the final three months of 2024, equating to a drop of £3 compared to the previous quarter.\n\nJust think what you could do with the money you’re now saving – you could buy two Greggs sausage rolls (and have 10p left over – lucky you!), or 81 per cent of a cup of coffee! But why stop there? Why not set your sights much higher with such a windfall? Think about it: you could amass enough for a house deposit if you save your monthly £3 for 958 years!\n\nIf you’re in London, however, the situation is even more bleak (no sausage rolls or half-empty coffees for you). Sadly, average rents have continued to rise in the capital, reaching a record £2,695 a month.\n\nStill, Rightmove has claimed the paltry £3 fall is a “key milestone” which could herald the easing of the housing crisis, with rents now rising at a slower rate compared to previous years. At one point in 2022, rents were rising at a rate of 12 per cent year-on-year – by contrast they rose by nine per cent in the 12 months to December 2024.\n\nThere are also signs demand for rental properties is falling while supply is rising: the number of available homes for rent was 13 per cent higher than this time last year, while at the same time, the number of prospective tenants contacting letting agents about a move was 16 per cent lower.\n\nIt’s worth noting, though, that we don’t actually have to contend with the whims of the market like this – if the government introduced rent controls, we could ensure that private renters always have access to affordable housing. But, unfortunately, Keir Starmer’s Labour unequivocally opposes rent control policies, and so for now the £3 rent drop is the only silver lining we have (unless you live in London, in which case you have... nothing?).",
        "word_count": 358,
        "url": "https://www.dazeddigital.com/life-culture/article/65955/1/average-cost-uk-rent-is-falling-by-three-pounds-amazing-so-good?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=good-news-the-average-cost-of-uk-rent-is-falling"
    },
    {
        "title": "One in Twelve in Multicultural London an Illegal Immigrant: Report",
        "author": "Kurt Zindulka",
        "published_date": "2025-01-23",
        "content": "The multicultural hub that is modern-day London may be home to nearly 600,000 illegal migrants, or around one in 12 people living in the UK capital city, uncovered estimates suggest.\n\nA study conducted by Edge Analytics and Leeds University on behalf of Thames Water, the top water utility company for London, found that there was a large “hidden” population of illegal migrants living in the capital.\n\nAccording to its findings, which The Telegraph unearthed through freedom of information requests, at the low end of its estimates, at least 390,355 illegals live in London, and up to 585,533 at the top end\n\nHowever, some have suggested that the study may have undercounted the current reality, as it did not take into account the more than 100,000 illegals that have arrived by boat after crossing the English Channel from France since 2017.\n\nThe study, which sought to provide the water utility with better information on providing water to the people of London, was based on data from the Office for National Statistics, the London School of Economics, Pew Research, in conjunction with National Insurance registrations for non-EU foreign nationals over nine years.\n\nThe report found that overall, over a million illegals are living in the United Kingdom, 60 per cent of whom reside in London, or around one in 12 of the city’s estimated 7 million people population.\n\nWhile the study was not intended for public consumption, it provides a rare look into the state of illegal migration in London, given that the Home Office refuses to publish estimates on the number of illegals living in the country.\n\nThe scale of London’s illegal migrant problem may explain, in part at least, the soaring cost of living in the city, with exceptionally high demand pushing average monthly rents to record highs of over £2,200 ($2,710) last year, compared to the national average of around £1,300 ($1,600).\n\nAdditionally, the cost of supporting so-called asylum seekers, many of whom apply after entering the country illegally, has continued to rise, placing more strain on social services and the British taxpayer.\n\nAccording to an October report from the Institute for Public Policy Research (IPPR), the cost of housing and support for asylum seekers rose from £17,000 per migrant in 2019/20 to around £41,000 in 2023/24.\n\nIt may also be a contributing factor to the crime problem facing London, with an analysis last year finding that migrants were over a quarter more likely to be imprisoned than the native-born population.\n\nHowever, like the refusal to publish data on the number of illegals in the country, successive governments have refused to disclose the nationality or visa and asylum status of criminals in Britain.\n\nCommenting on London’s illegal migrant crisis, Migration Watch UK Chairman Alp Mehmet said that it will have “colossal implications for utility and local authority planning. Utilities, housing, the NHS, GP surgeries and schools will all come under severe pressure, further risking community cohesion.”\n\nThe deputy leader of Nigel Farage’s Reform UK party, Richard Tice, added: “One in 12 people in London are here illegally, probably working illegally using taxpayer-funded public infrastructure and services.\n\n“It is totally unacceptable. It’s another reason why we need to properly control our borders.”",
        "word_count": 532,
        "url": "https://www.breitbart.com/europe/2025/01/23/multicultural-london-home-to-nearly-600000-illegals-or-one-in-12-residents-report/"
    },
    {
        "title": "European defense stocks surge as investors bet Trump's Ukraine stance will push up military spending",
        "author": "Nora Redmond",
        "published_date": "Unknown",
        "content": "Defense stocks are surging on expectations that European defense spending may increase.\n\nThe Trump administration has signalled its desire to pull back from providing funding for Ukraine.\n\nThere is \"seemingly more urgency now to increase defense spending,\" Deutsche Bank analysts said.\n\nEuropean defense stocks are surging as investors bet on increased military spending amid uncertainty over the future of the war in Ukraine and pressure from the Trump administration.\n\nShares in London-based aerospace, defense, and information security firm BAE Systems jumped 7% as of around 1:30 p.m. UK time (8:30 a.m. ET).\n\nIn Germany, security technology company Rheinmetall soared over 8%. Shares in French firm Thales, which manufactures military equipment including drones were up almost 5%. Italy's Leonardo, one of the manufacturers of the Eurofighter Typhoon jet, also saw shares climb 6% Monday.\n\nThe rally follows a number of interventions from senior figures in the Trump administration regarding defense spending in Europe, and President Donald Trump's announcement last week that he would seek to meet Russian President Vladimir Putin to discuss Ukraine.\n\nTrump has long pledged to bring the conflict to an end as president, with concerns in Europe growing in recent days that the US could withdraw financial support for Ukraine.\n\nPete Hegseth, Trump's newly appointed defense secretary, said last week that the US was no longer \"primarily focused\" on Europe's security. He added that going forward Europe \"must provide the overwhelming share of future lethal and nonlethal aid to Ukraine.\"\n\nHe asked NATO members to increase their defense spending from 2% of GDP to 5%.\n\nEuropean leaders are set to hold an emergency summit on Ukraine on Monday, with British Prime Minister Keir Starmer saying earlier in the day that he was willing to send troops to Ukraine.\n\n\"There is seemingly more urgency now to increase defense spending and this is something European leaders seem to be coalescing around to some degree,\" analysts at Deutsche Bank said in a note.\n\n\"In terms of European geopolitics it's been a huge last few days with potentially large ramifications ahead,\" the note said.\n\nAccording to research published by McKinsey last week, since 2014, NATO members have spent an average of 1.6% of their GDPs on defense. Estonia and Latvia — which both border Russia — have announced that their target is to spend 5%, and Poland wants to reach 4.7% in 2025.\n\n\"Several European countries have announced an increase in defense budgets for FY24 and onwards,\" Bank of America analysts said in a report published on Monday.\n\n\"We believe that the Republicans winning the House & Senate as well as Trump's election will likely accelerate and reinforce the commitment of NATO members to spend at least 2% of GDP in defense,\" they said.\n\nSecretary of State Marco Rubio will meet Russian officials this week. AP Photo/Evan Vucci, File\n\nUS Secretary of State Marco Rubio will meet Russian officials this week in Saudi Arabia to discuss the war in Ukraine. European leaders and Ukrainian President Volodymyr Zelenskyy have said they were not invited to the talks.\n\nAt the same time, Trump told reporters on Sunday that although no specific date is set, he could meet Putin \"very soon.\" The pair held what Trump called a \"lengthy and highly productive\" phone call last week.",
        "word_count": 541,
        "url": "https://markets.businessinsider.com/news/stocks/european-defense-stocks-surge-bae-systems-rheinmetall-donald-trump-2025-2"
    },
    {
        "title": "Children in B&Bs beyond legal limit as homelessness crisis pushes councils to 'breaking point'",
        "author": "Sky Uk Limited, Joely Santa Cruz, Data Journalist, Faye Brown, Political Reporter",
        "published_date": "Unknown",
        "content": "A record number of children are living in B&Bs beyond the legal limit as England's homelessness crisis pushes councils to breaking point.\n\nMPs said there is a \"dire need\" for housing reform, with the lack of affordable homes forcing cash-strapped local authorities to haemorrhage their funds on temporary accommodation.\n\nThe \"crisis situation\" means there is less money in the pot to focus on homelessness prevention, the cross-party Public Accounts Committee (PAC) said.\n\nCouncils are instead having to prioritise short-term solutions which can include putting families in bed and breakfasts - the fastest rising temporary accommodation type over the past decade, a Sky News analysis of government data found.\n\nTemporary accommodation is meant to be a short-term solution for people who are homeless while they wait for more suitable and long-term housing options.\n\nBut the rising number of homeless households in England, driven by a shortage of social or otherwise affordable housing to move on to, means that increasingly this fix is anything but temporary.\n\nA recent Sky News investigation found that children in some parts of England are spending as long as five-and-a-half years on average in temporary accommodation.\n\nLength of stay has increased significantly in many areas since 2021, with particularly long stays in London and the South East.\n\nB&B use was the fastest rising temporary accommodation type over the past decade, rising fourfold from 4,400 households in 2014 to a record high of 18,400 by 2024, according to government figures.\n\nThe data shows 6,000 of these households included children, of which two in three had been living there for longer than the 6-week legal limit.\n\nAll of this is cripplingly expensive for councils. B&Bs, meant to be reserved for emergencies only, were the largest single spending category in council homelessness budgets in 2024, at £723.9m.\n\nThis is more than triple the amount spent in 2014, which was £218m adjusted for inflation.\n\nOverall, temporary accommodation costs to local authorities have risen from more than £1.6bn in 2022-23 to around £2.1bn in 2023-24, the PAC said.\n\n'Crisis situation'\n\nThe PAC is calling for a clear strategy and stronger support for local authorities to address what it called \"a crisis situation\".\n\nDespite there being an overarching homelessness strategy for each of the devolved nations, England does not have one.\n\nCommittee chairman Sir Geoffrey Clifton-Brown said this had left local authorities \"attempting to save a sinking ship with a little more than a leaky bucket\".\n\nRead More:\n\nMum-of-three left homeless after reporting threats to police\n\nNational scandal' as number of children living in temporary accommodation reaches record high\n\nBe the first to get Breaking News Install the Sky News app for free\n\nMPs also urged the government to justify its Local Housing Allowance (LHA) rates, which calculate housing benefit for tenants renting from private landlords.\n\nThe committee said 45% of households in receipt of the benefit face a shortfall between what they receive from the government and what they are being asked to pay in rent, and the issue is \"exacerbated by the lack of affordable housing\".\n\nThe government has pledged to build 1.5 million homes by the end of this parliament, but it has not set a target of how many of them will be classed as affordable.\n\nPlease use Chrome browser for a more accessible video player 2:36 What are Labour's housing plans?\n\nGet Sky News on WhatsApp Follow our channel and never miss an update Tap here to follow\n\nSir Geoffrey said: \"My committee is deeply concerned by the number of people currently being housed in sub-standard, overpriced and at times, wholly inappropriate accommodation, sometimes a long way from their previous home.\n\n\"A lack of affordable housing, a focus on short-term solutions and no clear strategy to tackle this issue have left us with thousands of families in deeply troubling circumstances.\"\n\nHe added: \"Local authorities find themselves at breaking point as they haemorrhage funds to cover the rising costs of housing families in temporary accommodation.\n\n\"We are calling for an overarching strategy that addresses the need for better connectivity across government departments to tackle the root causes of this crisis.\n\n\"Without one, we fear this will remain an issue into which money is simply poured, without effectively tackling the blight of homelessness.\"",
        "word_count": 703,
        "url": "https://news.sky.com/story/children-in-bandbs-beyond-legal-limit-as-homelessness-crisis-pushes-councils-to-breaking-point-13294923"
    },
    {
        "title": "London Deputy Mayor praises Christian charity housing scheme for refugees",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "London Deputy Mayor praises Christian charity housing scheme for refugees\n\nThe Deputy Mayor of London for Housing and Residential Development has visited a refugee homelessness prevention scheme run by a Christian charity.\n\nTom Copley visited Housing Justice's scheme to see their \"innovative solution to homelessness in London\".\n\nAs part of the visit, Copley met Anna, who became a resident landlord in March 2024 and Ibrahim, a Syrian refugee who is staying at Anna's property for a six-month lodging placement.\n\nAnna volunteered for the scheme as a way to earn extra income from her spare room and out of a desire to help ease the rough sleeping crisis in London. Ibrahim is the second refugee that Anna has accepted as a lodger, following a \"positive experience\" with the first refugee assigned to her home.\n\nIbrahim, who was at risk of homelessness when he first arrived in Britain, was granted refugee status in July 2024 and is currently \"thriving\" in his work as a handyman, according to Housing Justice.\n\nIbrahim said of the arrangement, \"I would like to thank Housing Justice for all of the help they have given me, from helping me move on from the homeless shelter to accommodation with Anna. She is a very kind lady who has helped me with many things. I appreciate everything Housing Justice has done to give me an affordable home. Thanks Housing Justice for being a solution to my problems.\"\n\nHousing Justice's programme allows resident landlords to earn tax free income of up to £7,500 per year and is intended to provide newly accepted refugees with \"a stepping stone between asylum accommodation and more permanent homes\".\n\nPotential resident landlords are vetted and trained by Housing Justice, while the lodgers are given support in finding training, employment and gaining their own tenancy as well as access to English language classes.\n\nThe Deputy Mayor praised the scheme, which began in March last year, \"Everyone deserves a safe place to call home, so we are proud to be supporting Housing Justice with their innovative Refugee Lodgings Programme, which is helping to combat rough sleeping and homelessness in the capital by providing vital accommodation and support for newly recognised refugees.\"",
        "word_count": 363,
        "url": "https://www.christiantoday.com/article/london.deputy.mayor.praises.christian.charity.housing.scheme.for.refugees/142725.htm"
    },
    {
        "title": "Australians' Housing Crisis: Dreams Turn Into Nightmares",
        "author": "Gallup",
        "published_date": "2025-01-30",
        "content": "Aussie dissatisfaction with the availability of good, affordable housing among the highest in OECD\n\nLONDON -- For the past several years, Australians have been growing increasingly fed up with the availability of good, affordable housing where they live. But in 2024, the record-low 22% who were satisfied with the housing situation and the record-high 76% who were dissatisfied illustrate a level of frustration unseen in most wealthy economies.\n\n###Embeddable###\n\nThe causes of Australia’s current housing crisis are complex. Housing supply is not keeping pace with increasing demand for several reasons, including historic underinvestment in public housing, high levels of immigration, and pandemic-related delays in construction. As such, Australia has developed a significant housing deficit in recent years, and its housing stock lags below the average for Organisation for Economic Co-operation and Development (OECD) countries.\n\nThe rising affordability crisis is stark. Between 2002 and 2024, the house price-to-income ratio almost doubled, with the average house in Australia now costing nearly nine times the average household income. Rent has more than doubled over a similar period.\n\nThe result is a limited and expensive choice of housing options, which affects younger people and low-income households the most, as they have fewer economic resources to combat the hike in prices.\n\nMalaise in Australia’s Housing Market Stands Out\n\nAustralians are uniquely dissatisfied with housing compared with residents of other high-income countries. While people across OECD countries are typically dissatisfied with the availability of good, affordable housing where they live (with a median of 50% dissatisfied vs. 43% satisfied), only Türkiye ranks higher for dissatisfaction than Australia.\n\n###Embeddable###\n\nDissatisfaction with affordable housing is not only a problem in advanced economies. However, Australia’s dissatisfaction in 2024 stands out among rates measured worldwide over the past decade. Aside from Türkiye in 2024, only Gabon in 2014 (80%) has expressed greater dissatisfaction than Australia in the past 10 years.\n\nAustralians’ malaise with affordable housing bucks the trend of other community infrastructure and services, about which people remain highly positive. Clear majorities remain satisfied with the quality of healthcare (71%), schools (66%), roads and highways (60%), and public transportation (61%) in the city or area where they live -- just not housing (22%). The gaps between satisfaction with housing and these other community basics have never been wider.\n\n###Embeddable###\n\nHousing Crisis Hits Young, Working-Age Australians Hardest\n\nSatisfaction with the availability of good, affordable housing in Australia has fallen across all age groups in recent years, but particularly so among adults of working age. In 2024, 16% of adults aged 18 to 34 were satisfied, with one in five adults aged 35 to 64 (20%) expressing satisfaction.\n\n###Embeddable###\n\nYoung people have been hit especially hard by the housing crisis. Homeownership levels among young adults have fallen to record lows, and the average age of a first-time buyer has risen to around 35 from 25 since the turn of the century. While most older Australians already own their home, young people are facing an uphill struggle to get onto the housing ladder -- or even get by in an increasingly hostile rental market.\n\nSince Gallup started asking people worldwide about their satisfaction with the availability of good, affordable housing in 2006, the 16% satisfaction rate recorded among 18- to 34-year-olds in Australia is among the lowest totals ever measured. Other lows include Hong Kong in 2019 (11% of those aged 18 to 34 were satisfied), Mongolia in 2012 (12%), Iran in 2008 (13%) and Türkiye in 2024 (15%).\n\nIn another marker of how widespread the malaise with Australia’s housing crisis has become, 35% of people aged 65 and older are currently satisfied with the availability of affordable housing in their area, even though more than four in five own their own home, according to the 2021 Census.\n\nBottom Line\n\nThere is some hope that the situation will soon improve. The government has financed $25 billion in housing investments to roll out over the next decade. This includes investments in public housing, rent and homeownership assistance, as well as a bonus program granted to states and territories that surpass their building targets. If successful, this effort could help boost supply and affordability, helping to rebalance the market.\n\nHowever, for now, people in Australia -- particularly younger adults of working age -- are historically dissatisfied with the availability of affordable housing in their local area.\n\nFor many decades, the “Australian Dream” has been built upon the ideal of home ownership as a marker of progress, success and stability. It could be turning into something closer to a nightmare.\n\nTo stay up to date with the latest Gallup News insights and updates, follow us on X @Gallup.\n\nFor complete methodology and specific survey dates, please review Gallup's Country Data Set details.\n\nLearn more about how the Gallup World Poll works.\n\n###Embeddable###",
        "word_count": 796,
        "url": "https://news.gallup.com/poll/655625/australians-housing-crisis-dreams-turn-nightmares.aspx"
    },
    {
        "title": "Rightmove: 'First drop' in house rent prices outside London since before the COVID pandemic",
        "author": "Sky Uk Limited, James Sillars, Business, Economics Reporter",
        "published_date": "Unknown",
        "content": "The average asking price to rent a home outside London has fallen for the first time since before the COVID pandemic, according to a property website.\n\nRightmove credited improved levels of rental properties for the welcome shift, but declared that advertised private rents in the capital continued to tick up, for a 13th consecutive quarter, between October to December.\n\nIt reported an average sum of £2,695 per calendar month (pcm) for London, though that was only 0.1% higher than the previous quarter.\n\nThe rest of Britain had an average newly advertised rent of £1,341 pcm - down 0.2%.\n\nThe trend for the country as a whole is of a price slowdown following years of unprecedented growth that has resulted in successive monthly highs.\n\nRents are currently 4.7% up on a year earlier, the slowest rate of growth since 2021.\n\nThe property website said a rising supply of rental homes to choose from was improving the balance of supply and demand, although there were typically still 10 applications being made for every rental property.\n\nIt also suggested that many tenants had shifted their focus towards the sales market due to continued steep competition for rentals and as borrowing costs were now down from cost of living crisis peaks.\n\nPlease use Chrome browser for a more accessible video player 3:11 Social housing complaints surge\n\nRightmove's property expert Colleen Babcock said: \"While new tenants are still paying more than they were at this time last year, the pace of growth continues to slow.\n\n\"However, though this is the big picture of market activity, agents on the ground still tell us that the market is very hot, and some areas have improved more than others when it comes to the supply and demand balance.\"\n\nThe northeast of England was said to have seen the biggest boost to supply, with Wales the smallest.\n\nGet Sky News on WhatsApp Follow our channel and never miss an update Tap here to follow\n\nAlex Bloxham, a partner and head of residential lettings at the consultancy Bidwells, said: \"These figures suggest landlords are continuing to invest in their buy-to-let portfolios, while more tenants are choosing to stay put, likely due to continued macroeconomic uncertainty and the up-front costs involved in relocating.\"\n\nThe debt charity StepChange reacted to the figures by saying that they were unlikely to bring any immediate relief to millions of families grappling with higher bills.\n\nPlease use Chrome browser for a more accessible video player 2:31 Water bills 'an absolute disgrace'\n\nIts recent polling suggested that 22% of people renting privately were always worried about money, with rents just one elevated cost to bear as many other bills such as those for food and energy show little sign of easing.\n\nWater and council tax costs are also due to rise sharply from April.\n\nBe the first to get Breaking News Install the Sky News app for free\n\nRead more from Sky News:\n\nRyanair profits nearly 10 times higher\n\nHobbycraft owner circles WH Smith\n\nThe charity's Richard Lane added: \"We're pleased to see the Renters Rights Bill progressing through parliament, which will end section 21 'no fault' evictions - a long overdue piece of legislation.\n\n\"However, we've long called for strengthened protections for private renters facing financial hardship.\n\n\"Our research shows that a significant proportion of private renters are having to rely on credit just to cover their rent, which is unsustainable and will only trap people in a cycle of problem debt.\n\n\"If you are struggling with rent arrears or any other type of debt, free and impartial advice is available from charities like StepChange.\"",
        "word_count": 599,
        "url": "https://news.sky.com/story/rightmove-first-drop-in-house-rent-prices-outside-london-since-before-the-covid-pandemic-13297867"
    },
    {
        "title": "More than 100 new towns being considered by ministers",
        "author": "Sky Uk Limited, Tim Baker, Political Reporter",
        "published_date": "Unknown",
        "content": "More than 100 new towns could be built under the government's plans for the \"largest housebuilding programme since the post-war era\".\n\nSir Keir Starmer will visit a development in Buckinghamshire today as he unveils the latest step in his plans to build 1.5 million homes.\n\nThe prime minister has once again attacked NIMBYs (\"Not in my backyard\" - opponents to building in their area), and backed \"working people\" who can't afford homes.\n\nPolitics latest: Follow the latest update\n\nAs part of today's announcement, a first draft of the blueprint for the 100 new towns will be published.\n\nThis will include suggestions on the amount of green spaces, number of GP surgeries, schools, public transport and affordable housing in these new towns.\n\nA final framework will be published in the summer.\n\nRead more:\n\nGovernment eyes digitising housebuilding\n\nRayner insists 1.5m target can be met\n\nPlease use Chrome browser for a more accessible video player 3:09 PM declares war on £100m bat shed\n\nWriting in The Metro, Sir Keir said he knew there would be \"huge opposition\" to his latest plans, but that \"for too long the NIMBYs and the naysayers have been able to clog up our systems so things can't get built\".\n\nThe government says more than 100 sites in England have \"come forward\" to be considered to be a new town.\n\nMost of these are in London, the south or the east.\n\nHousing minister Matthew Pennycook told Sky News: \"There's a huge amount of enthusiasm out there for bringing these new towns forward.\n\n\"But, there will be people in parts of the country that object to any type of development whatsoever, we've got to take those people on.\n\n\"There's a bigger group of people that object to poor quality development without the right infrastructure and amenities in place, so we do have to change the offer across the country. But new towns will be a way we can bring forward that really high quality, well-designed, exemplary development.\"\n\nImage: The government has said it has unblocked 20,000 homes since July\n\nThe government claims it has \"unblocked\" 20,000 houses since entering government last July and plans to unblock another 700,000 homes across 350 sites.\n\nThis will include speeding up the process for building \"tall buildings\" - those of 18 metres or more.\n\nIt is understood this reduction in time will not include relaxing safety regulations, but rather extra resources to make the current steps faster.\n\nGet Sky News on WhatsApp Follow our channel and never miss an update. Tap here to follow\n\nSir Keir said: \"We're urgently using all levers available to build the homes we need so more families can get on the housing ladder. We're sweeping aside the blockers to get houses built, no longer accepting no as the default answer, and paving the way for the next generation of new towns.\n\n\"As part of the largest housebuilding programme since the post-war era, our ambitious Plan for Change will transform the lives of working people, once again connecting the basic principle that if you work hard, you should get on.\"\n\nDeputy Prime Minister and Housing Secretary Angela Rayner said: \"I will not run away from the tough choices to fix the housing crisis we inherited that has left thousands of families on housing waiting lists, allowed homelessness to spiral out of control, and stopped an entire generation from picking up the keys to their first home.\"\n\nSpreaker Spreaker , which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enable Spreaker cookies or to allow those cookies just once. You can change your settings at any time via the This content is provided by, which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enablecookies or to allow those cookies just once. You can change your settings at any time via the Privacy Options Unfortunately we have been unable to verify if you have consented to Spreaker cookies. To view this content you can use the button below to allow Spreaker cookies for this session only. Enable Cookies Allow Cookies Once\n\n👉Listen to Politics At Jack And Sam's on your podcast app👈\n\nThe government also reiterated its plans to overrule local concerns about the environment - exemplified by the bat tunnel near Aylesbury in Buckinghamshire.\n\nSir Keir wrote in The Metro: \"We're changing the bonkers system that stops us building train lines and homes to protect bats and newts.\"",
        "word_count": 772,
        "url": "https://news.sky.com/story/more-than-100-new-towns-being-considered-by-ministers-13308184"
    },
    {
        "title": "Angela Rayner insists 1.5m housing target can be met as extra £350m pledged for affordable homes",
        "author": "Sky Uk Limited",
        "published_date": "Unknown",
        "content": "Angela Rayner has insisted the government can meet its target to build 1.5m homes over the next five years as ministers pledged an extra £350m for housebuilding.\n\nAn extra £300m has been injected to the affordable homes programme, a move ministers believe will allow 2,800 additional homes to be built.\n\nMore than half of these extra homes will be for social rent, the government has said, while more than 250 council homes are expected to be made available through a £50m boost to the local authority housing fund.\n\nThe scale of the challenge is stark, with more than 123,000 households in temporary accommodation - including nearly 160,000 children - while almost 6,000 families with children are in bed and breakfast accommodation.\n\nAsked whether she was worried about whether the government could meet the 1.5m homes target, Ms Rayner said she was \"determined\" to meet the challenge.\n\nPolitics latest: No 10 says it will work with Trump on tariffs\n\n\"We will meet that target because we can't afford not to,\" she told broadcasters.\n\n\"We have 1.3 million people waiting on housing waiting lists, there isn't a person listening to this show that will not know somebody who is desperate to get on the housing ladder.\n\n\"So, therefore, we're determined to turn that tide.\"\n\nAnd pressed on whether the expected 250 increase of council homes was a big enough increase to meet the need, Ms Rayner said: \"We think the measures we're taking will unlock thousands more council and social homes as part of that programme. We want to help councils who want to build those homes.\n\n\"We see 160,000 children in temporary accommodation, and the cost of that on local authorities is significant, as well as the impact on children's life chances,\" she said.\n\n\"So we need to build the homes, and we're doing everything we can to turn the tide of decline and build the houses that people desperately need.\"\n\nPlease use Chrome browser for a more accessible video player 2:36 What are Labour's housing plans?\n\nThe extra £350m promised comes on top of £500m that was earmarked for affordable housing in October's budget.\n\nLocal growth and building safety minister Alex Norris told Sky News local authorities or organisations receiving funding to build houses will have to return that money if they do not fulfil their contract.\n\nThe Local Government Association, which represents councils, welcomed the announcement and said councils \"stand ready to work with the government to increase affordable housing to help people on council housing waiting lists and record numbers stuck in temporary accommodation\".\n\nIt urged the government to \"seize the opportunity\" of the spring spending review to ensure councils have the resources needed to deliver those homes.\n\nAccording to housing charity Shelter, at least 90,000 social rent homes would need to be built each year for the next 10 years to clear most social housing waiting lists in England and to house every homeless household.\n\nA report by MPs last month found that a record number of children are living in B&Bs beyond the legal limit as England's homelessness crisis pushes councils to breaking point.\n\nMPs on the Public Accounts Committee (PAC) said there was a \"dire need\" for housing reform, with the lack of affordable homes forcing cash-strapped local authorities to haemorrhage their funds on temporary accommodation.\n\nA recent Sky News investigation found that children in some parts of England were spending as long as five-and-a-half years on average in temporary accommodation.\n\nThe length of stay has increased significantly in many areas since 2021, with particularly long stays in London and the South East.\n\nGet Sky News on WhatsApp Follow our channel and never miss an update Tap here to follow\n\nRead more:\n\nLabour suspends 11 councillors over WhatsApp scandal\n\nSue Gray takes up seat in House of Lords\n\nElsewhere, ministers are expected to set out plans to crack down on exploitative behaviour by rogue landlords who they say are costing the taxpayer by claiming uncapped housing benefit in return for providing homes that are unsuitable.\n\nLast week the government announced that a law to force social landlords to investigate and fix hazards within a set timescale will be phased in from October.\n\nThe legislation is named after two-year-old Awaab Ishak, who died in December 2020 from a respiratory condition caused by prolonged exposure to mould in the social home his family rented in Rochdale, Greater Manchester.",
        "word_count": 731,
        "url": "https://news.sky.com/story/angela-rayner-insists-1-5m-housing-target-can-be-met-as-extra-350m-pledged-for-affordable-homes-13307405"
    },
    {
        "title": "Idea of grey belt is largely redundant, Lords committee says",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Lords inquiry finds grey belt idea largely redundant\n\n5 February 2025\n\nPA Media\n\nThe government's idea of re-designating areas as \"grey belt\" land in its bid to build more homes is \"largely redundant\", a House of Lords committee has said. Ministers had said that, if a council's housing targets could not be met, some protected land known as green belt would be re-labelled grey belt and thereby freed up for development. However, after conducting an inquiry the committee said it suspected the grey belt concept had been \"eclipsed by more significant changes\" made by the government. A government spokesperson said its changes to the green belt were \"just one of the ambitious housing reforms we have set out to solve the housing crisis and boost economic growth\".\n\nThey added that the measures were \"informed through widespread consultation and will unlock more land for the homes and infrastructure communities desperately need, delivering sustainable, affordable and well-designed developments on low quality grey belt\". Since coming to power in July, the Labour government has said it wants to build 1.5 million homes over the next five years and has identified \"poor quality\" green belt land as possible areas of construction. It pointed to a disused garage in Tottenham, north London, as an example of land that could not be developed because it was deemed to be on a green belt site. Green belts were established more than 70 years ago with five purposes, including restricting the sprawl of urban areas and protecting the countryside. In a letter to Housing Secretary Angela Rayner, chair of the Built Environment Committee Lord Moylan said the green belt had been treated as \"sacrosanct\" making it difficult for local authorities to build on the area, despite a high demand for more homes. He said the idea of a grey belt had initially \"intrigued\" committee members who believed it could \"make a positive contribution\" to meeting housing targets.",
        "word_count": 319,
        "url": "https://www.bbc.com/news/articles/ckg79vj17k2o"
    },
    {
        "title": "6 contech firms raise combined $57M",
        "author": "Matthew Thibault",
        "published_date": "2025-01-22",
        "content": "Listen to the article 6 min This audio is auto-generated. Please let us know if you have feedback\n\nFirms that help builders get materials, remain compliant and communicate on the jobsite were the recipients of recent venture capital funding. Artificial intelligence, in particular, remains a point of interest for contractors as they seek to leverage the technology to gain a competitive edge over their peers.\n\nHere are six construction technology-focused firms that recently raised investor cash.\n\nQbiq\n\n$16 million\n\nTel Aviv, Israel-based architectural planning startup qbiq obtained $16 million in a Series A funding round, the company announced on Jan. 15. The round was led by New York City-based global software investor Insight Partners.\n\nQbiq's software enables non-architects and architect users alike to immediately plan, visualize and optimize a given space, according to the release. With simple inputs that might include seat count or finish material requirements, qbiq says its artificial intelligence engine can generate a complete design package that includes optimized floor plans, 3D visualizations and quantity estimates.\n\nWith the investment, qbic will continue its drive to standardize automated architectural functionality in commercial real estate.\n\nJones\n\n$15 million\n\nNew York City-based insurance verification software firm Jones raised $15 million in a Series B funding round, according to a Jan. 7 news release. Radnor, Pennsylvania-based growth equity firm NewSpring Capital led the round.\n\nJones is an AI-driven vertical software company that helps real estate and construction clients accelerate the collection of insurance certificates, endorsements and policies, per the release. It also helps builders verify compliance and integrates bi-directionally with key enterprise resource planning systems.\n\nWith the investment, the company plans to expand software workflows and deepen ERP integrations. It also plans to release what it calls “a suite of AI-powered agents,” or smart assistants that automate routine tasks, reduce manual workloads and offer autonomous decision-making.\n\nKraaft\n\n$13.5 million\n\nParis-based construction communications firm Kraaft raised 13 million euros ($13.5 million) in a Series A funding round led by London-based investor Dawn Capital, according to EU Startups.\n\nKraaft bills itself as the “WhatsApp of construction,” according to the company’s website. Builders and craftspeople can exchange photos, messages and documents within the platform, and manage plans, permits and work orders.\n\nIn 2025, Kraaft plans to introduce new features, such as planning and time sheets for project management, along with API integrations for large services such as Procore, according to EU Startups.\n\nGovSignals\n\n$5.5 million\n\nWashington, D.C.-based contract acquisition firm GovSignals completed a $5.5 million Seed funding round and launched what it says is the first AI-driven platform to automate the full process of finding and bidding on government contracts, according to Dec. 9 news release. The round was led by Unusual VC, a Menlo Park, California-based venture capital firm.\n\nGovSignals claims to remove much of the time and complexity of government contracting with its AI engine that scans for new opportunities and flags relevant projects for users. The firm says the tool helps companies create compliant proposals — meaning they hit every requirement specified in the RFP — with just a few clicks, completing in minutes tasks a research team would need months to finish.\n\nWith the funding, GovSignals will invest in hiring and product development.\n\nRuck\n\n$5 million\n\nProvo, Utah-based materials marketplace Ruck, which refers to itself as “the DoorDash for construction professionals,” raised $5 million in a Seed funding round, according to a Jan. 4 LinkedIn post from CEO Lee Chang. The round was led by two investment firms — Chicago-based Snak Venture Partners and Miami-based Animo Ventures.\n\nRuck acts as a last-mile marketplace for construction materials based on a builder’s geographic area, according to the company’s website. Builders in Utah, Arizona and Nevada can order through local stores, and Ruck claims its couriers will deliver the items in as fast as two hours.\n\nIn 2025, the company plans to expand its services to Idaho, Colorado and Texas, according to its website.\n\nCodeComply.AI\n\n$2 million\n\nMiami-based compliance startup CodeComply.AI completed a $2 million Seed round led by Winter Park, Florida-based Govo Venture Partners, the investment firm announced on Jan. 15.\n\nThe company uses AI to help architects, contractors, developers and permit expediters submit plans that the firm says are fully compliant with building codes. It also equips public building departments with tools to review plans more swiftly and efficiently, per the release.\n\nCodeComply.AI was co-founded by Patrick Murphy, a former congressman and the CEO of another AI-driven firm — the estimating and takeoff software company Togal.AI.\n\n“By harnessing the power of artificial intelligence, we can eliminate the backlog of construction projects waiting for approvals and accelerate construction to address the housing crisis head-on,” Murphy said in the release.",
        "word_count": 777,
        "url": "https://www.constructiondive.com/news/6-contech-firms-funding-rounds/737991/"
    },
    {
        "title": "The moon's grand canyons were carved in the blink of an eye",
        "author": "Nell Greenfieldboyce",
        "published_date": "2025-02-04",
        "content": "The moon's grand canyons were carved in the blink of an eye\n\ntoggle caption Ernie T. Wright/NASA/SVS\n\nThe Grand Canyon in Arizona got carved by water over millions of years of slow but steady erosion. Two similarly-sized canyons on the moon got carved by flying rocks in about ten minutes.\n\nThat's because these two canyons formed in the wake of an asteroid or comet smashing into the moon, a crash that sent streaks of rocky debris flying at incredible speeds, according to a new analysis in the journal Nature Communications.\n\n\"This was a dramatic impact that was followed by a series of smaller impact events that excavated these canyons in, you know, roughly 10 minutes,\" says David Kring with the USRA Lunar and Planetary Institute in Houston.\n\nSponsor Message\n\n\"That would have been an extraordinary sight to see,\" he adds. \"Not that I would have wanted to be on the lunar surface, but I would have liked to have been a safe distance above the surface to watch all of this unfold.\"\n\nThe two canyons, called Vallis Schrödinger and Vallis Planck, are located on the far side of the moon, so they can only be seen from orbit—not from Earth. Each canyon is over 165 miles long and over 1.5 miles deep.\n\n\"These are extraordinary canyons, but they're hidden, if you will, and kind of mysterious because they're on the far side in the lunar South Pole region,\" says Kring, who has long wondered exactly how they formed.\n\nThe canyons look like remarkably straight lines that extend outward from a circular crater that is the Schrödinger impact basin, the result of a large impact that occurred around 3.8 billion years ago.\n\nTo better understand how this impact basin and its accompanying canyons were created, Kring teamed up with Danielle Kallenborn, who is now a Ph.D. student at Imperial College London, and Gareth Collins, also at Imperial College London. They used images obtained by NASA's Lunar Reconnaissance Orbiter to carefully map the crater, the canyons, and the deposits of ejected rock that rained back down.\n\nSponsor Message\n\nWhen the impactor hit the moon, it was moving at roughly 38,000 miles per hour, says Kring, and would have penetrated to a depth of about 15 miles. As it did, it threw up an asymmetrical pattern of debris, a curtain of rock which plummeted back down to the surface.\n\n\"These canyons were produced by two concentrated streams of rock in that curtain of debris,\" says Kring. \"Those clusters of rock in that curtain hit the lunar surface in just a staccato series of impacts.\"\n\nThese impacts excavated a series of round craters that line up, which means that the canyons were \"produced by a series of small impact events that form a chain,\" he explains.\n\nThe amount of energy needed to produce these grand canyons on the moon is 1200–2200 times larger than \"the nuclear explosion energy once planned to excavate a second Panama Canal on Earth, more than 700 times larger than the total yield of US, USSR, and China's nuclear explosion tests, and about 130 times larger than the energy in the global inventory of nuclear weapons,\" the researchers write in their report.\n\nEven though these particular lunar craters aren't visible from your backyard, Kring says there are similar, but smaller canyons on the near side of the moon that's visible in the night sky. These radiate out from the bright spot that is Tycho Crater.\n\n\"On a clear, clear night, Tycho, which is a little bit below the equator, has beautiful white rays,\" says Kring. \"Those white rays are the same phenomenon, but just at a very small scale compared to Schrödinger.\"",
        "word_count": 612,
        "url": "https://www.npr.org/2025/02/04/nx-s1-5280425/the-moons-grand-canyons-were-carved-in-the-blink-of-an-eye"
    },
    {
        "title": "Intruder Enhances Free Vulnerability Intelligence Platform ‘Intel’ with AI-Generated CVE Descriptions",
        "author": "Unknown",
        "published_date": "2025-02-18",
        "content": "Intel by Intruder now uses AI to contextualize NVD descriptions, helping security teams assess risk faster.\n\nIntruder, a leader in attack surface management, has launched AI-generated descriptions for Common Vulnerabilities and Exposures (CVEs) within its free vulnerability intelligence platform, Intel. This new feature enhances cybersecurity professionals’ ability to quickly understand and assess vulnerabilities, addressing a common pain point: the often vague and technical descriptions provided by the National Vulnerability Database (NVD).\n\nWith thousands of vulnerabilities published every year, security teams rely on NVD as a key resource for researching CVEs. However, NVD descriptions frequently lack clarity or context, making it difficult to determine potential impact at a glance. Intel’s AI summaries transform NVD descriptions into clear, concise, and actionable insights, helping teams assess and respond to risks faster.\n\n“Vulnerability management is challenging enough without the added complexity of deciphering cryptic CVE descriptions,” said Chris Wallis, CEO & Founder of Intruder. “With Intel’s AI Overviews, we’re making it easier for security professionals to quickly gauge what a vulnerability is and decide what action to take.”\n\nAdditionally, Intruder’s in-house security experts manually review the AI descriptions of the most critical vulnerabilities. These expert-reviewed CVEs are clearly marked in Intel with a “Verified by Intruder” label.\n\nIntel, which is completely free to use, already provides powerful features such as a real-time feed of trending CVEs, a unique hype score rated out of 100, and in-depth analysis from Intruder’s security team. The addition of AI-generated CVE descriptions further strengthens Intel’s value as a go-to resource for cybersecurity professionals.\n\nAvailability\n\nThe AI-generated CVE descriptions are available now within Intel at intel.intruder.io. Cybersecurity professionals can access Intel for free today.\n\nFor more information, users visit www.intruder.io or follow Intruder on LinkedIn and Twitter.\n\nAbout Intruder\n\nIntruder was founded in 2015 to solve the information overload crisis in vulnerability management. Its mission from day one has been to help divide the needles from the haystack, focusing on what matters, while ignoring the rest. Effective cyber security is about getting the basics right. Intruder helps do that, saving time on the easy stuff, so users can focus on the rest. It has been awarded multiple accolades, was selected for GCHQ’s Cyber Accelerator, and is now proud to have over 3,000 happy customers all over the world.",
        "word_count": 378,
        "url": "https://www.nextbigfuture.com/2025/02/intruder-enhances-free-vulnerability-intelligence-platform-intel-with-ai-generated-cve-descriptions.html"
    },
    {
        "title": "Intruder Enhances Free Vulnerability Intelligence Platform ‘Intel’ with AI-Generated CVE Descriptions",
        "author": "Unknown",
        "published_date": "2025-02-18",
        "content": "Intel by Intruder now uses AI to contextualize NVD descriptions, helping security teams assess risk faster.\n\nIntruder, a leader in attack surface management, has launched AI-generated descriptions for Common Vulnerabilities and Exposures (CVEs) within its free vulnerability intelligence platform, Intel. This new feature enhances cybersecurity professionals’ ability to quickly understand and assess vulnerabilities, addressing a common pain point: the often vague and technical descriptions provided by the National Vulnerability Database (NVD).\n\nWith thousands of vulnerabilities published every year, security teams rely on NVD as a key resource for researching CVEs. However, NVD descriptions frequently lack clarity or context, making it difficult to determine potential impact at a glance. Intel’s AI summaries transform NVD descriptions into clear, concise, and actionable insights, helping teams assess and respond to risks faster.\n\n“Vulnerability management is challenging enough without the added complexity of deciphering cryptic CVE descriptions,” said Chris Wallis, CEO & Founder of Intruder. “With Intel’s AI Overviews, we’re making it easier for security professionals to quickly gauge what a vulnerability is and decide what action to take.”\n\nAdditionally, Intruder’s in-house security experts manually review the AI descriptions of the most critical vulnerabilities. These expert-reviewed CVEs are clearly marked in Intel with a “Verified by Intruder” label.\n\nIntel, which is completely free to use, already provides powerful features such as a real-time feed of trending CVEs, a unique hype score rated out of 100, and in-depth analysis from Intruder’s security team. The addition of AI-generated CVE descriptions further strengthens Intel’s value as a go-to resource for cybersecurity professionals.\n\nAvailability\n\nThe AI-generated CVE descriptions are available now within Intel at intel.intruder.io. Cybersecurity professionals can access Intel for free today.\n\nFor more information, users visit www.intruder.io or follow Intruder on LinkedIn and Twitter.\n\nAbout Intruder\n\nIntruder was founded in 2015 to solve the information overload crisis in vulnerability management. Its mission from day one has been to help divide the needles from the haystack, focusing on what matters, while ignoring the rest. Effective cyber security is about getting the basics right. Intruder helps do that, saving time on the easy stuff, so users can focus on the rest. It has been awarded multiple accolades, was selected for GCHQ’s Cyber Accelerator, and is now proud to have over 3,000 happy customers all over the world.",
        "word_count": 378,
        "url": "https://hackread.com/intruder-enhances-free-vulnerability-intelligence-platform-intel-with-ai-generated-cve-descriptions/"
    },
    {
        "title": "Intruder Enhances Free Vulnerability Intelligence Platform ‘Intel’ with AI-Generated CVE Descriptions",
        "author": "Mitch Ashley, Sulagna Saha, Gabriel Martinez, Root, --Ppa-Color-Scheme, --Ppa-Color-Scheme-Active",
        "published_date": "2025-02-18",
        "content": "Intel by Intruder now uses AI to contextualize NVD descriptions, helping security teams assess risk faster.\n\nIntruder, a leader in attack surface management, has launched AI-generated descriptions for Common Vulnerabilities and Exposures (CVEs) within its free vulnerability intelligence platform, Intel. This new feature enhances cybersecurity professionals’ ability to quickly understand and assess vulnerabilities, addressing a common pain point: the often vague and technical descriptions provided by the National Vulnerability Database (NVD).\n\nWith thousands of vulnerabilities published every year, security teams rely on NVD as a key resource for researching CVEs. However, NVD descriptions frequently lack clarity or context, making it difficult to determine potential impact at a glance. Intel’s AI summaries transform NVD descriptions into clear, concise, and actionable insights, helping teams assess and respond to risks faster.\n\n“Vulnerability management is challenging enough without the added complexity of deciphering cryptic CVE descriptions,” said Chris Wallis, CEO & Founder of Intruder. “With Intel’s AI Overviews, we’re making it easier for security professionals to quickly gauge what a vulnerability is and decide what action to take.”\n\nAdditionally, Intruder’s in-house security experts manually review the AI descriptions of the most critical vulnerabilities. These expert-reviewed CVEs are clearly marked in Intel with a “Verified by Intruder” label.\n\nIntel, which is completely free to use, already provides powerful features such as a real-time feed of trending CVEs, a unique hype score rated out of 100, and in-depth analysis from Intruder’s security team. The addition of AI-generated CVE descriptions further strengthens Intel’s value as a go-to resource for cybersecurity professionals.\n\nAvailability\n\nThe AI-generated CVE descriptions are available now within Intel at intel.intruder.io. Cybersecurity professionals can access Intel for free today.\n\nFor more information, users visit www.intruder.io or follow Intruder on LinkedIn and Twitter.\n\nAbout Intruder\n\nIntruder was founded in 2015 to solve the information overload crisis in vulnerability management. Its mission from day one has been to help divide the needles from the haystack, focusing on what matters, while ignoring the rest. Effective cyber security is about getting the basics right. Intruder helps do that, saving time on the easy stuff, so users can focus on the rest. It has been awarded multiple accolades, was selected for GCHQ’s Cyber Accelerator, and is now proud to have over 3,000 happy customers all over the world.",
        "word_count": 378,
        "url": "https://devops.com/intruder-enhances-free-vulnerability-intelligence-platform-intel-with-ai-generated-cve-descriptions/"
    },
    {
        "title": "Crystal Palace vs. Everton prediction, Premier League odds, time: Feb. 15, 2025 picks, bets by proven expert",
        "author": "Cbs Sports Staff, Min Read, James Benge, Sandra Herrera, Pardeep Cattry, Francesco Porzio, Chuck Booth, Roger Gonzalez",
        "published_date": "Unknown",
        "content": "Everton will try to keep their hot streak going when they visit Crystal Palace for a Premier League bout on Saturday. The Toffees have gotten a boost since new manager David Moyes took the reigns, and they should be full of confidence after holding Liverpool to a 2-2 draw their last time out. Meanwhile, the Eagles are three points ahead of Everton in the EPL table and have won three of their last four matches in EPL play.\n\nKickoff from Selhurst Park in London is set for 12:30 p.m. ET. The hosts are -115 favorites (risk $115 to win $100) in the latest Crystal Palace vs. Everton odds, while Everton are +360 underdogs. A 90-minute draw is priced at +220 and the over/under for goals is 2.5. Before locking in any Crystal Palace vs. Everton picks or Premier League predictions, you need to see what proven SportsLine betting expert Jon Eimer has to say.\n\nEimer is a high-volume bettor who has vast knowledge of leagues and players across the globe. Since joining SportsLine, he has covered the English Premier League, Serie A, the FA Cup and much more. The Indiana-based handicapper compiled a winning record of 260-133-1 with over 90 units of profit for his community on various platforms over a recent two-month stretch. Anyone following could have seen big returns.\n\nNow, Eimer has broken down Crystal Palace vs. Everton from every angle and has locked in his picks and predictions. You can head to SportsLine now to see Eimer's picks. Here are the betting lines for Crystal Palace vs. Everton:\n\nCrystal Palace vs. Everton 90-minute money line: Crystal Palace -115, Everton +360, Draw +220\n\nCrystal Palace vs. Everton over/under: 2.5\n\nCrystal Palace vs. Everton picks: See picks here\n\nWhy you should back Crystal Palace\n\nThe Eagles have won five of their last six matches overall, and they have only lost twice in their last eight league games. They have played well against tough competition, and recently managed draws against Bournemouth and Chelsea. Crystal Palace have also only been clean-sheeted once since a 2-0 loss to Fulham on Nov. 9, so they should be confident in finding the back of the net.\n\nThe defense has also stepped up for Crystal Palace. They have record five clean sheets from six matches across all competition, including back-to-back shutout wins heading into Saturday's match. Crystal Palace are still looking for their first home win of the calendar year, but showed they can hold off tough competition in a 1-1 draw against Chelsea. See which team to pick here.\n\nWhy you should back Everton\n\nEverton are unbeaten in four straight, notching wins against Leicester City, Brighton and Tottenham. They are coming off of their most impressive performance, however, holding off first-place Liverpool. The Reds controlled 64% possession and managed four shots on target to Everton's three, but even a go-ahead goal by Mohamed Salah in the 73rd minute wasn't enough as James Tarkowski scored the equalizer in stoppage time. That effort should propel Everton as they hit the road to face Crystal Palace.\n\nThe Toffees have also dominated this head-to-head series in recent years. They are unbeaten in their last eight matches across all competition and have won four of six domestic meetings. See which team to pick here.\n\nHow to make Everton vs. Crystal Palace picks\n\nEimer has broken down Crystal Palace vs. Everton from every possible angle and revealed two confident best bets. He's sharing his Premier League picks and analysis only at SportsLine.\n\nWhat is the best bet for Everton vs. Crystal Palace on Saturday, and where does all the betting value lie? Visit SportsLine now to see which wagers have all the value, all from the proven soccer expert who has his finger on the pulse of the game all over the world, and find out.\n\nHow to get in-depth soccer coverage daily\n\nThe CBS Sports Golazo Network has you covered with soccer news, highlights, analysis, and exclusive games. The 24-hour digital network provides around-the-clock soccer viewing to fans across the country, including morning shows and live matches. It launched in April and has been a smashing success thus far, expanding its offerings every week. Watch the CBS Sports Golazo Network now here.\n\nThe CBS Sports Golazo Network provides soccer fans with wall-to-wall coverage of the most popular game in the world. Check it out now on CBSSports.com, the CBS Sports app for connected TV devices, the CBS Sports mobile app, Pluto TV or Paramount+.",
        "word_count": 745,
        "url": "https://www.cbssports.com/soccer/news/crystal-palace-vs-everton-prediction-premier-league-odds-time-feb-15-2025-picks-bets-by-proven-expert/"
    },
    {
        "title": "Enjoy the Benefits of Using an SEO Agency that Uses AI",
        "author": "Sean Mallon",
        "published_date": "Unknown",
        "content": "Artificial intelligence (AI) is changing the way businesses approach search engine optimization, improving the capacity to search through trends, optimize copy, and rank. AI is becoming more influential on content creation as one of its main areas of impact, allowing businesses to develop high-quality, targeted content that mirrors the purpose of searching. Up to 35% of organizations are currently leveraging AI to develop SEO-centric content strategies, whereby they write more compelling and relevant articles. Further, AI tools assist in keyword research, topic clustering, and competitor analysis, keeping businesses ahead of the curve in a fast-paced competitive online world. With evolving search algorithms, AI-based tools enable marketers to be agile, refining their content for both search engines and user behavior.\n\nAside from content marketing strategy, AI is transforming on-page SEO by automatizing processes such as meta tag optimization, internal linking, and structured data implementation. As per recent reports, 52% of SEO experts have shown performance gains due to the application of AI in on-page optimization. AI-powered analytics tools also offer in-depth insights into how users behave, enabling companies to optimize their site structure and boost engagement. With the increasing impact of AI, 82% of enterprise-level SEO experts are going to spend more on such technologies, understanding their ability to drive digital marketing efforts. The AI marketing industry is developing at a rapid rate, and its market value is projected to increase from $41 billion in 2023 to over $220 billion by 2030, indicating the increasing reliance on AI for successful digital marketing.\n\nHiring an SEO agency based in the UK gives you a strong advantage. Search engines rank websites based on relevance, authority, and user engagement. A local digital marketing agency understands what people in the UK search for and how to make your website match their expectations.\n\nGood SEO isn’t just about ranking high. It’s about bringing the right visitors to your site and turning them into customers. A UK-based digital marketing agency knows how people here browse, shop, and make decisions online. Instead of using generic strategies, they create content and campaigns that connect with your audience. In this article, we will go over several reasons to hire a UK based digital marketing agency.\n\n1 – In-Depth knowledge of the UK market\n\nA UK-based SEO agency understands the market better than one from another country. Shopping habits, search trends, and customer behavior are different in every place. A local team knows what people in the UK search for, the words they use, and what makes them choose one business over another.\n\nSearch engines rank websites based on relevance. If your site matches what UK customers expect, it will perform better. A local agency knows which keywords matter most and how to use them effectively. They also understand regional differences. Someone in London may search differently than someone in Manchester. A UK agency can adjust strategies to reach people in different areas more effectively.\n\nBeyond keywords, local agencies know what UK customers like. The way people browse, respond to offers, and interact with websites varies by region. A UK-focused strategy makes sure your content speaks to your audience in a way that feels right.\n\n2 – Better understanding of local competitors\n\nKnowing what your competitors are doing helps you stay ahead. A UK-based SEO agency understands who you’re competing with and what it takes to stand out. They look at what similar businesses are doing well and where they are weak. This information helps shape strategies that give you an advantage.\n\nWinning in search results isn’t just about ranking higher. It’s about bringing in the right visitors who are likely to buy from you. A UK agency understands what customers in this market look for. They study competitor pricing, promotions, and content to find ways for your business to do better.\n\n3 – Local partnerships\n\nWorking with the right people can help your business grow online. A UK-based SEO agency has connections with local media, bloggers, and influencers who can promote your brand. These relationships can lead to links from trusted UK websites, which improve your search rankings and bring more visitors to your site.\n\nBeing part of the UK business community also helps with local directories and events. A UK agency knows which directories are the most useful and how to get your business listed where customers will find you. They can also help you get mentioned in news articles and blogs that reach your audience. This kind of exposure builds trust and attracts more customers.",
        "word_count": 747,
        "url": "https://www.smartdatacollective.com/enjoy-the-benefits-of-using-an-seo-agency-that-uses-ai/"
    },
    {
        "title": "HVS Opens New Office in Israel Under Leadership of Ronit Copeland",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "HVS, the leading independent global hospitality consultancy firm, has announced the opening of its Israeli office, marking a significant expansion of its global presence in the Europe and Middle East region. Located in Tel Aviv, this new office reflects HVS’s commitment to supporting clients in one of the world’s fastest-growing hospitality markets. Led by Ronit Copeland, a renowned international hospitality expert with extensive experience across Israel, Europe, and the USA, HVS Tel Aviv will deliver world-class international expertise tailored to the needs of the local market.\n\nOffering a full range of consultancy services – including feasibility studies, valuations, market and financial analysis, asset management, global brand and operator searches, and strategic advisory – the Tel Aviv office will serve investors, developers and operators seeking to capitalise on Israel’s dynamic market opportunities.\n\n‘An HVS presence in Tel-Aviv is now critical,’ according to Russell Kett, Chairman of the HVS London Office. ‘In the last 30 years, the London office has conducted many assignments in Israel, providing a significant platform for the establishment of a stand-alone, independent office.’\n\nThe expansion to Tel Aviv comes at a pivotal time for the region. The nation is increasingly recognised as a hub for hospitality and tourism innovation, with landmark developments and infrastructure projects underway. Backed by Ronit Copeland’s strong market reputation in Israel and her track record across Europe and the USA, the new office will support initiatives, leveraging HVS’s celebrated international expertise and reputation for delivering actionable, market-driven solutions.\n\n‘The establishment of HVS Tel Aviv marks a significant milestone in our global growth strategy,’ said Steve Mendell, Founder and Executive Chairman of HVS in Europe, Middle East and Asia. ‘Israel’s dynamic drive for innovation creates a unique opportunity, and we are excited to work in such a vibrant real estate and hospitality landscape, supporting investors and entrepreneurs with our proven expertise and in-depth, local market insights.’\n\nLeveraging its network, know-how and multicultural mindset, HVS Tel Aviv will also support clients with projects across the globe, relying on its local market intelligence to create ground-breaking enterprises.\n\nManaging partner and CEO Ronit Copeland added, ‘As a long-time collaborator with HVS, it is an honour to lead the Israeli office and contribute to the firm’s global expansion. The creative sensitivity, perseverance, and unwavering desire among entrepreneurs to create measurable value is something unique to the southern Mediterranean region, and the opening of HVS Tel Aviv recognises these traits as an outstanding asset with the potential to uplift the entire region in the longer term. I am confident that our presence here will provide invaluable support to stakeholders navigating this exciting and evolving market.’\n\nFor more information about HVS Tel Aviv and its services, visit hvs.com or contact Ronit Copeland, Managing Partner at HVS Tel Aviv.\n\nRonit Copeland\n\nManaging Partner\n\n+972 52 247 1253\n\nHVS",
        "word_count": 466,
        "url": "https://www.hospitalitynet.org/news/4125633.html"
    },
    {
        "title": "A Good House: 'biting' South African satire",
        "author": "Irenie Forshaw, The Week Uk, Justin Klawans, The Week Us, Rafi Schwartz, David Faris, Catherine Garcia, Social Links Navigation",
        "published_date": "2025-01-23",
        "content": "\"In the wrong hands\", Amy Jephta's new play could have become a \"very conventional critique\" of South Africa's deeply divided society, said Clive Davis in The Times. Yet this \"quirky\" satire \"sends you home with awkward questions buzzing around in your head\".\n\nUnsurprisingly, race lies at the heart of the domestic drama, but the \"mischievous\" production also \"homes in on subtle questions of class and money\", too. The story follows Bonolo (Mimî M Khayisa) and Sihle (Sifiso Mazibuko), a Black middle-class couple who have recently moved to a \"manicured suburb\" in South Africa.\n\nWhen an unsightly tin shack appears on a nearby plot of land, \"threatening to bring down property values\", white residents Lynette (Olivia Darnley) and Christopher (Scott Sparrow) \"brazenly\" recruit Bonolo and Sihle to a neighbourhood group tasked with getting rid of it.\n\nSubscribe to The Week Escape your echo chamber. Get the facts behind the news, plus analysis from multiple perspectives. SUBSCRIBE & SAVE Sign up for The Week's Free Newsletters From our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox. From our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox. Sign up\n\nThe affluent residents' \"paranoid assumptions\" about who built the shack \"soon expose deep-rooted prejudices in this biting, subversive satire\", said Dave Fargnoli in The Stage. Director Nancy Medina \"allows the conflict to escalate\" slowly, with conversations gradually unfurling into \"rapid-fire shouting matches\". This results in excellent \"comic timing\" as the neighbours \"twist themselves into exquisitely awkward knots\" in an attempt to conceal their \"toxic entitlement\".\n\nJephta's \"richly drawn characters\" are \"intriguingly flawed\". Khayisa puts on a \"gripping\" performance as the \"fabulously frosty\" and \"pretentious\" Bonolo, who is always poised to \"confront her neighbours over any perceived prejudice she detects\". As her husband Sihle, Mazibuko starts off \"calm and contented\", but the white community's \"ignorant judgements\" about the shack \"soon prove too provoking, igniting eruptive anger\". And Darnley is \"brilliantly subtle\" as Lynette, \"projecting guileless sweetness\" that belies a \"secret depth of manipulative malice\".\n\nBut the \"jarring breakouts of didacticism\", where the characters spell out what is apparent in the \"loaded exchanges between couples\", are unnecessary, said Arifa Akbar in The Guardian. Still, the arguments between Bonolo and Sihle feel \"real and complex\", and the \"layers\" to their questioning of \"what it means to belong\" give the play its \"depth\".\n\nJephta \"mercilessly skewers\" middle-class prejudices and \"latent racist white fears\" with \"panache\", added Lindsay Johns in The Telegraph. Her script \"bristles with acutely observed racial and social tensions\", painting a \"bleak\" picture of a \"Rainbow Nation ill at ease with itself\". In all, it's a \"morally nuanced, exhilarating and deeply humane work\" that marks Jephta as one of South Africa's \"leading contemporary playwrights\".\n\nAt the Royal Court Theatre, London, until 8 February, then at Bristol Old Vic from 14 February to 8 March",
        "word_count": 492,
        "url": "https://theweek.com/culture-life/theatre/a-good-house-biting-south-african-satire"
    },
    {
        "title": "MPs call for crackdown on booing and jeering in Commons",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "MPs call for end to booing and jeering in Commons\n\n13 February 2025 Sam Francis Political reporter\n\nHouse of Commons/Reuters\n\nParliament should crack down on booing and jeering in the House of Commons to make debates more accessible, a committee of MPs has suggested. \"Antiquated\" jargon and gendered job titles like \"chairman\" should also be scrapped to make politics more inclusive to new MPs, the women and equalities committees told a parliamentary inquiry. The suggestions were made to a cross-party committee looking into ways to modernise working practices in the Commons. The panel, which has also been tasked with reviewing MPs' second job rules and codes of conduct, will meet next week ahead of setting out its priorities.\n\nLoud heckling and shouts of \"resign\" are a common occurrence in heated debates in the Commons, most notably during the weekly war of words at Prime Minister's Questions (PMQs). Over the years there have been repeated attempts to curb boisterous behaviour and present a more grown-up, mature debate to the world. Former Tory prime minister David Cameron once said he wanted to bring an end to the \"Punch and Judy\" show of PMQs, but later admitted it was a vain hope.\n\nThe Commons modernisation committee, chaired by Commons leader Lucy Powell, is currently considering evidence submitted by MPs and campaign groups on how to reform Parliament. On Thursday, it published a tranche of evidence it has received - including calls for \"reasonable limits\" on money earned by MPs through second jobs and a reduction in government control over what gets debated. In its submission, the women and equalities committee, chaired by Labour MP Sarah Owen, said heckling by MPs \"must be addressed\". \"Booing and jeering does not belong in any workplace yet alone one that is subject to public scrutiny, and which should be setting an example for others,\" it said. It added that \"antiquated\" language used in parliamentary debates was \"not inclusive to new members [of Parliament] and prevents our constituents from understanding what is happening\".\n\nHotel costs\n\nLanguage used in the Commons must be \"modernised to become gender neutral\" with terms like chairman replaced with \"chair\" as a first step, the committee said. They also urged Parliament to stop referring to parliamentary staff costs as \"expenses,\" warning it confuses the public and fuels abuse of MPs. Support for MPs with children should also be improved, they suggested, including by increasing MPs' hotel budgets \"on occasions when dependants need to stay with them in London\". MPs with constituencies outside of London get reimbursements for hotel stays, rentals, during parliamentary work - or costs tied to funding homes they own in the capital. Among other ideas received by the modernisation committee is a plan to require MPs to submit to in-depth background checks by the Disclosure and Barring Service (DBS), suggested by Labour MP Jo White last year. The Committee on Standards in Public Life (CSPL) has called for \"reasonable limits\" on MPs' second jobs to ensure they focus on Parliament, and improved disclosure of outside earnings. The Hansard Society, which aims to promote parliamentary democracy, called for backbench MPs to have greater control over what is debated and give the Speaker the power to summon MPs back during recesses in emergencies.",
        "word_count": 540,
        "url": "https://www.bbc.com/news/articles/ckgyleldl27o"
    },
    {
        "title": "SportBusiness: Sponsorship Works Award to Capgemini for Ryder Cup partnership",
        "author": "Unknown",
        "published_date": "2025-02-05",
        "content": "LONDON, Feb. 05, 2025 (GLOBE NEWSWIRE) -- The award aims to recognise the most creative and impactful sponsorship activations in the international sports landscape\n\nCapgemini’s sponsorship campaign for the latest edition of the Ryder Cup has won the inaugural Sponsorship Works Award from SportBusiness . Capgemini is a global partner of the Ryder Cup until 2027. ‘Outcome IQ’, part of the company’s innovative technology-based sponsorship activation at the most prestigious team golf tournament, was selected through a public vote among three finalists.\n\nThe customised tool, which combines artificial intelligence (AI) with in-depth knowledge of the game, provided a comprehensive analysis of play, enabling fans to review past player performances and predict how different team pairings might play out during the actual competition. SportBusiness launched the Sponsorship Works Award last year to recognise the most creative and innovative sponsorship activations in the global sports industry.\n\nSponsorship Works Award: A prize for innovation\n\nCapgemini’s campaign outperformed strong competition from a targeted Paddy Power campaign at the World Darts Championship and an initiative by Orange France and Havas Play at the Paris 2024 Olympics . Capgemini was supported by the agency rEvolution, as well as internal partnership and technology teams from the Ryder Cup, in launching ‘Outcome IQ’.\n\nThe SportBusiness Sponsorship editorial team and event partner SponsorLab selected the top three activations based on criteria such as ‘creativity and innovation’ and ‘performance against results,’ while also considering other, less tangible qualities. SponsorLab is an online performance management platform designed to help brands, agencies and rights holders establish more effective partnerships.\n\nA model example of technological integration in sport\n\nThe company’s founder and CEO, Bruce Cook, shared his critical perspective on the winner, seeing it as a highly successful example of technological integration. “It’s really difficult to create a new piece of tech that isn’t just a gimmick but is meaningful for both the fans and the media, especially with something like the Ryder Cup where all the focus is on the red and blue scores,” he said.\n\nHe then added: “Capgemini’s AI-powered ‘Outcome IQ’ probability graphics featured 41 times in the broadcast coverage and only had a contractual obligation for 15 times. That says it really enhanced the broadcasts while achieving a huge reach in terms of media exposure. Their external PR and digital content also proved incredibly effective alongside a strong staff engagement programme. A very comprehensive campaign,” he added.\n\nThe judging panel shortlisted candidates from 27 different case studies published by SportBusiness Sponsorship in 2024. These case studies provided a detailed analysis of the planning, execution and results of some of the most innovative campaigns delivered by agencies and rights holders across the industry.\n\nThe future of Sponsorship Works\n\nSportBusiness Sponsorship is already publishing case studies for consideration for the 2025 Sponsorship Works Award.\n\nFor more information:\n\nPress Office LaPresse - ufficio.stampa@lapresse.it\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/b2da3dc1-6ec5-42a5-95b8-e7601ed5a19c",
        "word_count": 480,
        "url": "https://www.globenewswire.com/news-release/2025/02/05/3021474/0/en/SportBusiness-Sponsorship-Works-Award-to-Capgemini-for-Ryder-Cup-partnership.html"
    },
    {
        "title": "Government axes Lord Walney's political violence adviser role",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Government axes political violence adviser role\n\n8 days ago Becky Morton Political reporter\n\nLord Walney\n\nLord Walney has called for more action to protect the public from \"the menace of extreme protestors\", after his role as the government's independent adviser on political violence was scrapped. Under the previous Conservative government, the crossbench peer recommended extra powers for police to tackle demonstrations outside Parliament and for protests groups such as Palestine Action and Just Stop Oil to be banned. The Home Office said Lord Walney's work would \"continue to inform our approach\". His previous responsibilities will now be part of the commissioner for countering extremism's remit.\n\nLord Walney - the former Labour MP John Woodcock - was given the job under Conservative Prime Minister Boris Johnson in 2020. In a post on X confirming he was leaving the role, Lord Walney wrote: \"At a time of increasing threats and intimidation, we must do more to protect our democracy and its MPs from organised coercion, and the public from the menace of extreme protestors. \"I will continue to contribute to this vital debate and hope ministers will show in the coming months that they understand the depth of the public's contempt for activists who unlawfully disrupt their lives and cause criminal damage to get their way. \"In particular, the combined toll of the weekly Gaza marches shows that the balance is not currently set right.\" He added that the upcoming Crime and Policing Bill was an opportunity to \"give police forces greater ability to balance the right to protest with the cumulative harm that weekly demonstrations can cause to communities and the huge drain on police resources at a time they are already overstretched\".\n\nThe government is recruiting for a new commissioner for countering extremism. The role is currently held by Robin Simcox, who is due to finish his three-year term in July. Last year he warned London had become a \"no-go zone for Jews\" during weekend pro-Palestinian marches. The comments were condemned by protest groups, who insisted they were unfounded and pointed out members of the Jewish community also attended pro-Gaza rallies. A Home Office spokesperson said: \"We want to thank Lord Walney for his dedicated work as independent advisor and his vital contribution to the UK government's understanding of political violence and disruption. \"His work will continue to inform our approach as we move forward to assess the complex challenges facing our country.\" Lord Walney, a long-time critic of Jeremy Corbyn, left the Labour Party under his leadership, saying the party had been \"taken over by the hard left\" and \"tolerated\" antisemitism. From 2010 to 2019 he served as MP for Barrow and Furness, and he joined the House of Lords in 2020.",
        "word_count": 453,
        "url": "https://www.bbc.com/news/articles/cx2pddvwgg8o"
    },
    {
        "title": "YunoJuno Releases 2025 Freelancer Rates Report: AI Skills Drive Shift in Contingent Workforce Market as Average Day Rates Rise",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "LONDON, Feb. 6, 2025 /PRNewswire/ -- YunoJuno , the leading contingent workforce management platform connecting businesses with freelancers and contractors, this week released its comprehensive 2025 Freelancer Rates Report, revealing key insights into the evolving freelance market. The report, based on YunoJuno's proprietary data and analysis of 261,000+ freelance contracts, shows a 3% year-on-year increase in average day rates, reaching £390 per day (£49 per hour).\n\nShowcasing a new skills analysis component for 2025, the report identifies the top 10 most frequently booked skills across 15 core disciplines, alongside the top 3 skills with the most significant positive impact on day rates. Notably, the analysis revealed standout high-paid skills such as UX design, Machine learning and Art direction among the creative and technology disciplines, demonstrating how skill specialisations can substantially enhance a freelancer's market value.\n\nOther key findings within the report include:\n\nStrategy professionals command the highest rates at £520 per day, followed by Market Research (£491) and Data (£469)\n\nTop 10% of freelancers across industries earn approximately £708 per day (£89 per hour), marking a 9% increase from the previous year\n\nAverage contract length decreased slightly to 23 working days\n\nThe report commentary highlights a paradoxical labour market situation where companies face simultaneous hiring freezes and critical skills shortages, with further pressure being added from technology's pace of change, particularly around accelerating AI advancements. This has led to an increased reliance on freelance talent as a strategic resource for maintaining business adaptability, agility and competitive advantage.\n\nCEO at YunoJuno, Runar Reistrup says \"we find ourselves at a fascinating point in both the labour and contractor markets. While companies face hiring freezes and actively look to reduce headcount, these same companies are facing skills shortages that will have a major impact on business performance if left unsolved.\"\n\n\"We are seeing more and more freelancers with strong AI skills coming to the market, having spent the last 1-2 years training and experimenting to become well-versed in AI's capabilities. With companies having little visibility around AI's long-term business impact, leveraging on-demand flexible talent is certainly the way forward.\"\n\nThe report also notes that freelancer availability reached an all-time high in the previous year before showing gradual recovery in Q4, indicating market resilience despite economic pressures. Day rates have stabilised despite an inflationary environment, reflecting the adaptive nature of the current market and supporting YunoJuno's belief that freelancers are not only \"masters of change\" but one of the most resilient parts of the global workforce.\n\nYunoJuno recognises the immense contribution contractors and freelancers make to companies and projects worldwide and remains committed to supporting the freelance community by providing transparent and up-to-date information on market trends. The 2025 Freelancer Rates Report is available to view or download from the YunoJuno website and is free for those interested in gaining deeper insights into the contingent workforce landscape.\n\nAbout YunoJuno:\n\nYunoJuno is the only system businesses need to find, hire, manage and pay contractors and freelancers globally. Built as an all-in-one Freelancer Management System with direct sourcing included and plug-in options, YunoJuno takes the work and risk out of working with contractors.\n\nCombining a Freelance Management System with an elite marketplace of 100,000+ industry vetted contractors and an on-hand delivery team, YunoJuno helps reduce costs, hiring times and protect against misclassification. With integrated tools, automation and insights, businesses can now accurately classify workers quickly, compliantly and on a global scale.\n\nwww.yunojuno.com\n\nData for the 2025 report:\n\nThe data from this report is drawn from approximately 261,000+ freelance records on the YunoJuno platform from the full calendar years from 2022 – 2024. The data set includes data for bookings, applications and approvals in order to give the report additional depth and insight into all of our freelancers. All charts contain all records, apart from booking related charts that only contain booking data.\n\nAll client and freelancer comments and quotes are from active participants within the YunoJuno network.",
        "word_count": 651,
        "url": "https://www.prnewswire.co.uk/news-releases/yunojuno-releases-2025-freelancer-rates-report-ai-skills-drive-shift-in-contingent-workforce-market-as-average-day-rates-rise-302370484.html"
    }
]