[
    {
        "title": "National Early Warning Score (NEWS) 2",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "How NEWS works\n\nThe NEWS is based on a simple aggregate scoring system in which a score is allocated to physiological measurements, already recorded in routine practice, when patients present to, or are being monitored in hospital. Six simple physiological parameters form the basis of the scoring system:\n\nrespiration rate oxygen saturation systolic blood pressure pulse rate level of consciousness or new confusion* temperature.\n\n*The patient has new-onset confusion, disorientation and/or agitation, where previously their mental state was normal – this may be subtle. The patient may respond to questions coherently, but there is some confusion, disorientation and/or agitation. This would score 3 or 4 on the GCS (rather than the normal 5 for verbal response), and scores 3 on the NEWS system.\n\nA score is allocated to each parameter as they are measured, with the magnitude of the score reflecting how extremely the parameter varies from the norm. The score is then aggregated and uplifted by 2 points for people requiring supplemental oxygen to maintain their recommended oxygen saturation.\n\nThis is a pragmatic approach, with a key emphasis on system-wide standardisation and the use of physiological parameters that are already routinely measured in NHS hospitals and in prehospital care, recorded on a standardised clinical chart – the NEWS2 chart.\n\nNEWS2 has continued to be evaluated in acute care setting as demonstrated in these papers:\n\nThe performance of the National Early Warning Score and National Early Warning Score 2 in hospitalised patients infected by the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) - PubMed (nih.gov)\n\nThe early use of sepsis scores to predict respiratory failure and mortality in non-ICU patients with COVID-19 - ScienceDirect.\n\nNEWS2 has received formal endorsement from NHS England and NHS Improvement to become the early warning system for identifying acutely ill patients – including those with sepsis – in hospitals in England.\n\nThe NEWS2 Report\n\nSupplementary guidance to support implementation of NEWS 2\n\nThe RCP has also produced supplementary guidance to support implementation of NEWS2. Advice is given in five categories – new confusion, escalation/response guidance, oxygen scales, receiving acute patients into hospital, and what to do when the NEWS2 scores are incomplete.\n\nAn example of a structured document of clinical response to deterioration can be found here.\n\nNEWS2 and deterioration in COVID-19\n\nThis guidance emphasises the place of NEWS2 in managing patients with COVID-19.\n\nNEWS2 should be used when managing patients with COVID 19. The use of NEWS2 will ensure that patients who are deteriorating, or at risk of deteriorating, will have a timely initial assessment by a competent clinical decision maker. NEWS2 should supplement clinical judgement in assessing the patient’s condition.\n\nThe NEWS2 scoring system for oxygen supplementation is binary (yes/no). In patients with COVID-19 infection, once hospitalised and treated with oxygen, their oxygen requirement might increase rapidly if their respiratory function deteriorates but this may not result in any additional significant increase in the NEWS2 score. Therefore, in patients with COVID 19, all staff should be aware that ANY increase in oxygen requirements should trigger an escalation call to a competent clinical decision maker. This should be accompanied by an initial increase in observations to at least hourly until a clinical review happens, if this has not already happened as a result of NEWS2.\n\nUse of NEWS2 across the acute care pathway\n\nNEWS2 is increasingly used across the acute care pathway and this is demonstrated in the video below which tells Paul's story - an example of NEWS enabling swift and effective treatment.",
        "word_count": 580,
        "url": "https://www.rcp.ac.uk/improving-care/resources/national-early-warning-score-news-2/",
        "source": "www.rcp.ac.uk"
    },
    {
        "title": "National Early Warning Score (NEWS) 2",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "How NEWS works\n\nThe NEWS is based on a simple aggregate scoring system in which a score is allocated to physiological measurements, already recorded in routine practice, when patients present to, or are being monitored in hospital. Six simple physiological parameters form the basis of the scoring system:\n\nrespiration rate oxygen saturation systolic blood pressure pulse rate level of consciousness or new confusion* temperature.\n\n*The patient has new-onset confusion, disorientation and/or agitation, where previously their mental state was normal – this may be subtle. The patient may respond to questions coherently, but there is some confusion, disorientation and/or agitation. This would score 3 or 4 on the GCS (rather than the normal 5 for verbal response), and scores 3 on the NEWS system.\n\nA score is allocated to each parameter as they are measured, with the magnitude of the score reflecting how extremely the parameter varies from the norm. The score is then aggregated and uplifted by 2 points for people requiring supplemental oxygen to maintain their recommended oxygen saturation.\n\nThis is a pragmatic approach, with a key emphasis on system-wide standardisation and the use of physiological parameters that are already routinely measured in NHS hospitals and in prehospital care, recorded on a standardised clinical chart – the NEWS2 chart.\n\nNEWS2 has continued to be evaluated in acute care setting as demonstrated in these papers:\n\nThe performance of the National Early Warning Score and National Early Warning Score 2 in hospitalised patients infected by the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) - PubMed (nih.gov)\n\nThe early use of sepsis scores to predict respiratory failure and mortality in non-ICU patients with COVID-19 - ScienceDirect.\n\nNEWS2 has received formal endorsement from NHS England and NHS Improvement to become the early warning system for identifying acutely ill patients – including those with sepsis – in hospitals in England.\n\nThe NEWS2 Report\n\nSupplementary guidance to support implementation of NEWS 2\n\nThe RCP has also produced supplementary guidance to support implementation of NEWS2. Advice is given in five categories – new confusion, escalation/response guidance, oxygen scales, receiving acute patients into hospital, and what to do when the NEWS2 scores are incomplete.\n\nAn example of a structured document of clinical response to deterioration can be found here.\n\nNEWS2 and deterioration in COVID-19\n\nThis guidance emphasises the place of NEWS2 in managing patients with COVID-19.\n\nNEWS2 should be used when managing patients with COVID 19. The use of NEWS2 will ensure that patients who are deteriorating, or at risk of deteriorating, will have a timely initial assessment by a competent clinical decision maker. NEWS2 should supplement clinical judgement in assessing the patient’s condition.\n\nThe NEWS2 scoring system for oxygen supplementation is binary (yes/no). In patients with COVID-19 infection, once hospitalised and treated with oxygen, their oxygen requirement might increase rapidly if their respiratory function deteriorates but this may not result in any additional significant increase in the NEWS2 score. Therefore, in patients with COVID 19, all staff should be aware that ANY increase in oxygen requirements should trigger an escalation call to a competent clinical decision maker. This should be accompanied by an initial increase in observations to at least hourly until a clinical review happens, if this has not already happened as a result of NEWS2.\n\nUse of NEWS2 across the acute care pathway\n\nNEWS2 is increasingly used across the acute care pathway and this is demonstrated in the video below which tells Paul's story - an example of NEWS enabling swift and effective treatment.",
        "word_count": 580,
        "url": "https://www.rcp.ac.uk/improving-care/resources/national-early-warning-score-news-2/",
        "source": "www.rcp.ac.uk"
    },
    {
        "title": "Announcing a Breaking News Hub for London",
        "author": "Unknown",
        "published_date": "2024-09-18",
        "content": "The New York Times’s London newsroom plays a critical role in our around-the-clock news operation, and Express and Live are at the center of the action.\n\nThe London Express team has helped lead the way in covering a litany of major storms and a global tech meltdown while delivering the delightful, viral stories that are its hallmark. The London Live team has been at the forefront of our real-time coverage of turmoil in the Middle East, pivotal elections in Europe, campus protests in the United States and so many other big stories.\n\nTo build on the success of these two accomplished teams, which work collaboratively with International and other desks in our fast-growing London operation, we are excited to announce that Express and Live will be forming a new partnership as we create a breaking news hub in London.\n\nModeled on the similar hub in Seoul, the Express-Live collaboration in London will create a pool of nearly a dozen editors and reporters who can tackle any story, giving both teams more resources to do what they do best and jump in to assist International when global stories break. The hub will add even more firepower to Express, especially on weekends, helping that talented desk further its mission to enchant readers — as it has recently with hit tales about a beloved penguin and a slain sycamore tree — and draw new ones to The Times. It will pull more skilled reporters and editors into our live coverage to help it remain a must-read on the world’s biggest breaking stories, seven days a week. And it will be a strong ally to all the desks in London, working with them to ensure we are fast on the news and savvy about our audience while maintaining the highest Times standards.\n\nAs The Times pushes to gain more global readers, the London breaking news hub will work with International to identify coverage opportunities in Europe — where we are increasingly competitive with local publishers — as well as the Middle East and Africa, in addition to jumping on developments happening late in Asia and early in the U.S.\n\nWhile we search for a second Express editor in London, we are pleased to announce that Shashank Bengali will take on the new role of deputy editor for the London breaking news hub. He will supervise both teams in London and report jointly to the editors of Live and Express in New York.\n\nShashank is the perfect fit for this position. He has reported from more than 60 countries across Asia, Africa and the Middle East, including numerous stints covering the wars in Iraq and Afghanistan. At The Times, he has expertly guided our live coverage — including the wars in Ukraine and Gaza — and has time and again demonstrated his ability to work collaboratively with colleagues from all parts of the newsroom, especially International, which trusts him implicitly with their biggest story lines.\n\nPlease congratulate Shashank and the fantastic team of editors and reporters who are taking on this new challenge.",
        "word_count": 508,
        "url": "https://www.nytco.com/press/announcing-a-breaking-news-hub-for-london/",
        "source": "www.nytco.com"
    },
    {
        "title": "Announcing a Breaking News Hub for London",
        "author": "Unknown",
        "published_date": "2024-09-18",
        "content": "The New York Times’s London newsroom plays a critical role in our around-the-clock news operation, and Express and Live are at the center of the action.\n\nThe London Express team has helped lead the way in covering a litany of major storms and a global tech meltdown while delivering the delightful, viral stories that are its hallmark. The London Live team has been at the forefront of our real-time coverage of turmoil in the Middle East, pivotal elections in Europe, campus protests in the United States and so many other big stories.\n\nTo build on the success of these two accomplished teams, which work collaboratively with International and other desks in our fast-growing London operation, we are excited to announce that Express and Live will be forming a new partnership as we create a breaking news hub in London.\n\nModeled on the similar hub in Seoul, the Express-Live collaboration in London will create a pool of nearly a dozen editors and reporters who can tackle any story, giving both teams more resources to do what they do best and jump in to assist International when global stories break. The hub will add even more firepower to Express, especially on weekends, helping that talented desk further its mission to enchant readers — as it has recently with hit tales about a beloved penguin and a slain sycamore tree — and draw new ones to The Times. It will pull more skilled reporters and editors into our live coverage to help it remain a must-read on the world’s biggest breaking stories, seven days a week. And it will be a strong ally to all the desks in London, working with them to ensure we are fast on the news and savvy about our audience while maintaining the highest Times standards.\n\nAs The Times pushes to gain more global readers, the London breaking news hub will work with International to identify coverage opportunities in Europe — where we are increasingly competitive with local publishers — as well as the Middle East and Africa, in addition to jumping on developments happening late in Asia and early in the U.S.\n\nWhile we search for a second Express editor in London, we are pleased to announce that Shashank Bengali will take on the new role of deputy editor for the London breaking news hub. He will supervise both teams in London and report jointly to the editors of Live and Express in New York.\n\nShashank is the perfect fit for this position. He has reported from more than 60 countries across Asia, Africa and the Middle East, including numerous stints covering the wars in Iraq and Afghanistan. At The Times, he has expertly guided our live coverage — including the wars in Ukraine and Gaza — and has time and again demonstrated his ability to work collaboratively with colleagues from all parts of the newsroom, especially International, which trusts him implicitly with their biggest story lines.\n\nPlease congratulate Shashank and the fantastic team of editors and reporters who are taking on this new challenge.",
        "word_count": 508,
        "url": "https://www.nytco.com/press/announcing-a-breaking-news-hub-for-london/",
        "source": "www.nytco.com"
    },
    {
        "title": "FAPESP Week London",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "By André Julião, in London | Agência FAPESP – A new version of equipment developed in Brazil – the Solar-T – will be sent to the International Space Station (ISS) to measure solar flares. It is estimated that the Sun-THz, the name given to the new photometric telescope, will be launched in 2022 on one of the missions to the ISS and will remain there to take consistent measurements.\n\nThe photometric telescope works at a frequency of 0.2 to 15 THz, which can only be measured from space. In parallel, another telescope, the HATS, will be installed in Argentina. That instrument, which will be ready in 2020, will work at a frequency of 15 THz on the ground. The HATS is being constructed as part of a Thematic Project led by Guillermo Giménez de Castro (photo), a professor at the Mackenzie Radio Astronomy and Astrophysics Center (CRAAM) at Mackenzie Presbyterian University (UPM).\n\nThe equipment was part of the subject matter presented during the session given by Giménez de Castro at FAPESP Week London, February 11-12, 2019.\n\nThe researcher explained that solar explosions, or flares, are phenomena that occur on the Sun’s surface, causing high levels of radiation in outer space.\n\nThe Sun THz is an enhanced version of the Solar-T, a double photometric telescope that was launched in 2016 by NASA in Antarctica in a stratospheric balloon that flew 12 days at an altitude of 40,000 m.\n\nThe Solar-T captured the energy emitted by solar flares at two unprecedented frequencies: from 3 to 7 terahertz (THz) that correspond to a segment of far infrared radiation (read more at: http://agencia.fapesp.br/22721/).\n\nThe Solar-T was designed and built in Brazil by researchers at CRAAM together with colleagues at the Center for Semiconductor Components at the University of Campinas (UNICAMP).\n\nDevelopment was possible thanks to a Thematic Project and a Regular Research Grant from FAPESP. The principal investigator for both was Pierre Kaufmann, a researcher at CRAAM and one of the pioneers of radioastronomy in Brazil, who died in 2017.\n\nThe new equipment, with Kaufmann as one of its creators, will be the product of a partnership with the Lebedev Physics Institute in Russia.\n\n“The idea now is to use a set of detectors to measure a full spectrum, from 0.2 THz to 15 THz,” Giménez de Castro told Agência FAPESP.\n\nMost of the new photometric telescope will be built in Russia, but it will have parts made in Brazil, such as the equipment that will be used to calibrate the entire instrument.\n\n“The technology and concept behind the telescope were developed here [in Brazil]. The Russians liked the idea and are reproducing it and adding more elements. We are working on the cutting edge of technology. Forty years ago, the cutting edge for what could be done was 100 gigahertz. With the results obtained over the years, we are seeking higher frequencies, and prospects for the future are good,” said the researcher.\n\nThe future of the equipment lies in its graphene sensors. Highly sensitive to terahertz frequencies, graphene sensors are able to detect polarization and be adjusted electronically.\n\nExperiments in creating these detectors are currently underway at the Center for Advanced Graphene, Nanomaterials and Nanotechnology Research (MackGraphe) at Mackenzie Presbyterian University, a FAPESP-funded center.\n\nThe project also enjoys collaboration from the University of Glasgow, as part of the PhD work of Jordi Tuneu Serra, who is currently on a FAPESP-funded doctoral research internship abroad and who also attended FAPESP Week London.\n\nPhoto credit: André Julião/ Agência FAPESP",
        "word_count": 584,
        "url": "https://fapesp.br/week2019/london/news/technology-developed-in-brazil-will-be-part-of-the-international-space-station",
        "source": "fapesp.br"
    },
    {
        "title": "Professor Alan MacDiarmid Elected Fellow of Royal Society of London",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "UTD’s Alan G. MacDiarmid Elected\n\nFellow of the Royal Society of London\n\nNobel Laureate to Join\n\nWorld’s Oldest Scientific Academy\n\nRICHARDSON,\n\nTexas (May 20, 2003): Nobel Laureate Dr. Alan G. MacDiarmid, who\n\nholds an endowed chair at The University of Texas at Dallas (UTD), has\n\nbeen elected a Fellow of the Royal Society of London for Improving\n\nNatural Knowledge, the world’s oldest scientific academy in continuous\n\nexistence.\n\nFounded in 1660, the Royal Society boasts a fellowship of the most\n\neminent scientists of the day, elected by peer review for life. Its\n\nroster of past and current members includes such luminaries as Isaac\n\nNewton, Charles Darwin, Ernest Rutherford, Albert Einstein, Dorothy\n\nHodgkin, Francis Crick, James Watson and Stephen Hawking.\n\nThere are currently more than 65 Nobel Laureates among the\n\norganization’s approximately 1,300 Fellows and Foreign Members, drawn\n\nfrom all scientific disciplines.\n\nThe Royal Society’s aim is to promote excellence in science by\n\nsupporting research, recognizing achievement and encouraging a greater\n\nawareness and understanding of science. While based in London, it is one\n\nof the most influential science organizations in the world.\n\nMacDiarmid will be admitted into the Royal Society at a ceremony on July\n\n11 in London.\n\nMacDiarmid, who joined the UTD faculty in the fall of 2002, holds the\n\nJames Von Ehr Distinguished Chair in Science and Technology. He also\n\nholds professorial appointments in the university’s Department of\n\nChemistry and Department of Physics and leads a Center for Scientific\n\nand Technical Innovations, where he studies a range of topics including\n\nbiological systems and nanoscience.\n\nMacDiarmid first affiliated with UTD in August 2001 as a distinguished\n\nscholar in residence, senior adviser on science and technology to UTD\n\nPresident Dr. Franklyn Jenifer and chairman of the advisory board of the\n\nUTD NanoTech Institute.\n\nMacDiarmid shared the 2000 Nobel Prize in chemistry with Alan Heeger and\n\nHideki Shirakawa for their discoveries that plastics can be made\n\nelectrically conductive, thus creating the field of conducting polymers,\n\nalso known as ‘synthetic metals.’ Some of the practical\n\napplications of his research include rechargeable batteries, gas sensors\n\nand light-emitting devices. In recent years, MacDiarmid has pioneered\n\nresearch in the field of nanoelectronics.\n\nBorn in New Zealand, MacDiarmid received an M.Sc. degree from the\n\nUniversity of New Zealand and Ph.D. degrees from the University of\n\nWisconsin, where he was a Fulbright Scholar, and Cambridge University.\n\nHe rose through the faculty ranks of the University of Pennsylvania to\n\nbecome the Blanchard Professor of Chemistry.\n\nMacDiarmid is the author or co-author of some 600 research papers and\n\nholds 20 patents. He has received numerous awards, medals and honorary\n\ndegrees for his scientific achievements, most recently election to the\n\nNational Academy of Sciences and to the National Academy of Engineering.\n\nAbout UTD\n\n\n\nThe University of Texas at Dallas, located at the convergence of\n\nRichardson, Plano and Dallas in the heart of the complex of major\n\nmultinational technology corporations known as the Telecom Corridor,\n\nenrolls more than 13,000 students. The school’s freshman class\n\ntraditionally stands at the forefront of Texas state universities in\n\nterms of average SAT scores. The university offers a broad assortment of\n\nbachelor’s, master’s and doctoral degree programs. For additional\n\ninformation about UTD, please visit its web site at\n\nwww.utdallas.edu.",
        "word_count": 531,
        "url": "https://news.utdallas.edu/faculty-staff/professor-alan-macdiarmid-elected-fellow-of-royal-society-of-london/",
        "source": "news.utdallas.edu"
    },
    {
        "title": "FAPESP Week London",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "By André Julião, in London | Agência FAPESP – A new version of equipment developed in Brazil – the Solar-T – will be sent to the International Space Station (ISS) to measure solar flares. It is estimated that the Sun-THz, the name given to the new photometric telescope, will be launched in 2022 on one of the missions to the ISS and will remain there to take consistent measurements.\n\nThe photometric telescope works at a frequency of 0.2 to 15 THz, which can only be measured from space. In parallel, another telescope, the HATS, will be installed in Argentina. That instrument, which will be ready in 2020, will work at a frequency of 15 THz on the ground. The HATS is being constructed as part of a Thematic Project led by Guillermo Giménez de Castro (photo), a professor at the Mackenzie Radio Astronomy and Astrophysics Center (CRAAM) at Mackenzie Presbyterian University (UPM).\n\nThe equipment was part of the subject matter presented during the session given by Giménez de Castro at FAPESP Week London, February 11-12, 2019.\n\nThe researcher explained that solar explosions, or flares, are phenomena that occur on the Sun’s surface, causing high levels of radiation in outer space.\n\nThe Sun THz is an enhanced version of the Solar-T, a double photometric telescope that was launched in 2016 by NASA in Antarctica in a stratospheric balloon that flew 12 days at an altitude of 40,000 m.\n\nThe Solar-T captured the energy emitted by solar flares at two unprecedented frequencies: from 3 to 7 terahertz (THz) that correspond to a segment of far infrared radiation (read more at: http://agencia.fapesp.br/22721/).\n\nThe Solar-T was designed and built in Brazil by researchers at CRAAM together with colleagues at the Center for Semiconductor Components at the University of Campinas (UNICAMP).\n\nDevelopment was possible thanks to a Thematic Project and a Regular Research Grant from FAPESP. The principal investigator for both was Pierre Kaufmann, a researcher at CRAAM and one of the pioneers of radioastronomy in Brazil, who died in 2017.\n\nThe new equipment, with Kaufmann as one of its creators, will be the product of a partnership with the Lebedev Physics Institute in Russia.\n\n“The idea now is to use a set of detectors to measure a full spectrum, from 0.2 THz to 15 THz,” Giménez de Castro told Agência FAPESP.\n\nMost of the new photometric telescope will be built in Russia, but it will have parts made in Brazil, such as the equipment that will be used to calibrate the entire instrument.\n\n“The technology and concept behind the telescope were developed here [in Brazil]. The Russians liked the idea and are reproducing it and adding more elements. We are working on the cutting edge of technology. Forty years ago, the cutting edge for what could be done was 100 gigahertz. With the results obtained over the years, we are seeking higher frequencies, and prospects for the future are good,” said the researcher.\n\nThe future of the equipment lies in its graphene sensors. Highly sensitive to terahertz frequencies, graphene sensors are able to detect polarization and be adjusted electronically.\n\nExperiments in creating these detectors are currently underway at the Center for Advanced Graphene, Nanomaterials and Nanotechnology Research (MackGraphe) at Mackenzie Presbyterian University, a FAPESP-funded center.\n\nThe project also enjoys collaboration from the University of Glasgow, as part of the PhD work of Jordi Tuneu Serra, who is currently on a FAPESP-funded doctoral research internship abroad and who also attended FAPESP Week London.\n\nPhoto credit: André Julião/ Agência FAPESP",
        "word_count": 584,
        "url": "https://fapesp.br/week2019/london/news/technology-developed-in-brazil-will-be-part-of-the-international-space-station",
        "source": "fapesp.br"
    },
    {
        "title": "Professor Alan MacDiarmid Elected Fellow of Royal Society of London",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "UTD’s Alan G. MacDiarmid Elected\n\nFellow of the Royal Society of London\n\nNobel Laureate to Join\n\nWorld’s Oldest Scientific Academy\n\nRICHARDSON,\n\nTexas (May 20, 2003): Nobel Laureate Dr. Alan G. MacDiarmid, who\n\nholds an endowed chair at The University of Texas at Dallas (UTD), has\n\nbeen elected a Fellow of the Royal Society of London for Improving\n\nNatural Knowledge, the world’s oldest scientific academy in continuous\n\nexistence.\n\nFounded in 1660, the Royal Society boasts a fellowship of the most\n\neminent scientists of the day, elected by peer review for life. Its\n\nroster of past and current members includes such luminaries as Isaac\n\nNewton, Charles Darwin, Ernest Rutherford, Albert Einstein, Dorothy\n\nHodgkin, Francis Crick, James Watson and Stephen Hawking.\n\nThere are currently more than 65 Nobel Laureates among the\n\norganization’s approximately 1,300 Fellows and Foreign Members, drawn\n\nfrom all scientific disciplines.\n\nThe Royal Society’s aim is to promote excellence in science by\n\nsupporting research, recognizing achievement and encouraging a greater\n\nawareness and understanding of science. While based in London, it is one\n\nof the most influential science organizations in the world.\n\nMacDiarmid will be admitted into the Royal Society at a ceremony on July\n\n11 in London.\n\nMacDiarmid, who joined the UTD faculty in the fall of 2002, holds the\n\nJames Von Ehr Distinguished Chair in Science and Technology. He also\n\nholds professorial appointments in the university’s Department of\n\nChemistry and Department of Physics and leads a Center for Scientific\n\nand Technical Innovations, where he studies a range of topics including\n\nbiological systems and nanoscience.\n\nMacDiarmid first affiliated with UTD in August 2001 as a distinguished\n\nscholar in residence, senior adviser on science and technology to UTD\n\nPresident Dr. Franklyn Jenifer and chairman of the advisory board of the\n\nUTD NanoTech Institute.\n\nMacDiarmid shared the 2000 Nobel Prize in chemistry with Alan Heeger and\n\nHideki Shirakawa for their discoveries that plastics can be made\n\nelectrically conductive, thus creating the field of conducting polymers,\n\nalso known as ‘synthetic metals.’ Some of the practical\n\napplications of his research include rechargeable batteries, gas sensors\n\nand light-emitting devices. In recent years, MacDiarmid has pioneered\n\nresearch in the field of nanoelectronics.\n\nBorn in New Zealand, MacDiarmid received an M.Sc. degree from the\n\nUniversity of New Zealand and Ph.D. degrees from the University of\n\nWisconsin, where he was a Fulbright Scholar, and Cambridge University.\n\nHe rose through the faculty ranks of the University of Pennsylvania to\n\nbecome the Blanchard Professor of Chemistry.\n\nMacDiarmid is the author or co-author of some 600 research papers and\n\nholds 20 patents. He has received numerous awards, medals and honorary\n\ndegrees for his scientific achievements, most recently election to the\n\nNational Academy of Sciences and to the National Academy of Engineering.\n\nAbout UTD\n\n\n\nThe University of Texas at Dallas, located at the convergence of\n\nRichardson, Plano and Dallas in the heart of the complex of major\n\nmultinational technology corporations known as the Telecom Corridor,\n\nenrolls more than 13,000 students. The school’s freshman class\n\ntraditionally stands at the forefront of Texas state universities in\n\nterms of average SAT scores. The university offers a broad assortment of\n\nbachelor’s, master’s and doctoral degree programs. For additional\n\ninformation about UTD, please visit its web site at\n\nwww.utdallas.edu.",
        "word_count": 531,
        "url": "https://news.utdallas.edu/faculty-staff/professor-alan-macdiarmid-elected-fellow-of-royal-society-of-london/",
        "source": "news.utdallas.edu"
    }
]