[
{"title": "Maharashtra mandates high-security number plates: What vehicle owners need to know", "author": ["Siddhant Konduskar", "Cdata", "Var Template_Content", "Sso_Login_Box", "Xwelcome Backorenter The Email Address Or Mobile Number Associated With Your Account To Sign In. Show Passwordsign Innew To The Indian Express Signupxcreate Your Account It Is Quick", "Easy.Or Show Passwordnextvalidate Otpregisteralready Have An Account", "Signin", "Sso_Social_Box", "Sign In Withgmailfacebookapple", "Var Follow_Widget_Data"], "published_date": "2025-02-21 12:32:28", "content": "Come May, nearly all of the 2.1 crore vehicles plying on Maharashtra’s roads will have to transition to the new High-Security Registration Plates (HSRPs) as mandated by the Regional Transport Office.\n\nThe Indian Express explains the importance of these HSRPs and why the government is keen on vehicles having these new number plates.\n\nWhat is an HSRP?\n\nA High-Security Registration Plate (HSRP) is a tamper-proof number plate introduced to standardise vehicle identification across the country. It is made of aluminium and comes with several security features, including a retro-reflective film that improves visibility at night, a chromium-based Ashoka Chakra hologram, and a unique 10-digit laser-etched serial number.\n\nStory continues below this ad\n\nOne of the key features of HSRPs is the non-removable snap lock, which makes it difficult to tamper with or transfer to another vehicle. Additionally, vehicles with HSRPs must display a colour-coded third registration sticker on the windscreen. This sticker contains important details such as the vehicle’s registration number, engine number, and chassis number, making it easier for authorities to track and verify vehicle authenticity.\n\nWhy is HSRP mandatory?\n\nThe Supreme Court mandated HSRP installation to enhance road safety, prevent vehicle-related crimes, and improve the enforcement of traffic rules. Before HSRPs, many vehicles used duplicate, fake, or fancy number plates, making it difficult to trace stolen vehicles or those involved in criminal activities.\n\nWith HSRPs, authorities can easily track vehicles as each plate is linked to the vehicle’s registration details. The use of standardised plates also ensures that all vehicles follow a uniform pattern, making it easier for traffic personnel to identify non-compliant vehicles.\n\nThe HSRPs also come with Radio Frequency Identification (RFID) technology, allowing for digital tracking, and reducing the chances of vehicle theft and unauthorised transfers.\n\nStory continues below this ad\n\nWhat is the timeline for installing HSRPs?\n\nThe Maharashtra government issued a directive to transition to HSRPs in 2018. However, implementation was lacklustre. With the Supreme Court now urging state governments to enforce the system, Maharashtra reissued directions in January to install these number plates. As per the order, all vehicles registered before April 2019 must install HSRPs by April 30, 2025.\n\nHow can you get these new HSRPs installed?\n\nThe cost of installing an HSRP varies depending on the type of vehicle. It ranges between ₹531 and ₹879, including GST, with separate snap lock charges. Vehicle owners must book an appointment through the Maharashtra Transport Department’s official website at least two days in advance.\n\nTo streamline the installation process, the state has been divided into three zones, each managed by an authorised vendor:\n\nZone 1 (12 RTOs) – Rosmerta Safety Systems Ltd.\n\nZone 2 (18 RTOs) – Real Mazon India Ltd.\n\nZone 3 (27 RTOs) – FTA HSRP Solutions Pvt Ltd.\n\n“We have assigned 57 RTOs across three zones to facilitate HSRP installation and ensure a smooth process for vehicle owners,” a senior transport department official said. Vehicle owners must book their slots at least two days in advance, and authorised agencies must ensure that the plates are ready for installation on the scheduled date.\n\nTo book an appointment for installation, vehicle owners can visit the RTO website.\n\nWhat if vehicle owners do not install HSRPs?\n\nStory continues below this ad\n\nFailure to install an HSRP before the deadline will result in a fine of ₹1,000 under Rule 50 of the Central Motor Vehicle Rules (CMVR) and Section 177 of the Motor Vehicles Act, 1988. Transport officials have been instructed to conduct daily inspections to ensure strict enforcement.\n\nFor vehicles registered after April 1, 2019, that do not have HSRPs, penalties will be imposed under Section 190(2) of the Motor Vehicles Act. The state government has warned that while the deadline has been extended, stricter action will be taken against vehicle owners who fail to comply.\n\nAccording to a transport department official, while the extension provides more time for installation, it should not be seen as an indefinite relaxation.\n\n“We understand that many vehicle owners faced technical difficulties in booking appointments, which is why we extended the deadline. However, vehicle owners should not delay any further, as enforcement action will be strict after the final deadline,” the official said.\n\nHow will HSRPs benefit vehicle owners?\n\nStory continues below this ad\n\nHSRPs provide several advantages beyond regulatory compliance. They enhance vehicle security by making it difficult for criminals to forge or alter number plates. Since each plate is linked to a centralised database, stolen vehicles can be tracked more efficiently.\n\nThe standardisation of number plates also helps maintain a uniform look across all vehicles, reducing the chances of fraudulent activities. With RFID technology, future developments such as automated toll collection and smart traffic management systems can be integrated seamlessly.\n\nThe transport department has urged all vehicle owners to complete HSRP installation within the extended deadline to avoid penalties and ensure compliance with the Supreme Court directive.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-high-security-number-plates-hsrp-9848198/", "source": "indianexpress.com"},
{"title": "‘Don’t take me lightly’: Shinde after CM orders probe into proposed housing project in Jalna", "author": ["Cdata", "Var Template_Content", "Sso_Login_Box", "Xwelcome Backorenter The Email Address Or Mobile Number Associated With Your Account To Sign In. Show Passwordsign Innew To The Indian Express Signupxcreate Your Account It Is Quick", "Easy.Or Show Passwordnextvalidate Otpregisteralready Have An Account", "Signin", "Sso_Social_Box", "Sign In Withgmailfacebookapple", "Var Follow_Widget_Data", "Af_Article_Count"], "published_date": "2025-02-21 22:38:39", "content": "A day after Maharashtra Chief Minister’s Office (CMO) ordered an inquiry into Rs 900-crore stalled housing project in Jalna that was approved for revival in 2023 by Shiv Sena leader Eknath Shinde during his tenure as CM between June 2022 and Nov 2024, now deputy CM Shinde on Friday issued a veiled warning saying he “should not be taken lightly”.\n\nSpeaking to media persons in Nagpur, Shinde said, “Do not take me lightly. I have already said this to those who took me lightly in the past. I am an ordinary party worker, but I am worker of Bala Saheb and Dighe Saheb and so people should keep that in mind. Those who took me lightly saw that I changed the government in 2022 and brought a double engine government that people wanted…”\n\n“As promised and predicted, we brought the government of common people to power in Maharashtra. I had said that Devendra Fadnavis and I would bring 200-plus seats and in 2024 Assembly elections, we got 232 seats. Hence, don’t take me lightly. Whoever has to understand should understand it. I will continue doing my work,” the former CM added.\n\nStory continues below this ad\n\nShinde’s statement came amid growing tensions with Chief Minister Devendra Fadnavis over the past couple of months following several instances, including rift over the appointment of guardian ministers in Nashik and Raigad, among others.\n\nOn Thursday, the CMO ordered an inquiry into a complaint filed by Shiv Sena UBT former MLA Santosh Sambre and asked for a report from CIDCO on the allegations made into the housing project in Jalna.\n\nIn his letter to the CM dated February 2, Sambre called for an inquiry into the stalled project — Rs 900-crore housing project on a 301-acre land parcel in Kharpudi in 2019 — undertaken by the City and Industrial Development Corporation (CIDCO) and alleged that “several persons bought land at low rates and are now selling it to CIDCO at high rates, earning huge profits”.\n\nHe noted in his letter that the project that was dropped in 2020 by the MVA government was revived in February 2023 by then Shinde government. He further said that in January 2020, consultancy firm Ernst & Young had deemed the project unfeasible, which led to its cancellation in July by Uddhav Thackeray-led government. He stated that Shinde government later approved the project in 2023, after a report from another consultant.\n\nStory continues below this ad\n\nFollowing the complaint, the CMO on February 7 wrote to vice-president and managing director of CIDCO, requesting an inquiry and submit a self-explanatory report.\n\n“In accordance with the complaint, it is requested that you conduct an inquiry as per the rules and submit your self-explanatory report to the Chief Minister’s secretariat immediately,” said the letter signed by deputy secretary, CMO.\n\nResponding to questions by reporters, Shinde said that he sought information about the development. He said, “All the projects that we started when I was the CM and Fadnavis ji and Ajit dada were the deputy CMs, were for public welfare. I will first take information about the recent development before commenting,” Shinde said.\n\nWhile CMO insiders underplayed the development stating it as an “administrative decision” in accordance with the laid down norms, Shinde during his Vidarbha tour on Friday made remarks that have created a furore in political corridors.\n\nStory continues below this ad\n\nThough Shinde’s reference was in context of the split in Uddhav Thackeray-led government that led to the downfall of MVA government in 2022, many in the political circles said that it was a message directed at his allies within the Mahayuti.\n\nA Shiv Sena leader requesting anonymity said, “I don’t want to repeat what Shinde ji has said. But in politics it is a norm to indirectly aim at political rivals on the same side. In the past, Thackeray made the mistake of sidelining Shinde and paid the price. It is a warning to the current leadership not to disregard Shinde,” he said.\n\nEarlier, Shinde and his party leaders had skipped meetings convened by CM and deputy CM Ajit Pawar on several occasions. This gave credence to the theory of ongoing rift within the Mahayuti. The Shiv Sena is upset as CM has not conceded their demands for guardian minister post in Nashik and Raigad districts. In Nashik, guardian minister is BJP’s Girish Mahajan and Raigad, guardian minister is NCP minister Aditi Tatkare.\n\nInsiders revealed that the central leadership is likely to hold talks with all the three Mahayuti leaders to end the ongoing bickerings within the allies.", "url": "https://indianexpress.com/article/cities/mumbai/eknath-shinde-devendra-fadnavis-mahayuti-maharashtra-jalna-housing-project-9849214/", "source": "indianexpress.com"},
{"title": "Deputy CM Eknath Shinde email threat: ‘Neighbour did it to take revenge on me’, says one of the 2 held from Buldhana", "author": ["Cdata", "Var Template_Content", "Sso_Login_Box", "Xwelcome Backorenter The Email Address Or Mobile Number Associated With Your Account To Sign In. Show Passwordsign Innew To The Indian Express Signupxcreate Your Account It Is Quick", "Easy.Or Show Passwordnextvalidate Otpregisteralready Have An Account", "Signin", "Sso_Social_Box", "Sign In Withgmailfacebookapple", "Var Follow_Widget_Data", "Af_Article_Count"], "published_date": "2025-02-21 15:49:05", "content": "The Mumbai police on Friday arrested two men from Buldhana in connection with the email threat against Maharashtra Deputy Chief Minister Eknath Shinde.\n\nAn officer from Mumbai Crime Branch said the accused – identified as Mangesh Wayal, 35, and his neighbour Abhay Shingane, 22 – are being brought to the city and will be produced before the court.\n\nThe emails threatening to blow up Shinde’s vehicle were sent to several recipients, including the Goregaon police, JJ Marg police station, state secretariat and two other locations in Mumbai on Thursday.\n\nStory continues below this ad\n\nAccording to the police, Wayal, whose girlfriend had died by suicide recently, would often cast aspersions on Shingane for abetting her to take the extreme step. Shingane, in vengeance, had allegedly sent the mail from Wayal’s phone while it was being charged to put him in trouble, Wayal claimed.\n\n“We are verifying the claims made by Wayal,” an officer said.\n\nThe police said that based on technical information, the officers tracked down the mobile from which threat emails were sent to two police stations in the city. Accordingly, a team was dispatched to Buldhana where the two men were placed under arrest.\n\nAuthorities at Goregaon police station have registered a case in this connection.\n\nStory continues below this ad\n\nThis is not the first time Deputy CM Shinde is facing threats. Just a month ago, he received another threat, which led to the arrest of a 27-year-old person.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-deputy-cm-eknath-shinde-threat-9848203/", "source": "indianexpress.com"},
{"title": "SSC exam begins: Alleged question paper leak surfaces in 2 Maharashtra districts, authorities deny claims", "author": ["Cdata", "Var Template_Content", "Sso_Login_Box", "Xwelcome Backorenter The Email Address Or Mobile Number Associated With Your Account To Sign In. Show Passwordsign Innew To The Indian Express Signupxcreate Your Account It Is Quick", "Easy.Or Show Passwordnextvalidate Otpregisteralready Have An Account", "Signin", "Sso_Social_Box", "Sign In Withgmailfacebookapple", "Var Follow_Widget_Data", "Af_Article_Count"], "published_date": "2025-02-21 22:33:05", "content": "Instances of alleged question paper leaks have surfaced in two districts — Jalna and Yavatmal — on day one of the Secondary School Certificate (SSC) examination conducted by the Maharashtra State Board of Secondary and Higher Secondary Education (MSBSHSE) that began on Friday. Authorities have refuted the claims of a leak, adding that those were cases of copying and not paper leak.\n\nThe controversy emerged initially after a viral video from a local news channel in Jalna surfaced, alleging that photocopies of the Marathi question paper, along with answers, were available at a Xerox shop near the Zilla Parishad (ZP) School exam centre in Badnapur taluka in Jalna district, which falls under the Chhatrapati Sambhaji Nagar division of Maharashtra State Board. This occurred just minutes after the exam began at 11 am on Friday. The video also showed chaos outside the exam centre, fuelling further speculation.\n\nIn Yavatmal district’s Mahagaon taluka, another alleged paper leak was suspected after images of Friday’s question paper went viral on social media. As images were circulated, local administration officials visited an exam centre in Kothari village in Mahagaon, which falls under Amravati division of the Maharashtra State Board.\n\nStory continues below this ad\n\nHowever, in a written statement issued on Friday evening, Maharashtra State Board refuted the claims of paper leak.\n\nRegarding the Jalna case, the statement referred to a report submitted by the officials who visited the exam centre concerned.\n\n“The original question paper of the Marathi subject was scrutinised in accordance with the two pages that have been published on some news channels. It was found that the said two pages are not of the original question paper but published by another private publisher. But some handwritten text pages were found containing questions and answers from today’s paper. This means that this question paper is not leaked, but some questions and answers of the question paper have been made viral with the aim of misleading. Taking a serious note of the incident, the district administration has been instructed to conduct a detailed inquiry in this regard and submit a report and take action against those found guilty,” the statement said.\n\nEarlier in the day, Jalna district collector Dr Shrikrishnanath Panchal too denied any paper leak, stating that the Xerox shop sold copies of questions unrelated to that day’s exam.\n\nStory continues below this ad\n\nIn a video statement, Dr Panchal said, “No such incident occurred. The local Xerox shopkeepers sold copies of questions that were not part of today’s Marathi subject question paper. The actual question paper remained within the exam centre. There was, however, a commotion outside, with someone even throwing a stone at the centre, resisting the strict anti-copying measures. Appropriate action is being taken regarding this disturbance.”\n\nBut refuting any untoward instance at any exam centre in Jalna, the board statement said, “It was just the crowd of parents that was forced out before the examination started, with the help of the police.”\n\nIn reference to Yavatmal, the statement added, “A detailed report of the incident has been taken from the persons concerned and it is seen that the question paper was not leaked at the centre but was made viral with the intention of misleading. Instructions have been given to register a criminal case against the guilty persons in this case.”\n\nOver 16 lakh students from across Maharashtra are registered to appear for the SSC examination that commenced on Friday. This year, Maharashtra State Board has launched a rigorous campaign against copying during exams titled “copy-free exam”. Various measures such as video-recording, police patrol, sitting and flying squads and appointment of external staff–are being implemented by the authorities to ensure fair conduct of exams. However, five cases of copying were reported to the board, of which four were from Chhatrapati Sambhajinagar and one from Pune.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-jalna-controversy-alleged-ssc-question-paper-leak-9849084/", "source": "indianexpress.com"},
{"title": "Maharashtra govt to build Shivaji memorial in Agra: Fadnavis", "author": ["Cdata", "Var Template_Content", "Sso_Login_Box", "Xwelcome Backorenter The Email Address Or Mobile Number Associated With Your Account To Sign In. Show Passwordsign Innew To The Indian Express Signupxcreate Your Account It Is Quick", "Easy.Or Show Passwordnextvalidate Otpregisteralready Have An Account", "Signin", "Sso_Social_Box", "Sign In Withgmailfacebookapple", "Var Follow_Widget_Data", "Af_Article_Count"], "published_date": "2025-02-20 21:57:24", "content": "Chief Minister Devendra Fadnavis said on Wednesday that the state government has taken a decision to build a grand memorial of Chhatrapati Shivaji Maharaj in Agra as a tribute to the Maratha warrior king.\n\nFadnavis made this announcement on Wednesday while addressing a gathering in Agra to commemorate the 395th birth anniversary of Shivaji Maharaj. Agra has a historic significance related to the great escape of Shivaji Maharaj where he was imprisoned by a Mughal emperor. The state government has given its commitment to acquire the land, which currently is known as Meena Bazaar, to build the memorial.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-govt-shivaji-memorial-agra-fadnavis-9847201/", "source": "indianexpress.com"},
{"title": "Away from Cabinet meeting and at centre of row, Dhananjay Munde says: ‘Diagnosed with Bell’s Palsy… can’t speak’", "author": ["Cdata", "Var Template_Content", "Sso_Login_Box", "Xwelcome Backorenter The Email Address Or Mobile Number Associated With Your Account To Sign In. Show Passwordsign Innew To The Indian Express Signupxcreate Your Account It Is Quick", "Easy.Or Show Passwordnextvalidate Otpregisteralready Have An Account", "Signin", "Sso_Social_Box", "Sign In Withgmailfacebookapple", "Var Follow_Widget_Data", "Af_Article_Count"], "published_date": "2025-02-21 12:01:19", "content": "Maharashtra minister and Nationalist Congress Party (NCP) leader Dhananjay Munde, who has been facing heat over the killing of a sarpanch in Beed district and has been away from Cabinet meetings, said that he has been diagnosed with Bell’s Palsy and hence could not attend the briefings.\n\nBell’s Palsy is a condition that causes sudden weakness or paralysis on one side of the face and affects one’s ability to speak.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-minister-dhananjay-munde-bell-palsy-9848094/", "source": "indianexpress.com"}
][

][

][

][

][
{"title": "Sachin Tendulkar thanks Maharashtra Government for its decision to...", "author": "Unknown", "published_date": "Unknown", "content": "PTI Photo\n\nIndia's batting legend Sachin Tendulkar has thanked the Maharashtra Government 's decision to build a statue of his childhood coach, the Late Ramakant Achrekar , at the Shivaji Park in Mumbai.\"Achrekar Sir has had an immense impact on my life and several other lives. I am speaking on behalf of all his students. His life revolved around cricket in Shivaji Park. Being at Shivaji Park forever is what he would have wished for.I am very happy with the government’s decision to build a statue for Achrekar Sir at his karmabhoomi,\" Tendulkar posted on X (formerly Twitter).The announcement was made on Wednesday, a day ahead of the National Sports Day, which is also the birth anniversary of hockey legend Major Dhyan Chand.The Government of Maharashtra on Wednesday issued a Government Resolution (GR) permitting the installation of the monument in memory of the famous cricket coach who mentored Tendulkar and several other India players during their formative years at the famed Shivaji Park on an open space near gate No. 5.The idea to build a memorial for Achrekar at the Shivaji Park was initiated, and continuously followed up by one of Achrekar's students, Sunil Ramachandran, who is the former captain of the Kamat Memorial Cricket Club and is presently the assistant general secretary of the Shivaji Park Gymkhana.\"It was possible because of the guidance and support of (MNS chief) Raj Thackeray,\" Ramachandran, told TOI.A winner of the prestigious Dronacharya award, Achrekar, who passed away on January 2, 2019, at the age of 87, mentored 14 players who went on to play for India. These are Ramnath Parkar, Eknath Solkar, Balwinder Singh Sandhu, Lalchand Rajput, Chandrakant Pandit, Pravin Amre, Tendulkar, Vinod Kambli, Sameer Dighe, Sanjay Bangar, Paras Mhambrey, Ramesh Powar, Ajit Agarkar and Sairaj Bahutule.\"There will be a ball, helmet, gloves and pad and his name inscribed on the memorial. The bat will have signatures of all the 14 India cricketers that he coached, starting from (India’s 1983 World Cup hero) Balwinder Singh Sandhu to Bharat Ratna and cricket icon Tendulkar,\" Ramachandran said.The monument is likely to be ready in the next couple of months and will be inaugurated by Tendulkar.", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/sachin-tendulkar-thanks-maharashtra-government-for-its-decision-to-/articleshow/112888257.cms", "source": "timesofindia.indiatimes.com"},
{"title": "₹21.59 cr siphoned off from sports complex account; main accused alleges insider's role", "author": "Authors", "published_date": "2024-12-30", "content": "A computer operator has allegedly misappropriated ₹21.59 crore from an account of a government-run sports complex in Maharashtra’s Chhatrapati Sambhajinagar city, officials said on Monday (December 30, 2024).\n\nThe main accused, Harshkumar Kshirsagar, a contractual computer operator at the Divisional Sports Complex office who is currently absconding, committed the offence over 11 months, an official from Jawaharnagar police station said.\n\n“Police have arrested a woman friend of the accused and were enquiring with her in connection with the case,” he said.\n\nWhile the probe was on into the case, the absconding accused sent a letter by post to the Jawaharnagar police on December 26, alleging some senior office-bearers at the facility pressured him for the misappropriation of funds.\n\nAccording to the police official, Mr. Kshirsagar allegedly changed the e-mail address of the sports complex committee registered with a bank and got the facility’s account linked to another e-mail ID to which he had access.\n\nThe detailed bank statements of the account were then sent to his new e-mail address, the official said.\n\nThe accused allegedly diverted ₹21.59 crore from the sports facility’s bank account to another account and then withdrew the money, he said.\n\n“Based on a complaint by a representative of the sports complex, the Jawaharnagar police on December 22 registered a case against Mr. Kshirsagar and two others under relevant legal provisions,” the official said.\n\nEven as efforts were underway to apprehend Mr. Kshirsagar, he sent a seven-page letter to the Jawaharnagar police station in-charge last week, claiming some seniors at the sports complex office pressured him to withdraw its fund.\n\nHe alleged that a senior office-bearer at the sports complex threatened him showing a gun, gave him a letter to get the facility’s account number changed, chose the properties bought with the withdrawn amount and also used a car purchased for ₹1.35 crore by the accused.\n\nThe accused also claimed in his letter that he was mentally harassed when he refused to indulge in the fund transfer and withdrawal.", "url": "https://www.thehindu.com/news/national/maharashtra/rs-2159-crore-siphoned-off-from-sports-complex-account-main-accused-alleges-insiders-role/article69042453.ece", "source": "www.thehindu.com"},
{"title": "Maharashtra Sports Commissioner seeks action against Rajvardhan Hangargekar for age fraud", "author": "Cdata, Var Template_Content, Sso_Login_Box, Xwelcome Backorenter The Email Address Or Mobile Number Associated With Your Account To Sign In. Show Passwordsign Innew To The Indian Express Signupxcreate Your Account It Is Quick, Easy.Or Show Passwordnextvalidate Otpregisteralready Have An Account, Signin, Sso_Social_Box, Sign In Withgmailfacebookapple, Var Follow_Widget_Data, Af_Article_Count", "published_date": "2022-02-19", "content": "Maharashtra State Sports Commissioner Omprakash Bakoria has written to the BCCI seeking “strict action” against India U-19 World Cup-winning member Rajvardhan Hangargekar for age fraud.\n\nIn a letter dated February 8, Bakoria wrote to BCCI secretary Jay Shah that the pacer had altered his birth date from January 10, 2001 to November 10, 2002 and was thus over-age when he competed in the recently-concluded U-19 World Cup.\n\n“The conduct of Mr Rajvardhan Hangangekar is against the sports integrity and ethics. It deprives fair play and results into damages to the reputation of the nation. Therefore, you are requested to take strict action in accordance with the law,” Bakoria wrote.\n\nStory continues below this ad\n\nThe letter has also been marked to secretary of Maharashtra Cricket Association Riyaz Bagban.\n\nBakoria further wrote, “As per the inquiry and the report, it reveals that Mr Rajvardhan Hangargekar has started his academic career from Terna Public School, Osmanabad. It is governed by the school code prescribed by the Government of Maharashtra.” “At the time of admission of Rajvardhan Hangargekar in 1st standard at Terna Public School (primary division) Osmanabad, the date of birth is provided as 10/01/2001. The school record speaks that the birth date of Mr Rajvardhan Hangagekar up to seventh standard is recorded as 10/01/2001.” The commissioner alleged that the school made “unauthorised corrections” to Hangargekar’s birth date.\n\n“As per the general register maintained by the Terna Public School, Osmanabad, his birth date is 10/01/2001. It appears unauthorised corrections (were) made by the Head Master and his birth date is recorded as 10/11/2002 at the time of fresh application for 8th standard.” “If the headmaster requires any corrections in the birth date, it is necessary to take prior permission of the education officer of the concerned district. However, no such permission has been taken for making changes in the birth date of Mr Rajvardhan Hangargekar.\n\n“Therefore said corrections are made in excess of power and amount to cheating and forgery in government records,” the senior IAS officer stated.\n\nStory continues below this ad\n\nLast week, Hangargekar was bought by Chennai Super Kings for Rs 1.5 crore at the IPL 2022 mega auction.\n\n“On the basis of the fabricated record, Mr Rajvardhan Hangargekar seems to have secured a position in the national team of India. As per the report of Chief Executive Officer (IAS) Zilla Parishad, Osmanabad, the birth date of said player is 10/01/2001 and therefore, he has completed 21 years of age at the time of the tournament.\n\n“Despite of the fact, he has secured a position in the U19 team participating in the ICC (U-19) World Cup 2022.” The PTI tried to contact Maharashtra Cricket Association secretary Bagban and Hangargekar for a response, but both could not be reached.\n\nEarlier Manjot Karla, who struck a match-winning century in the final of 2018 U-19 World Cup, was banned for two years from playing for Delhi, for age fraud.\n\nStory continues below this ad\n\nIn September 2011, Maharashtra’s Ankit Bawne was removed from India U-19 squad after the date of birth in his passport did not match with the one in his birth certificate and the BCCI records.", "url": "https://indianexpress.com/article/sports/cricket/maharashtra-sports-commissioner-seeks-action-against-rajvardhan-hangargekar-for-age-fraud-7781078/", "source": "indianexpress.com"},
{"title": "At Olympic Day commemorations, Maharashtra Sports minister Bansode announces funding for facilities for athletes", "author": "Cdata, Var Template_Content, Sso_Login_Box, Xwelcome Backorenter The Email Address Or Mobile Number Associated With Your Account To Sign In. Show Passwordsign Innew To The Indian Express Signupxcreate Your Account It Is Quick, Easy.Or Show Passwordnextvalidate Otpregisteralready Have An Account, Signin, Sso_Social_Box, Sign In Withgmailfacebookapple, Var Follow_Widget_Data, Af_Article_Count", "published_date": "2024-06-23", "content": "“This amount will be tripled if the consistency of Maharashtra's players continues,” Bansode said. (X/@MahaOlympic)\n\nAt the Olympic Day programme organised in Pune on behalf of the Maharashtra Olympic Association and in collaboration with the Maharashtra Directorate of Sports, state sports minister Sanjay Bansode said that in every country, boys and girls are given equal opportunities in sports and asserted that this should be implemented in India as well.\n\nBansode spoke about various decisions announced on behalf of the government. He said talukas will be given Rs 5 crore for sports complexes and Rs 10 crore to district complexes for sports facilities. “This amount will be tripled if the consistency of Maharashtra’s players continues,” Bansode said. He promised that the distribution of the Shiv Chhatrapati Awards, which was delayed due to a court dispute, will be done as soon as possible. He announced financial assistance of Rs 7 lakh for indoor sports facilities.", "url": "https://indianexpress.com/article/cities/pune/olympic-day-commemorations-maharashtra-sports-minister-funding-athletes-9410376/", "source": "indianexpress.com"},
{"title": "Sports in Maharashtra", "author": "Unknown", "published_date": "Unknown", "content": "Overview of situation of sport in Indian state, Maharashtra\n\nSports play an integral part of culture in the Indian state of Maharashtra. Cricket is the most popular spectator sport in the state. Other popular sports include kabaddi and kho kho, which are played in rural areas, and field hockey, badminton, and table tennis, which are more common in urban areas, schools, and colleges. In the state's southern rural regions, annual wrestling championships such as Hind Kesari and Maharashtra Kesari are held. Games like Viti-Dandu and variations of Tag are played among children.\n\nThe Mumbai cricket team represents Mumbai, Palghar, and Thane districts in Indian domestic cricket, whilst the Maharashtra cricket team represents the rest of the state. Maharashtra Cricket Association (MCA) governs cricket in the state except for the Mumbai region. The state is home to international standard stadiums including Wankhede stadium in Mumbai and Maharashtra Cricket Association Stadium in Pune. In the Indian Premier League (IPL), the Mumbai Indians franchise represents the state from Mumbai; the women's team plays in the Women's Premier League. The Maharashtra Open, a tennis ATP Tour 250 tournament, is annually held in Balewadi Stadium, Pune.\n\nHistory [ edit ]\n\nPre-colonial sports [ edit ]\n\nIn ancient India, a martial art called mallavidya was practiced. It was a form of grappling that was more complex than wrestling, and was performed in earthen mud pits called akhadas or talims, some of which can still be found in Maharashtra today. Historical depictions of the martial art can be seen on archaeological sculptures from the region at numerous locations, such as Kharosa or Pavnar.[1]\n\nBaji Rao II, the last Peshwa of the Maratha Empire, was a patron of strength and wrestling competitions during the early 19th century. Under his patronage, the sport of malkhamb (pole gymnastics) was developed in Pune by Balambhat Deodhar. After Baji Rao lost power and was exiled to northern India, Deodhar brought malkhamb and mallavidya to other Maratha-ruled states such as Baroda and Gwalior. In the later 19th and early 20th centuries, other rulers such as those of Kolhapur and Aundh were also patrons of organised wrestling and sporting festivals.[2] Among the rulers of these princely states, horse riding, wrestling, fencing, archery, and shooting gained popularity.[3]\n\nImported sports under British rule [ edit ]\n\nBritish rule in India drastically changed the landscape of sports in Maharastra. Like in other regions of India, British rulers and aristocrats enjoyed outdoor sports and built facilities for their own leisure.[4] This led to the introduction of several British sports, including cricket, and the development of the new game of badminton.[5] New infrastructure—such as the building of a dam at Bund Garden in 1860—allowed for recreational boating on the Mula-Mutha river.[6] In addition, the colonial rulers introduced horse racing; some racecourses built during this period, such as the Mahalaxmi Racecourse and Pune Race Course, are still in operation today.[7][8]\n\nBy the late 19th century, the British had constructed numerous sports clubs that were exclusively white or restricted based on religion, such as Poona Europeans, Poona Parsees, and Poona Hindu Gymkhana. While many of the religion-based clubs were dominated by educated Brahmins, there were also some lower-caste sports stars such as the brothers Palwankar Baloo and Vithal Palwankar, who played cricket in the early 20th century.[7][8]\n\nIndigenous sports under British rule [ edit ]\n\nAt the same time that imported sports were being developed by the British, indigenous sports continued to change and develop. However, after Indian Civil Service officer Walter Rand was assassinated in 1897 by the Chapekar brothers who ran a wrestling venue in Pune, British colonial authorities viewed these indigenous sports venues with suspicion.[9] A committee was established in 1914 in order to set rules for kho-kho.[10] The formalization of Indian sports continued in the region, and the Deccan Gymkhana sports club was instrumental in organizing the first Indian delegation to an Olympic games, which participated in the 1920 games in Antwerp.[11] Other clubs, such as the Maharashtra Mandal club, which formed in the early 20th century, promoted physical culture and education by hosting both indigenous and Western sports.[9][12]\n\nOther indigenous sports and exercises developed as well, especially yoga. In the 1920s, Bhawanrao Shriniwasrao Pant Pratinidhi, the ruler of Aundh State, helped popularize the series of yoga positions called Surya Namaskar, a flowing sequence of salutations to the sun. This series contained popular asanas (positions) such as upward and downward dog and Uttanasana which helped to popularize yoga as exercise.[13]\n\nBeginning in the 1910s, local Indian organizations were established in order to propagate and develop Indian physical culture. One such organization, initially called Hanuman Akhara, was formed in 1922 by the Vaidya brothers in Amravati and eventually became the Hanuman Vyayam Prasarak mandal (HVPM). A satellite organization of the HVPM helped to revise the rules for kabaddi in the 1930s after the Indian YMCA had first formulated the rules in earlier years.[17]\n\nAdministration [ edit ]\n\nThe Directorate of Sports and Youth Services (Maharashtra) is the governing body which is responsible for sports in Maharashtra. The directorate is a part of the School Education and Sports Department of the Government of Maharashtra and is let by the Sports and Youth Welfare Minister of Maharashtra.[18]\n\nThe Maharashtra Olympic Association, affiliated with the Indian Olympic Association, is responsible for the selection and participation of the state's contingent in the Olympic Games, Commonwealth Games, Asian Games, and for the South Asian Games in Maharashtra.[19]\n\nThe Maharashtra Cricket Association is the governing body for cricket activities in Maharashtra and for the Maharashtra cricket team. It is affiliated with the Board of Control for Cricket in India.[20][21][22] The Maharashtra Cricket Association is one of three cricket associations based in Maharashtra, along with Mumbai Cricket Association and Vidarbha Cricket Association.[23]\n\nThe Western India Football Association (WIFA) is the governing body for football in Maharashtra, and was established on 12 July 1911. It is affiliated with the All India Football Federation, the sport's national governing body for all of India.[24]\n\nSports policy [ edit ]\n\nThe Maharashtra government announced its first sports policy in 1996, the first Indian state to do so.[25] After five years, in 2001, the state government launched a second sports policy for a ten-year period, which had the motto \"Fitness for all through Sports\". As part of this policy, the Sports Infrastructure Development Plan was created[25] and a reservation was made for a sportsperson in government and semi-government jobs. In 2012, a third sports policy was declared, which created financial assistance to prepare the state for participation in international competitions.[25]\n\nIndigenous sports [ edit ]\n\nIndian sports—include badminton, kabaddi, kho kho, atya patya, langdi, and mallakhamba—originated in or were formalised in Maharashtra.[26][27] In rural areas of Maharashtra, kusti (Indian mud wrestling) and bullock cart competitions can regularly be seen during the annual jatra carnival. The Maharashtran government has supported kusti in the state by constructing two permanent training centers for the sport in the Kolhapur area.[28]\n\nIndian wrestling [ edit ]\n\nA kushti competition at Jawla in Solapur district\n\nDespite cricket's dominance in most of India, wrestling has maintained its popularity in Maharashtra, especially in the rural regions of the state and Kolhapur district.[29] One famous wrestler from the state was Khashaba Jadhav, who won a bronze medal in the 1952 Helsinki Olympics; he was the first citizen from the newly independent nation of India to win an Olympic medal in an individual sport.[29][30]\n\nIn kusti, a style of traditional wrestling, matches are typically held in a clay or dirt pit[31] in which the soil is mixed with ghee and other materials.[32] This sport encompasses an ancient subculture in which wrestlers live and train together and following strict rules on diet and leisure. The focus is on living a pure life and building one's strength and skills, and abstaining from drinking, smoking, and sex.[32] The wrestlers' diets consist of milk, almonds, ghee, eggs, and chapattis.[32] Kusti represents the intersection of sports, politics, and culture and is deeply embedded in the agrarian economy of rural Maharashtra.[33]\n\nAnother style of wrestling popular in Maharashtra is that associated with Hind Kesari, a wrestling championship established in 1958 and affiliated with the All India Amateur Wrestling Federation (AIAWF).[34] Most common in the rural areas of western Maharashtra, wrestlers train in schools called taleems, in which wrestling gurus instruct students on both physical and moral instruction in a style of wrestling that blends spiritual and secular practices.[35] The largest tournaments in the state draw top wrestlers from the region and even outside India, including from Pakistan, Iran, Turkey, and several African nations.[35]\n\nField hockey [ edit ]\n\nHiranna M. Nimal, silver medalist at the 1962 Asian Games\n\nField hockey is one of the most popular sports in Maharashtra. Up to thirty domestic tournaments of the sport are held in a calendar year in Pune alone,[36] such as the All India Bombay Gold Cup Hockey Tournament and the All India Aagha Khan Hockey Tournament.[37][38] The state is home to three hockey clubs playing in different leagues, and was home to a now-defunct club called the Maratha Warriors, who competed in the Premier Hockey League.[39][40][41] The Mumbai Magicians are based in Mumbai and play in the Hockey India League.[42][43] The Mumbai Marines[44][45] and the Pune Strykers play in the World Series Hockey.[46]\n\nMahindra Hockey Stadium serves as the home venue of the Mumbai Marines and Mumbai Magicians, and used to be the home venue of the Maratha Warriors. The stadium hosted the 1982 Men's Hockey World Cup.[37][38] PCMC Hockey Stadium serves as the home venue of the Pune Strykers.[47]\n\nMany individual Maharashtrian have also contributed to India's hockey legacy. Tushar Khandekar is referred to as \"the Goal Poacher\".[29] Hiranna M. Nimal was a silver medalist at the 1962 Asian Games and also represented Maharashtra in many other national and international leagues.[29] Other notable hockey stars from the state include Dhanraj Pillay and Viren Rasquinha.[citation needed]\n\nCricket [ edit ]\n\nPlaying cricket at Oval Maidan, Mumbai\n\nWankhede Stadium during the first innings of the 2011 ICC World Cup Final between Sri Lanka and India\n\nCricket is played at domestic and international levels in Maharashtra and is consistently supported by people from most parts of the state. Maharashtra is home to the Maharashtra cricket team,[48] Vidarbha cricket team,[49] Veer Marathi cricket franchise,[50][51] Mumbai Indians,[52][53] and the regionally dominant Mumbai cricket team.[54] The Mumbai cricket team was the dominant franchise for much of the 20th century, winning the first Ranji Trophy Championship over North India in 1935[55] and winning fifteen consecutive Ranji Trophy victories between 1958–1973.[56] Mumbai is the most successful team in the history of the Ranji Trophy championship, winning 40 titles over the course of its history, as well as the most successful team in the Irani Cup, with 16 titles won.[57][58]\n\nThe Mumbai cricket team is overseen by the Mumbai Cricket Association and the Maharashtra cricket team is overseen by the Maharashtra Cricket Association.[59] The Mumbai cricket team and Mumbai Indians both have their home grounds at Wankhede Stadium, an international cricket ground. Both teams play in the Indian Premier League, of which the Mumbai Indians was one of eight founding members in 2008.[60]\n\nThe Maharashtra Cricket Association set up a T20 franchise league called Maharashtra Premier League (MPL) in 2023, which has six teams. It sold the franchise rights for 57 crore rupees for three years through open bidding. The inaugural season was expected to start on 15 June 2023, at the association's Pune's stadium.\n\nMaharashtra is home to India's first cricket museum, Blades of Glory, which is based in Pune and run by Rohan Pate, a former cricketer. It opened during the 2013 Indian Premier League season.[61][62]\n\nIndia versus Vietnam football match in the Shree Shiv Chhatrapati Sports Complex\n\nFootball is another popular sport in many parts of the state, with the FIFA World Cup and the English Premier League being followed widely.[63] The Maharashtra Football Pyramid consists of district leagues, each of which are broken into sub-leagues. This pyramid operates during the whole calendar year, but at different times. In the I-League, Mumbai was represented by Mumbai FC,[64] Mahindra United,[65] and Air-India.[66] Pune FC was established in August 2007 and is a recently founded football club in the I-League.[67] There is local rivalry among the Mumbai-based clubs Air India FC and Mumbai FC, and state rivalry with Pune FC. Matches between these teams are called the \"Maha Derby\", as they are played in Maharashtra.[68] Maharashtra is also represented in the Santosh Trophy by the Maharashtra football team, who last won the trophy in the 1999–2000 season.[69][70]\n\nThe Western India Football Association (WIFA) signed a deal with Sporting Ace, a sports management company, to infuse new investments into Maharashtra football. The Mumbai District Football Association (MDFA) is the organisation responsible for association football in and around Mumbai. The MDFA organises around seven leagues that contain more than 300 club sides in total, in addition to being responsible for six of India's I-League sides.[71]\n\nSeven-a-side football is also hugely popular in Maharashtra. The eighth Motilal Mathurawala Trophy Seven-a-side Junior National Football Championship was held in Pune.[72]\n\nMaharashtra has two club franchises which play American football in the Elite Football League of India.[73] The Mumbai Gladiators is a team based in Mumbai[74] and the Pune Marathas is a team based in Pune with the Shree Shiv Chhatrapati Sports Complex as its home stadium.[75] Maharashtra hosted the First Youth National American Football Championship in 2007[76] in which the Mumbai Gladiators and Pune Marathas played their first match against each other.[73] However, neither team won the championship, which was instead won by the visiting Manipur team.[76]\n\nDerby (horse racing) [ edit ]\n\nThe horse racing season in Maharashtra starts in mid-November and ends in the last week of April. Every February, Mumbai holds derby races at the Mahalaxmi Racecourse.[77] Since 1986, McDowell's Indian Derby has been sponsored by liquor baron Vijay Mallya's UB Group as The McDowell's Indian Derby.\n\nThe Mahalaxmi Racecourse horse racing track is one of two racecourses in Maharashtra. The track is oval with a 2,400 metres (7,900 ft) straight chute spread over approximately 225 acres (0.91 km2; 0.352 sq mi). It was built in 1883[78] and modelled on the Caulfield Racecourse in Melbourne.[79] Pune Race Course is the second racecourse in Maharashtra. It was built in 1830 and covers 118.5 acres (48.0 ha).[80]\n\nGrand Prix [ edit ]\n\nIn March 2004, the Mumbai Grand Prix was part of the F1 powerboat world championship, and the Force India F1 team car was unveiled in Mumbai in 2008.[81] As of 2011, the city plans to build its own F1 track and various sites were assessed, of which the authorities have narrowed down to either Marve-Malad or Panvel-Kalyan. If approved, the track will be clubbed with a theme park and will spread over 400 to 500 acres (162 to 202 ha).[82][needs update]\n\nMarathon [ edit ]\n\nMumbai Marathon [ edit ]\n\nIn 2004, the annual Mumbai Marathon was established as a part of \"The Greatest Race on Earth\". The Mumbai Marathon is an annual international marathon held on the third Sunday of January. The Standard Chartered Mumbai Marathon is India's biggest charity platform.[83]\n\nPune Marathon [ edit ]\n\nThe Pune International Marathon is an annual marathon held in Pune; it was established in 1983 and was the first Indian marathon to be certified by the AIMS.[84] The Athletics Federation of India has awarded the status of National Marathon Championship to the Pune International Marathon.[85] Funds raised from the race are donated to Project Concern International, an NGO working towards HIV/AIDS awareness and prevention.[85]\n\nRace types of Pune International Marathon [ 86 ] No Race Name Distance (in kilometers) 1 Men's & Women's Marathon 42.195 2 Men's & Women's Half Marathon 21 3 Women's Half Marathon 21 4 Men's & Women's 10 km 10 5 Men's & Women's 5 km 5 6 Wheelchair (Machine & Hand) 3.5\n\nTennis [ edit ]\n\nATP 250 Maharashtra Open is annually organised in Pune. It is India's only international level tennis tournament, with singles and doubles male players from the country and abroad participating. It is organised by Maharashtra Lawn Tennis Association, which is the governing body of this sport in the state.\n\nMaharashtra has a franchise-based tennis league, the Maharashtra Tennis League (MTL), which is India's first league format in tennis.[87][88][89] The MTL launched with a total of 80 players and five teams: the Mumbai Blasters, Sharp Smashers, Baseline Bombers, Accurate Aces, and Dazzling Deuces.[90][91][92] Each team in the league consists of six players, at least two of which must be women and at least one of which must be from Maharashtra.[93]\n\nOne famous Maharashtrian tennis player was Gaurav Natekar, a former Davis Cup player[94] and seven-time Indian National Tennis Champion. He was awarded the Arjuna Award for Tennis in 1996.[95]\n\nMumbai has hosted the Kingfisher Airlines Tennis Open, an International Series tournament of the ATP World Tour, in 2006 and 2007.[96] The tournaments were played on outdoor hard courts at the Cricket Club of India in Mumbai.[97][98]\n\nChess [ edit ]\n\nRohini Khadilkar (Mumbai) a former women's chess champion of India\n\nMaharashtra has a five-decade-long chess culture.[99] The first chess association in Maharashtra was formed in 1921 and was known as the South Maharashtra Chess Club.[100] The Sangali Chess Society was established in 1930.[100] The Southern Maratha Country Chess Association originated in 1955. With the growth of the game in the state, the first chess body in Mumbai, known as the Bombay Chess Association, was established in 1944. Open chess tournaments started in the city in 1945.[100] Then, in 1950, the All India Chess Federation was started in Mumbai and held tournaments at the national level for five years afterwards in Mumbai. The first Inter-State Championship was held in 1960.[100] In 1963, the Bombay Chess Association and Southern Maratha Country Chess Association merged to form the Maharashtra Chess Association.\n\nThe Maharashtra Chess League, the first-ever IPL style chess league in India, started the PYC Hindu Gymkhana club in Pune on 24 April 2013.[101] The tournament played on a league-cum-knock-out basis. Each team played the other five teams once, with the top four teams at the end of the league stage making it to the semifinals.[101]\n\nMaharashtra has produced many notable chess players, including Abhijit Kunte, Praveen Thipsay, Rohini Khadilkar, and Anupama Gokhale.[citation needed]\n\nSee also [ edit ]", "url": "https://en.wikipedia.org/wiki/Sports_in_Maharashtra", "source": "en.wikipedia.org"},
{"title": "Committee to decide women sports awardees, Maharashtra tells Bombay High Court", "author": "Unknown", "published_date": "2025-02-14", "content": "The Maharashtra government on Thursday informed the Bombay High Court that it has formed a committee that will decide the upcoming awardees in the women's category who will qualify for the Shiv Chhatrapati Rajya Krida Purasakar.\n\nThe committee is being headed by state Sports Minister Dattatre Bharne, and will decide the prestigious sports award by the state government, which is given to one male and one female sports person who performs the best in their field.\n\n\n\nTwo different division benches of Justices Revati Mohite-Dere and Dr Neela Gokhale and Justices GS Kulkarni and Advait Sethna were hearing two different petitions seeking the same recognition from the Maharashtra government.\n\nadvertisement\n\nAdvocate Ketaki Gokhale, who was an artistic gymnast, had approached the court, claiming that during Covid-19 induced pandemic, the Maharashtra government did not give out the sportsman awards, and in January 2023, they called for the applications from sportspersons for past three years, 2020-2023.\n\nPetitioner Gokhale's plea stated that for 2019-2020 and 2020-2021, she was the highest scorer in gymnastics sports. As per the government resolution, the scores are calculated based on the number of medals won at state and national championships. The government resolution also stated that one had to win medals in at least three national championships in the given sports category.\n\nAccording to Gokhale, because of Covid some of the championships were not held by the national federation so no gymnast would fit into the criteria and even though she had high medal tally at the national games, she too was not being considered.\n\nadvertisement\n\nThe Maharashtra government had allegedly mechanically rejected her application because she had participated in one less gymnastics championship as demanded by the government.\n\nGokhale's contention was that when the championships themselves were not held, then the criteria of winning medals in three minimum national championships cannot be fulfilled by anyone. And because of this, no one was given the award for these three years in gymnastics which was not right.\n\nAnother gymnast, Vaidehi Dewoolkar, who was the other petitioner, had applied for the award for the year 2021-2022 and her contentions were similar to those of Gokhale's.\n\nMeanwhile, gymnast Ganesh Navle had approached the High Court earlier with similar contention, seeking that he be considered for the award for the year 2019-2020 in men's category. In March 2024, the high court had directed the Maharashtra government to consider Navle's application, and in October 2024, the state finally declared that he will be given the award after modifying the criteria.\n\nAdvocates Gaurav Bhavnani and Satish Shukla appearing for the petitioners Gokhale and Deoolkar argued that the government should have applied the modified criteria in Gokhale as well as Deoolkar's case in women category the way they applied the modified criteria for giving the award to Navle in the men's category during the pandemic.\n\nadvertisement\n\nAfter hearing Bhavnani and Shukla, the benches directed the government to consider the same. It is following this direction that the government formed the committee.\n\nAdditional Government Pleader Manish Upadhyaye submitted that the committee will take about three weeks to take a decision.\n\nHe submitted that a week before a public announcement of these awards, if the petitioners are not selected for the award, then they will be intimated so that they can avail any other legal remedy. The bench agreed to this.\n\nPublished By: Vivek Published On: Feb 14, 2025", "url": "https://www.indiatoday.in/india/law-news/story/maharashtra-government-tells-bombay-high-court-it-has-formed-panel-to-decide-women-sports-awardees-2679790-2025-02-14", "source": "www.indiatoday.in"},
{"title": "Shobhaa De Has Insulted Sportspersons, Says Maharashtra Sports Minister Vinod Tawde", "author": "Unknown", "published_date": "Unknown", "content": "Goal of Team India at the Olympics: Rio jao. Selfies lo. Khaali haat wapas aao. What a waste of money and opportunity. Shobhaa De (@DeShobhaa) August 8, 2016\n\nOfficial apathy main reason why we fare so poorly during every Olympics, not just Rio. Difficult for athletes to 'compete' with this hurdle. Shobhaa De (@DeShobhaa) August 9, 2016\n\nMaharashtra Sports Minister Vinod Tawde today said author Shobhaa De has \"insulted\" Indian athletes by \"mocking\" they had gone to Rio Olympics to take selfies and \"come back empty-handed\".\"Only the person who has managed to reach the Olympics knows the hard work and efforts that go into qualifying for the sports event,\" he said.\"Saying such a thing about the players is an insult to them,\" Tawde, who also holds Higher and Technical Education portfolios, said.Ms De had criticised Indian athletes in a tweet and said their aim was only to click selfies and return without any medal.The tweet angered many who slammed and trolled her on Twitter.Following the backlash, Ms De had come up with another tweet putting the blame on officials and not on the athletes.\"Official apathy main reason why we fare so poorly during every Olympics, not just Rio. Difficult for athletes to 'compete' with this hurdle,\" she had tweeted.", "url": "https://www.ndtv.com/india-news/shobhaa-de-has-insulted-sportspersons-says-maharashtra-sports-minister-vinod-tawde-1442670", "source": "www.ndtv.com"},
{"title": "Maharashtra Government allots Ajinkya Rahane Bandra plot left unused by Gavaskar to set up sports facility", "author": "- Metla Sudha Sekhar, It Specialist, - Zafer Mukeri, Founder- Inara Marketers, - Elearnmarkets, Financial Education Stockedge, - Tanusree De, Managing Director- Accenture Technology Lead, Trustworthy Ai Center Of Excellence, - Sachenkumar Rai", "published_date": "Unknown", "content": "You Might Also Like: Kamindu Mendis equals Pakistan player's rare record, as his ton places Sri Lanka in commanding position against Kiwis\n\nYou Might Also Like: Rishabh Pant equals MS Dhoni's record with century in Test comeback\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our Economic Times WhatsApp channel\n\nIndian middle-order veteran batter Ajinkya Rahane has been allotted a plot of land in Bandra , left unused by cricket icon Sunil Gavaskar , to set up a well-equipped sports facility, which includes a cricket academy.As per a statement from the Maharashtra cabinet, the decision was taken during a meeting of the cabinet held on Monday, which was presided over by Chief Minister Eknath Shinde A 2,000 square-meter plot at Bandra Reclamation will be leased to Rahane for thirty years, as per the statement. Earlier this same plot was allotted to cricketer Sunil Gavaskar in 1988 for an indoor cricket centre. But since no work was done on this plot, the government had taken it back in 2022.The current condition of this plot is bad, and the nearby slum dwellers are using it for unnecessary activities.The Maharashtra Housing and Area Development Authority (MHADA) authority had earlier passed a resolution and recommended giving this plot to Rahane, and the same proposal of MHADA was approved by the state cabinet on Monday.Rahane took to Instagram and thanked the government for the allocation of plot in a story.Since his international debut in 2011, Rahane has represented the country in all three formats of the game, scoring 8,414 runs in 195 matches and 251 innings at an average of 35.95, with 15 centuries and 51 fifties. His best score was 188.The 36-year-old is best known for his ability to craft long innings in Tests, scoring 5,077 runs in 85 Tests at an average of 38.46, with 12 centuries and 26 fifties and a best score of 188. In 90 ODIs, he scored 2,962 runs in 87 innings at an average of 35.26, with three centuries and 24 fifties to his name. His best score was 111. In 20 T20I matches for India, he scored 375 runs at an average of 20.83, with one fifty to his name.Rahane last played for India in a Test match against the West Indies in July last year.The veteran recently featured for Leicestershire in the County Championship Division Two and the One Day Cup. In three County Championship appearances, he has scored 202 runs at an average of 33.66, with a century to his name in six innings and a best score of 102.In 10 One Day Cup matches, he scored 378 runs at an average of 42.00, with four half-centuries to his name and a best score of 71.Rahane is a legendary name in Mumbai 's first-class circuit , scoring 13,427 runs in 191 first-class matches at an average of 45.51, with 40 centuries and 57 fifties in 324 innings and best score of 265*. (ANI)", "url": "https://economictimes.indiatimes.com/news/sports/maharashtra-govt-allots-ajinkya-rahane-bandra-plot-left-unused-by-gavaskar-to-set-up-sports-facility/articleshow/113619275.cms?from=mdr", "source": "economictimes.indiatimes.com"},
{"title": "SARAL", "author": "Unknown", "published_date": "Unknown", "content": "Maharashtra Education Portal : SARAL 2.0 - Systematic Administrative Reforms for Achieving Learning by Students (Official Website)\n\nInformation of teaching and non teaching staff\n\n© हे शालेय शिक्षण व क्रीडा विभागाचे अधिकृत संकेतस्थळ आहे. सर्व हक्क सुरक्षित.\n\n©2023 This is the official website of School Education and Sports Department, Govt of Maharashtra.All Rights Reserved.", "url": "https://education.maharashtra.gov.in/", "source": "education.maharashtra.gov.in"},
{"title": "E-Paper", "author": "Unknown", "published_date": "Unknown", "content": "", "url": "https://dailymaharashtrasports.in/", "source": "dailymaharashtrasports.in"},
{"title": "DFL signs MoU with the Government of the State of Maharashtra to further strengthen Indian football", "author": "Get It Now On The App Store", "published_date": "2023-08-29", "content": "Agreement focuses on advancing the football expertise and professionalising structures within the state of Maharashtra\n\nThis MoU underlines the Bundesliga’s commitment towards growing the football ecosystem in India\n\n29 August 2023 – The DFL Deutsche Fußball Liga has entered into a broader collaboration with the Government of the State of Maharashtra, after a Memorandum of Understanding (MoU) was signed on 28 August by Commissioner of Sports and Youth Services Dr. Suhas Diwase as part of the prestigious Shree Shiv Chhatarapati Awards ceremony in Pune, India. A delegation representing the Bundesliga attended the ceremony and witnessed the signing of the MoU in the esteemed presence of major dignitaries from the Government of Maharashtra including: Governor Mr. Ramesh Bais, Chief Minister Mr. Eknath Shinde, Deputy Chief Minister Mr. Devendra Fadnavis, Deputy Chief Minister Mr. Ajit Pawar, Minister of Co-operation Mr. Dilip Walse Patil, Minister of Higher and Technical Education Mr. Chandrakant Patil, Minister of Rural Development Mr. Girish Mahajan, Sports Minister Mr. Sanjay Bansode & Principal Secretary of School Education & Sports.\n\nEmblem of the State Government of Maharashtra\n\nThe MoU lays out three core elements to support the advancement of football within the state of Maharashtra: improving the technical and sporting expertise at all levels within clubs, associations, colleges and schools; strengthening football structures across the Indian subcontinent; and specifically supporting the progression of football within the Maharashtra district.\n\nThe Directorate of Sports & Youth Services serves as part of the Government of the State of Maharashtra but acts as an independent body, established in 1970 and focused on the instillation and promotion of sports, youth welfare and physical education within the mainstream education sector. The goal of the organisation is to boost the role of sport at all levels across the state, as well as nurturing burgeoning talent to help young people achieve their potential at national and international level.\n\nPeer Naubert, Bundesliga International Chief Marketing Officer, said: “We know the shared love that Indian and German sports fans have from a young age; passionate fan culture that is passed from generation to generation. We have seen that passion specifically for German football: the Bundesliga is the fastest growing league across the Indian subcontinent and our live audience numbers have doubled in the past two seasons, highlighting the commitment fans have for their favourite clubs.\n\nThrough this agreement, and the work we are doing with our partners throughout India, we want to promote the advancement of Indian football wholeheartedly. Peer Naubert, Bundesliga International Chief Marketing Officer\n\n“The Bundesliga is renowned for developing youth talent into global stars, with players not just from Germany but from around the world. Our efforts are not limited to the academies in Germany however; we are committed to supporting leagues, federations and countries for the growth of global football. Through this agreement, and the work we are doing with our partners throughout India, we want to promote the advancement of Indian football wholeheartedly, and hope to see Indian footballers make it to Germany in the coming years.”\n\nCommissioner of Sports and Youth Services Dr. Suhas Diwase said: “The signing of this MoU not only marks the official beginning of our partnership but also serves as a testament of our commitment to growth of sports and athlete welfare. We are confident that our combined efforts will lead to a prosperous future and an effective value exchange mechanism for the athletes of our sporting communities.”", "url": "https://www.dfl.de/en/news/dfl-signs-mou-with-the-government-of-the-state-of-maharashtra-to-further-strengthen-indian-football/", "source": "www.dfl.de"},
{"title": "Mumbai to boast of a sports excellence centre", "author": "Unknown", "published_date": "Unknown", "content": "Mumbai to boast of a sports excellence centre\n\nThe establishment of this state-of-the-art facility is a significant stride towards revolutionising Indian sports infrastructure.", "url": "https://www.deccanherald.com/india/maharashtra/mumbai-to-boast-of-a-sports-excellence-centre-3222095", "source": "www.deccanherald.com"},
{"title": "Maharashtra Sports – Just another WordPress site", "author": "Unknown", "published_date": "Unknown", "content": "Everyday our entire team works to deliver you our skills, knowledge and passion", "url": "https://maharashtrasport.in/", "source": "maharashtrasport.in"},
{"title": "Sports News: Latest Coverage & Score Update on Cricket, Hockey, Football", "author": "Unknown", "published_date": "Unknown", "content": "What's the bloody big deal with them being there? asks Jatin Sapru on cricketers- WAGs brouhaha", "url": "https://mumbaimirror.indiatimes.com/sports", "source": "mumbaimirror.indiatimes.com"},
{"title": "Latest News Updates Maharashtra Cricket Team - NDTV Sports", "author": "Unknown", "published_date": "Unknown", "content": "Nov 18, 2015\n\nPress Trust of India\n\nRanji Trophy: Bengal Earn Three Points Against Maharashtra\n\nBengal took a crucial 102-run lead after Maharashtra were bowled out for 406 in reply to 526/8d. Bengal scored 100 for in their second innings as the match ended in a draw.", "url": "https://sports.ndtv.com/cricket/teams/66066-mah-teamprofile/news", "source": "sports.ndtv.com"},
{"title": "Income Tax Department – Mumbai Region", "author": "Unknown", "published_date": "Unknown", "content": "Heartiest Congratulations to Ms. Rubina Francis and Shri Ajeet Singh, both Inspectors of Income Tax Mumbai on being honoured with the prestigious Arjuna Award for their exceptional achievements in Sports !", "url": "https://www.incometaxmumbai.gov.in/", "source": "www.incometaxmumbai.gov.in"},
{"title": "MCA :: Mumbai Cricket Association", "author": "Unknown", "published_date": "Unknown", "content": "Your feedback is important to us\n\nWe have changed the design for a better user experience.\n\nRevamping of the website is in process, kindly bear with us.", "url": "https://www.mumbaicricket.com/mca/index.php", "source": "www.mumbaicricket.com"},
{"title": "Maharashtra government allots plot to Rahane for developing sports complex", "author": "Unknown", "published_date": "2024-09-24", "content": "Mumbai: The Maharashtra cabinet on Monday approved the transfer of a 2,000 square meter land parcel in the upscale Bandra area of Mumbai on lease to ex-Indian captain Ajinkya Rahane to develop a sports complex.\n\n\n\nThe plot was originally allotted to Indian cricket legend Sunil Gavaskar in 1988 for setting up an indoor training academy, but he could not utilise it for more than 30 years.\n\nThe Maharashtra cabinet has cleared a proposal by the Revenue Department to hand over the land parcel to Rahane on a 30-year lease to develop state-of-the-art sports facilities, an official said.\n\nADVERTISEMENT\n\nThe government stated that the plot is in poor condition as slum dwellers have been using it for unwarranted work.\n\nA resolution to hand over the plot on lease to Rahane was passed by the Maharashtra Housing and Area Development Authority, which was approved by the council of ministers.\n\nFormer state Housing Minister Jitendra Awhad in 2021 highlighted the non-utilisation of the plot by Gavaskar.\n\nADVERTISEMENT\n\n\"I had almost decided to cancel the allotment of the 2,000 sq metre plot located in Bandra. Despite its huge size and prime location, the proposed cricket academy has not yet been established. I did not cancel the allotment because of Gavaskar's stature and his great contribution to the game,\" Awhad had stated earlier.\n\nThe plot was given to Gavaskar for setting up a cricket academy and he should utilise it for that purpose, he had said.\n\nThis plot, allotted to Sunil Gavaskar Cricket Foundation Trust, was returned to the state government by the former opener in May, 2022.", "url": "https://www.onmanorama.com/sports/cricket/2024/09/24/maharashtra-government-allots-plot-to-rahane-for-developing-sports-complex.html", "source": "www.onmanorama.com"},
{"title": "Maharashtra govt felicitates state cricketers featured in India's T20 WC glory; announces Rs 11 crore prize", "author": "India Tv News, New Delhi", "published_date": "2024-07-05", "content": "Maharashtra govt felicitates state cricketers featured in India's T20 WC glory; announces Rs 11 crore prize Mumbai cricketers Rohit Sharma, Yashasvi Jaiswal, Shivam Dube and Suryakumar Yadav played crucial roles in team India's T20 World Cup 2024 success and were felicitated by Maharashtra Chief Minister Eknath Shinde in Mumbai on Friday.\n\nMaharashtra Chief Minister Eknath Shinde hosted state cricketers featured in India's T20 World Cup 2024 team at his house in Mumbai on Friday, July 5. Maharashtra CM felicitated Rohit Sharma, Suryakumar Yadav, Shivam Dube and Yashasvi Jaiswal for their roles in India's T20 World Cup glory and announced INR 11 crore prize money for the entire team.\n\nIndian cricketers and fans celebrated the T20 World Cup 2024 success with a grand victory parade and a welcome event at Wankhede Stadium in Mumbai on Thursday. Eknath Shinde invited cricketers linked with the Mumbai Cricket Association and bowling coach Paras Mhambrey at Varsha Bungalow, the official residence of the Chief Minister of Maharashtra situated in the Malabar Hills area.\n\nThe Maharashtra government also invited cricketers at Vidhan Sabha in Mumbai to felicitate in front of the Legislative Assembly. Rohit Sharma received a warm welcome from members of Maharashtra's Legislative Assembly. The Indian World Cup-winning captain delivered a speech and thanked CM Eknath Shinde for inviting him and his teammates.\n\n\"A big hello to everyone, thank you CM sir for inviting us here,\" Rohit said. \"He just informed me that this is the first event here and we are very happy about it. We players are also very happy after seeing it all in Mumbai yesterday. It was our 11-year-old wait for the World Cup, we last won the ICC trophy in 2013. I am very thankful to my teammates, not just Dube, Surya and Yashasvi but everyone who contributed to India's success. I was lucky to have such a team, everyone was solid in their efforts. Everyone stepped up when an opportunity arrived.\"\n\nMaharashtra Deputy CM Devendra Fadnavis praised Rohit for writing his name in history books.\n\n\"Rohit gave us good and bad news on the same day,\" Devendra Fadnavis said. \"He won the T20 World Cup but also announced his retirement from T20 international format. His name is permanently etched in the history of Indian cricket.\"", "url": "https://www.indiatvnews.com/sports/cricket/maharashtra-cm-eknath-shinde-felicitates-mumbai-cricketers-who-led-india-to-t20-world-cup-2024-glory-2024-07-05-940428", "source": "www.indiatvnews.com"},
{"title": "Get digital access to Daily Maharashtra Sports Newspaper", "author": "Unknown", "published_date": "Unknown", "content": "(OR)\n\nSubscribe only to Daily Maharashtra Sports\n\nSubscription plans are currently unavailable for this magazine. If you are a Magzter GOLD user, you can read all the back issues with your subscription. If you are not a Magzter GOLD user, you can purchase the back issues and read them.", "url": "https://www.magzter.com/en/IN/Sai-Maharashtra-Sports-Digital-Media-LLP/Daily-Maharashtra-Sports/Newspaper/", "source": "www.magzter.com"},
{"title": "Top Mumbai, Maharashtra Sports Companies 2025", "author": "Unknown", "published_date": "Unknown", "content": "Sports\n\nMumbai, Maharashtra, IND 32 Employees\n\nWe plan, You Play! KheloMore is a digital platform bringing together the largest community of recreational and semi-professional sports participants. Be it a busy working professional wanting to play a game of box cricket or a parent looking for a credible coach for his/her child, KheloMore App enables a seamless booking experience for one and all. KheloMore is all about helping you as a parent, or sports fanatic to explore your child’s, or your own, first step into the land of sports; or further enhance the existing game-skills. Not just that, Khelomore is also about turning your school-time sporty memories into a live-action and fitness routine, for the busy professional in you! Up and running since April 2017, KheloMore is an aggregating platform of sports venues such as football/cricket turfs, badminton courts, coaches, academies, running events and tournaments. Khelomore also allows you to Pay and Play at your convenient sports venues. Pay and Play is an innovative product where the user can select any venue they desire to play on and just simply pay for it, to play right away. There is no hassle of lengthy registration, no withdrawal wait times, just healthy gaming. Additionally, Khelomore has a special feature -- KheloMore@home, a private and group sports training programs for children who can learn sports of their choice from the safety of their residence. Our credible and certified sports coaches across sports like Cricket, Football, Basketball, Fitness, Martial Arts, Badminton, Skating, Squash, Chess, and Tennis will deliver a fun and experiential training program to help children stay fit and healthy. Our coaches follow all safety procedures while delivering the session to the trainee. Therefore, we feel Khelomore is the need of the hour; a unique, never before seen anywhere else in the world, first ever platform of its kind!", "url": "https://builtinmumbai.in/companies/type/sports-companies", "source": "builtinmumbai.in"},
{"title": "Maharashtra minister Sunil Kedar 'hopeful' of crowds at four venues of IPL 2022 matches", "author": "Unknown", "published_date": "2022-02-26", "content": "As many as 20 games each will be held at Wankhede and DY Patil, while 15 each will be hosted at Brabourne and Gahunje Stadium. \"It is our good fortune that all the (league) matches will be held in Maharashtra, in Pune and Mumbai. Being the Sports Minister of the state, I am thankful to the BCCI. With regard to bubbles and restrictions, and also how many people will be allowed to watch the games there, all those things, we will work that out as per the international rules,\" said Kedar.", "url": "https://www.newindianexpress.com/sport/ipl/news/2022/Feb/26/maharashtra-ministersunil-kedarhopeful-of-crowds-at-four-venues-ofipl-2022matches-2424072.html", "source": "www.newindianexpress.com"},
{"title": "Maharashtra Athletics Association", "author": "Unknown", "published_date": "Unknown", "content": "Affiliated to Athletics Federation of India & Maharashtra Olympic Association\n\nReg No. F-602 Poona\n\n(Formerly Known as Maharashtra Amateur Athletics Association)", "url": "https://maharashtraathletics.in/", "source": "maharashtraathletics.in"},
{"title": "Maharashtra Cricket Team", "author": "Unknown", "published_date": "Unknown", "content": "Ranji Trophy round-up: Andhra qualify after rare first-innings tie\n\nThe last round of group matches helped us go from 38 teams to only eight, with the quarter-finalists identified", "url": "https://www.espncricinfo.com/team/maharashtra-1905", "source": "www.espncricinfo.com"},
{"title": "School Education and Sports Department", "author": "Unknown", "published_date": "Unknown", "content": "The word 'teacher' represents knowledge; transfer of the knowledge from the teacher to the taught. In fact, the foundation that builds a person in life is to great extent based on the knowledge he gets from his teacher. If there is somebody other than our parents who plays an important role in our mental development, it's our teachers. Foradian pays a tribute to the positive and inspiring role that holds the ladder that we all climb as students.", "url": "https://tait2022.mahateacherrecruitment.org.in/Public/Home.aspx", "source": "tait2022.mahateacherrecruitment.org.in"},
{"title": "Maharashtra Sports Commissioner seeks 'strict action' against Rajvardhan Hangargekar for age fraud", "author": "Unknown", "published_date": "2022-02-19", "content": "Maharashtra Sports Commissioner seeks 'strict action' against Rajvardhan Hangargekar for age fraud\n\nIt is believed that the pacer had altered his birth date from January 10, 2001, to November 10, 2002, and was thus over-age when he competed in the U-19 World Cup\n\nMaharashtra State Sports Commissioner Omprakash Bakoria has written to the BCCI seeking \"strict action\" against India U-19 World Cup-winning member Rajvardhan Hangargekar for age fraud.\n\nIn a letter dated February 8, Bakoria wrote to BCCI secretary Jay Shah that the pacer had altered his birth date from January 10, 2001, to November 10, 2002, and was thus over-age when he competed in the recently-concluded U-19 World Cup.\n\n\"The conduct of Mr. Rajvardhan Hangangekar is against the sport's integrity and ethics. It deprives fair play and results into damages to the reputation of the nation. Therefore, you are requested to take strict action in accordance with the law,\" Bakoria wrote.\n\nThe letter has also been marked to secretary of Maharashtra Cricket Association Riyaz Bagban. Bakoria further wrote, \"As per the inquiry and the report, it reveals that Mr Rajvardhan Hangargekar has started his academic career at Terna Public School, Osmanabad. It is governed by the school code prescribed by the Government of Maharashtra.\"\n\n\"At the time of admission of Rajvardhan Hangargekar in 1st standard at Terna Public School (primary division) Osmanabad, the date of birth is provided as 10/01/2001. The school record speaks that the birth date of Mr Rajvardhan Hangagekar up to seventh standard is recorded as 10/01/2001.\"\n\nThe commissioner alleged that the school made \"unauthorised corrections\" to Hangargekar's birth date. \"As per the general register maintained by the Terna Public School, Osmanabad, his birth date is 10/01/2001. It appears unauthorised corrections (were) made by the Head Master and his birth date is recorded as 10/11/2002 at the time of fresh application for 8th standard.\"\n\n\"If the headmaster requires any corrections in the birth date, it is necessary to take prior permission of the education officer of the concerned district. However, no such permission has been taken for making changes in the birth date of Mr. Rajvardhan Hangargekar.\n\n\"Therefore said corrections are made in excess of power and amount to cheating and forgery in government records,\" the senior IAS officer stated.\n\nLast week, Hangargekar was bought by Chennai Super Kings for Rs 1.5 crore at the IPL 2022 mega auction. \"On the basis of the fabricated record, Mr Rajvardhan Hangargekar seems to have secured a position in the national team of India. As per the report of Chief Executive Officer (IAS) Zilla Parishad, Osmanabad, the birth date of said player is 10/01/2001 and therefore, he has completed 21 years of age at the time of the tournament.\n\n\"Despite the fact, he has secured a position in the U19 team participating in the ICC (U-19) World Cup 2022.\"\n\nThe PTI tried to contact Maharashtra Cricket Association secretary Bagban and Hangargekar for a response, but both could not be reached. Earlier Manjot Karla, who struck a match-winning century in the final of 2018 U-19 World Cup, was banned for two years from playing for Delhi, for age fraud.\n\nIn September 2011, Maharashtra's Ankit Bawne was removed from India U-19 squad after the date of birth in his passport did not match with the one in his birth certificate and the BCCI records.", "url": "https://www.cricket.com/news/maharashtra-sports-commissioner-seeks-strict-action-against-rajvardhan-hangargekar-for-age-fraud-1645254684051", "source": "www.cricket.com"},
{"title": "Latest maharashtra Indian State tender news", "author": "Unknown", "published_date": "Unknown", "content": "3126052250221 21-Feb-2025 13-Mar-2025 MAHARASHTRA Refer Document. positive air pressurized ( pap ) suit, gibberellic acid 0.001% l, cloth, disruptive pattern, uniform for vip security, spirometer, charge fire extinguisher co2 gas cartridge\n\nView Tender Detail\n\n3235217250221 21-Feb-2025 02-Mar-2025 Maharashtra INR 788872 to carry out electrical work at warje malwadi yethil police station\n\nView Tender Detail\n\n3144052250221 21-Feb-2025 22-Feb-2025 MAHARASHTRA Refer Document. shorts - sports, air walker / stroller - outdoor gym equipment, track suit - sports, equipment camouflage scrim garnishing dyed (defence), sports probiotics powder, sports trophies-handicraft, equipment camouflage scrim garnishing undyed (defence),\n\nView Tender Detail\n\n1330716250221 21-Feb-2025 24-Feb-2025 Maharashtra Refer Document. sports generic kit\n\nView Tender Detail\n\n1335316250221 21-Feb-2025 24-Feb-2025 Maharashtra Refer Document. round 22-ti alloy gr tial6v4\n\nView Tender Detail\n\n1334916250221 21-Feb-2025 24-Feb-2025 Maharashtra Refer Document. round 115-en10269 gr nicr20tial\n\nView Tender Detail\n\n1321516250221 21-Feb-2025 24-Feb-2025 maharashtra Refer Document. switch mode power supply unit,battery 12v - 7.2 ah\n\nView Tender Detail\n\n1339216250221 21-Feb-2025 25-Feb-2025 Maharashtra Refer Document. retaining ring,oe9716614330-retaining ring\n\nView Tender Detail\n\n1300052250221 21-Feb-2025 05-Mar-2025 MAHARASHTRA Refer Document. table tennis - table,table tennis practice robot\n\nView Tender Detail\n\n1319416250221 21-Feb-2025 22-Feb-2025 Maharashtra Refer Document. 71.06. 10.055. 5 - 5g is smart mobile phone\n\nView Tender Detail\n\n1332116250221 21-Feb-2025 24-Feb-2025 Maharashtra Refer Document. stock register with manual printing 6 quire,office spring flat file,aluminium foil,thermal lable\n\nView Tender Detail\n\n1341716250221 21-Feb-2025 14-Mar-2025 Maharashtra Refer Document. canagliflocin 100 mg tab\n\nView Tender Detail\n\n1336916250221 21-Feb-2025 24-Feb-2025 Maharashtra Refer Document. round 63-ss-gr x19crmonbvn11-1 h & t,hy1090285230-round 90-ss-gr x19crmonbvn11-1 h & t\n\nView Tender Detail\n\n1323716250221 21-Feb-2025 26-Feb-2025 Maharashtra Refer Document. blood tubing set for hemodiafiltration,endotoxin cut filter for hemodiafiltration,bicarbonate cartr\n\nView Tender Detail\n\n1331616250221 21-Feb-2025 22-Feb-2025 Maharashtra Refer Document. electronic trunk protector gen 2,electronic trunk transmitter gen 2,generation 2 software,charger,b\n\nView Tender Detail\n\n1317916250221 21-Feb-2025 26-Feb-2025 MAHARASHTRA Refer Document. high preci 0.2s class abt energy meter,control metering panel,pt changeover switch,gsm modem\n\nView Tender Detail\n\n1317816250221 21-Feb-2025 21-Feb-2025 Maharashtra Refer Document. security camera close circuit camera 4 mp ip cctv day night weather proof ip67 50 mtr ir,recorder n\n\nView Tender Detail\n\n1317716250221 21-Feb-2025 26-Feb-2025 Maharashtra Refer Document. gamma irradiated high flux dialyzer having synthetic membrane 1 point5 m2,gamma irradiated high flu\n\nView Tender Detail\n\n1322116250221 21-Feb-2025 24-Feb-2025 Maharashtra Refer Document. installation of playground equipment at open space under vaishishtyapurn yojana, m. c. gondia.\n\nView Tender Detail\n\n1317516250221 21-Feb-2025 27-Feb-2025 Maharashtra Refer Document. extend stem valve gear box\n\nView Tender Detail\n\n1162816250221 21-Feb-2025 13-Mar-2025 Maharashtra Refer Document. golf set for ladies,yamaha keyboard,acoustic guitar,kolthari,kathiyum and thalayum,urmi\n\nView Tender Detail\n\n1006016250221 21-Feb-2025 27-Feb-2025 MAHARASHTRA Refer Document. custom bid for material procurement of workforce position tracking system at heera offshore platfor\n\nView Tender Detail\n\n3631616250220 20-Feb-2025 24-Feb-2025 Maharashtra Refer Document. supply of souvenirs\n\nView Tender Detail\n\n3623316250220 20-Feb-2025 26-Feb-2025 Maharashtra INR 380719 repairs and maintenance of child friendly park ( balsnehi udyan) / playground\n\nView Tender Detail\n\n3578616250220 20-Feb-2025 04-Mar-2025 Maharashtra INR 1512980 construction of road\n\nView Tender Detail\n\n3520316250220 20-Feb-2025 12-Mar-2025 Maharashtra Refer Document. pu moulded sach foot size s 25cm rt,pu moulded sach foot size s 26cm rt,pu moulded sach foot size s\n\nView Tender Detail\n\n3519916250220 20-Feb-2025 12-Mar-2025 Maharashtra Refer Document. m-seal,buckle fb 1 1 by 4 inch,leather cow lining med,suspension sleeve bk large,leather cow linnin\n\nView Tender Detail\n\n3519516250220 20-Feb-2025 12-Mar-2025 Maharashtra Refer Document. commercial treadmill 4 hp,cross trainer,spin bike,vinyle dumbbell 1 kg,vinyle dumbbell 2 kg,vinyle\n\nView Tender Detail\n\n3519016250220 20-Feb-2025 12-Mar-2025 Maharashtra Refer Document. hose cqa hv 507-725 e,lv1 r72 5365720173040 ring spring,lv1 r72 5930720081569\n\nView Tender Detail\n\n3518916250220 20-Feb-2025 12-Mar-2025 Maharashtra Refer Document. leather chrome black light,buckle fb 1 inch,leather softy black dark,leather crome black dark,cotto\n\nView Tender Detail\n\n3517716250220 20-Feb-2025 12-Mar-2025 Maharashtra Refer Document. calliper pad,shock observer assy,mod cover clip,realy cut off ac,flange shaft,bty cut off switch,su\n\nView Tender Detail\n\n3517016250220 20-Feb-2025 12-Mar-2025 Maharashtra Refer Document. cheetah xcel cat - 3 large\n\nView Tender Detail\n\n3293816250220 20-Feb-2025 12-Mar-2025 Maharashtra Refer Document. wind tunnel training for women\n\nView Tender Detail\n\n1584052250220 20-Feb-2025 01-Mar-2025 MAHARASHTRA INR 1622149 development of open space and making green gym with other allied works\n\nView Tender Detail\n\n1094052250220 20-Feb-2025 24-Feb-2025 MAHARASHTRA Refer Document. providing sports equipment to anganwadis\n\nView Tender Detail\n\n3337052250219 19-Feb-2025 25-Feb-2025 MAHARASHTRA INR 179846 preparation for ground beside mine hospital for various upcoming sports events\n\nView Tender Detail\n\n2698052250218 19-Feb-2025 08-Mar-2025 MAHARASHTRA INR 4851150 special repair of bldg no p11\n\nView Tender Detail\n\n2688052250218 19-Feb-2025 08-Mar-2025 MAHARASHTRA INR 4851150 special repair of bldg no p11\n\nView Tender Detail\n\n2674052250218 19-Feb-2025 08-Mar-2025 MAHARASHTRA INR 4851150 special repair of bldg no p11\n\nView Tender Detail\n\n2580052250219 19-Feb-2025 03-Mar-2025 MAHARASHTRA Refer Document. supply of sports equipment’s and materials\n\nView Tender Detail\n\n1337316250219 19-Feb-2025 25-Feb-2025 Maharashtra INR 500000 sports materials\n\nView Tender Detail\n\n1304716250219 19-Feb-2025 24-Feb-2025 Maharashtra INR 700000 providing , filling and leveling to various play ground for z p p school\n\nView Tender Detail\n\n1303216250219 19-Feb-2025 25-Feb-2025 Maharashtra/ Baramati Refer Document. construction of 4th floor for district sports complex baramati building, playground, interior furniture, eastern side retaining wall, internal roads, rain gutters, parking, construction of pathways taluka baramati, district pune.\n\nView Tender Detail\n\n1282516250219 19-Feb-2025 25-Feb-2025 Maharashtra/ Pune INR 12500000 request for proposal for hiring of agency for functioning of high-performance centre of athletics 3rd call at shiv chhatrapati sports complex, mahalunge balewadi\n\nView Tender Detail\n\n1192416250219 19-Feb-2025 11-Mar-2025 Maharashtra Refer Document. cheetah xcel cat - 3 large\n\nView Tender Detail\n\n1190016250219 19-Feb-2025 11-Mar-2025 MAHARASHTRA Refer Document. red chilies,garlic,coriander,turmeric,cumin seed,black pepper,cardamom,mustard,clove,tamarind\n\nView Tender Detail\n\n1189316250219 19-Feb-2025 11-Mar-2025 Maharashtra Refer Document. golf set,yamaha keyboard,acoustic guitar\n\nView Tender Detail\n\n965516250219 19-Feb-2025 11-Mar-2025 MAHARASHTRA Refer Document. electric cook top induction,biometric lock,revolving chair high back,revolving chair low back,confe\n\nView Tender Detail\n\n2598052250217 18-Feb-2025 25-Feb-2025 MAHARASHTRA Refer Document. gtg rubber diaphragm delhi class s190mm thk 8mm, ring, ring , cuff collar , shock absorber akcc 300 i x, cgt outer rubber diaphragm thick 8 mm, ring sealing packing , cgt inner rubber diaphragm id740 od1130 thick 7mm, cuff collar\n\nView Tender Detail", "url": "https://www.tendernews.com/tenders/sports-material-supplies/maharashtra.html", "source": "www.tendernews.com"},
{"title": "Football Maharashtra Center of Excellence inaugurated via video conferencing", "author": "Unknown", "published_date": "Unknown", "content": "AIFF Media Team\n\nMUMBAI: AIFF President and Chairman, LOC, AFC Women’s Asian Cup India 2022, Shri Praful Patel attended the virtual inauguration of two pitches by Shri Uddhav Thackeray, Chief Minister of Maharashtra, at the upcoming Football Maharashtra Center of Excellence CIDCO in Kharghar, Navi Mumbai.\n\nAlso present were Mr. Aditya Thackeray, Minister of Tourism, Government of Maharashtra, also the President of Mumbai District Football Association (MDFA), along with Mr. Eknath Shinde, Cabinet Minister of Urban Development.\n\nApart from the two world class training pitches, the upcoming state-of-the-art facility will also feature a High-Performance Center along with a 40,000 capacity FIFA approved stadium and also a golf course, rugby stadium and shooting range.\n\nThe training pitches will be handed over for use to the AFC for the Women’s Asian Cup India 2022 and will also feature at the FIFA U17 Women’s World Cup India 2022 in October.\n\n“On account of Makar Sankranti, it is a very auspicious time to inaugurate such a world class facility at the hands of such honourable people,” Mr. Patel averred. “I thank CIDCO for taking up this initiative for developing world class infrastructure and commend the great work they have put in to get it ready in such a short time.”\n\nHe also pointed out the city’s ability to consistently deliver for the big stage. “I am very happy to see the first world-class FIFA stadium coming up in Navi Mumbai which also played host to the FIFA U-17 World Cup in 2017 and will continue to do so for the Women’s Asian Cup 2022 and the FIFA U-17 Women’s World Cup in October,” said Mr. Patel.\n\nHe singled out Mr. Aditya Thackeray for his efforts, working together with him at the Western India Football Association (WIFA).\n\n“The Government of Maharashtra, along with Aditya have given us their fullest support in trying to make India a footballing nation,” he said. “I am happy to see that we are making efforts to bring football to all districts of Maharashtra.”\n\nMaharashtra Chief Minister Shri Uddhav Thackeray was elated at the prospect of contributing to this sporting project.\n\n“This is one of the happiest days of my life. We are always focused on work and sometimes we forget about hobbies. I am glad that we are encouraging outdoor sports again which I felt we were slightly lagging behind,” he said.\n\n“Our generation was engrossed in cricket, but this generation is crazy about football,” he continued. “Taking that into account, I am proud that everyone has come together to take this project forward which is very important for a healthy life.”\n\nMr. Thackeray recalled the time he was a spectator in a football stadium and experienced the atmosphere first hand. “I wish that one day we can put out an Indian team in a World Cup on this ground because of these facilities. We want to fulfill the dreams of young boys and girls through this facility,” he concluded.\n\n“I have discussed how to improve infrastructure for developing non-cricket sports and I am confident that under the leadership of the Maharashtra government, football will become the No.1 sport in Maharashtra,” concluded Mr. Patel.", "url": "https://www.the-aiff.com/article/football-maharashtra-center-of-excellence-inaugurated-via-video-conferencing", "source": "www.the-aiff.com"},
{"title": "Marathi News Maharashtra Times", "author": "Unknown", "published_date": "Unknown", "content": "Stay up to date with the latest Election news and happenings in Maharashtra with the Marathi News app. Our app brings you the most comprehensive coverage of news, current affairs, politics, entertainment, sports, and more, all in the Marathi language. Whether you're a native Marathi speaker or simply interested in staying updated on Marathi news, our app brings you a comprehensive source of reliable information right at your fingertips.\n\n\n\nFeatures:\n\n📰 Comprehensive Coverage: Get access to a wide range of news categories including politics, business, entertainment, sports, technology, and more. Our app ensures you never miss out on the stories that matter to you.\n\n\n\n🌐 Global and Local News: From international headlines to hyper-local happenings, we provide a balanced mix of news that keeps you connected to both global events and your local community.\n\n\n\n🌏Breaking News: Get instant updates on breaking news stories, ensuring you never miss out on important events and developments.\n\n\n\n🌆Local News: Stay informed about the latest news from your city or region, with dedicated sections for local news in Maharashtra.\n\n\n\nPersonalized News Feed: Customize your news feed based on your interests, ensuring you see the topics that matter most to you.\n\n\n\nNext Story: Read the next story easily in one click.\n\n\n\nCategories: Explore a wide range of categories including politics, business, technology, entertainment, sports, lifestyle, and more.\n\n\n\n🎥 Multimedia Content: Experience news like never before with photos, videos, and interactive content that bring stories to life.\n\n\n\n🎥Videos: Watch the most informative and entertaining Video clips\n\n\n\n🖼️Photos: Latest news in Photo Galleries of entertainment, sports, business, and lifestyle.\n\n\n\n🤳Offline Reading: Save articles to read later, even when you're offline, so you can catch up on the news at your convenience.\n\n\n\n📊 In-Depth Analysis: Dive deep into stories with in-depth analysis and perspectives, helping you understand the context and significance behind the news.\n\n\n\n📤Share News: Easily share interesting articles, videos, and news updates with your friends and family through various social media platforms.\n\n\n\n🔔 Customized Notifications: Stay updated in real-time with customizable notifications. Choose the topics you're interested in and receive alerts for breaking news and developments.\n\n\n\nEasy Navigation: Enjoy a user-friendly interface with smooth navigation, making it effortless to browse through news articles and categories.\n\n\n\n🌟 User-Friendly Interface: Our app features an intuitive and user-friendly interface that makes browsing news a breeze. Find what you're looking for quickly and easily.\n\n\n\nLanguage Support: Read news articles in the Marathi language, ensuring that you stay connected with news in your native language.\n\n\n\nWhy Choose MT Marathi News App?\n\nOur team of experienced journalists and editors work tirelessly to bring you accurate and timely news in the Marathi language.\n\n\n\n💡 Stay Ahead: By choosing the Marathi News App, you're taking a step towards being well-informed and ahead of the curve. Stay ahead in conversations, debates, and discussions with the latest insights.\n\n\n\n🔒 Trustworthy Source: Count on us for reliable and accurate news. Our team of dedicated journalists and editors are committed to delivering credible information that you can rely on.\n\n\n\n📱 Anytime, Anywhere: Access news on your terms. With our app, you can stay informed wherever you go, whenever you want. Whether you're at home, commuting, or traveling, the news is at your fingertips.\n\nUpdated on Jan 27, 2025", "url": "https://play.google.com/store/apps/details?id=com.mt.reader&hl=en_US", "source": "play.google.com"},
