[
    {
        "title": "Nike made a surprise comeback at the Super Bowl — and JPMorgan analysts broke the news",
        "author": "Ashley Rodriguez, Lloyd Lee",
        "published_date": "Unknown",
        "content": "Nike aired its first ad in the Super Bowl in 27 years on Sunday.\n\nThe brand's return to the big game comes as its new CEO looks to reverse a sales slump.\n\nIt has shaken up its marketing division and wants to create cultural moments to elevate its brands.\n\nNike made a surprise return as a Super Bowl advertiser for the first time in 27 years.\n\nJPMorgan analysts stole Nike's thunder by sharing the news in a research note published Thursday following a meeting with the brand's CEO and CFO.\n\nNike did not immediately respond to a request for comment from Business Insider.\n\nThe ad featured a who's who of women in sports, including track and field star Sha'Carri Richardson and WNBA player Caitlin Clark, over narration by Grammy-Award-winning rapper Doechii.\n\n\"You can't be demanding. You can't be relentless. You can't put yourself first,\" Doechii can be heard saying. \"So — put yourself first.\"\n\nThere’s one guarantee in sport. You’ll be told you can’t do it. So do it anyway.\n\n\n\nYou can’t win. So Win.\n\n\n\n🎤@justdoechii pic.twitter.com/2zbZRXEM8Q — Nike (@Nike) February 10, 2025\n\nNike said in a statement that the company \"has a starkly different perspective, offering a call to athletes across the globe: Do it anyway — and redefine the expectations of sport along the way.\"\n\nThe marketing push comes at a high-stakes moment for Nike, which has been struggling to revive lagging sales. And it's an expensive bet: Some Super Bowl advertisers have spent more than $8 million to secure 30 seconds of airtime.\n\nNike's new CEO, Elliott Hill, detailed a turnaround plan in December. Hill rejoined Nike in October after a four-year hiatus. He was formerly the company's president of marketplace and consumer.\n\nSince taking the helm, Hill has called out Nike for certain missteps, such as offering too many discounts and shifting attention away from its relationships with wholesalers.\n\nThe company is also trying to make iconic sneaker brands like Jordans and Air Force 1s hot again by pulling back on supply to boost demand.\n\nNike's revenue slid 8% year over year to $12.4 billion during the three months ending November 30, the company said in December. Nike shares are down roughly 30% over the last 12 months.\n\nNike has also shaken up its marketing department in recent months to elevate its brand storytelling, as Adweek previously reported. Several company veterans returned to or were elevated in the marketing organization over the last year, including former vice president Nicole Hubbard Graham who was named marketing chief.\n\nNike seems to be banking on big cultural moments to get its brand back on track.\n\nThe company debuted a new ad timed around this month's Grammy Awards that highlighted the legacy of its 40-year-old Jordan Brand.\n\nJPMorgan analysts met with Hill and Nike financial chief Matthew Friend at an event on Thursday morning. In a research note recapping the meet and greet, the analysts said Nike execs cited \"excitement\" around Hubbard's return and the brand's representation at \"large consumer moments,\" including the Jordan campaign and a planned Super Bowl ad.\n\nHill told investors in December that Nike had to \"get back to putting sport at the center of everything that we do.\" He said the company would invest in \"big, bold brand marketing efforts\" and important sports moments.",
        "word_count": 549,
        "url": "https://www.businessinsider.com/nike-returns-super-bowl-commercial-reverse-sales-slump-2025-2"
    },
    {
        "title": "Trump has a message to CEOs: Build in America or pay up",
        "author": "Hallam Bullock",
        "published_date": "Unknown",
        "content": "This excerpt originally appeared in the Business Insider Today newsletter.\n\nYou can sign up for Business Insider's daily newsletter here.\n\nPresident Donald Trump is making sure the whole world knows it: \"America is back and open for business.\"\n\nTrump appeared via videolink to speak at the World Economic Forum in Davos on Thursday, where he addressed some of the world's most powerful leaders. BI's Spriha Srivastava was in the room to witness the audience go from laughter to silence in seconds .\n\n\"My message to every business in the world is very simple: Come make your product in America,\" Trump said.\n\n\"If you don't make your product in America, which is your prerogative, then, very simply, you will have to pay a tariff,\" he added.\n\nTrump has previously threatened to impose a 25% tariff on goods from Canada and Mexico , which he said could begin as early as February 1.\n\nHe also proposed a 60% tariff on China during his presidential campaign, but he said earlier this week he was considering a 10% tariff on goods from the country next month.\n\nWhen Blackstone CEO Steve Schwarzman asked about Europe, Trump didn't hold back , voicing his frustration with European regulatory enforcement actions against tech giants like Apple, Google, and Meta (who were major donors to his inauguration and whose CEOs were prominent guests ).\n\n\"Whether you like them or not, they're American companies, and they shouldn't be doing that,\" Trump said.\n\nPresident Donald Trump signed an anti-DEI executive order on his first day in office. Anna Moneymaker/Getty Images\n\nTrump has plans for the corporate tax rate.\n\nBrian Moynihan, Bank of America's CEO, asked how the Trump administration would prioritize GDP growth and reducing inflation amid his dozens of executive orders .\n\nTrump said he would work to bring the corporate tax rate down to 15% from 21%, provided companies manufacture their products in the US.\n\nThe president also called out big banks, accusing them of discriminating against conservatives.\n\n\"Many conservatives complain that the banks are not allowing them to do business within the bank, and that included a place called Bank of America,\" he said.\n\nBank of America responded publicly , saying it welcomes conservatives among its 70 million clients.\n\nThe president also thanked Saudi Arabia after it announced it would invest $600 billion in the US , but Trump added that he would be asking the crown prince \"who's a fantastic guy, to round it out to around $1 trillion.\"\n\nWhen Trump finished, Schwarzman remarked: \"I'm sure the crown prince of Saudi Arabia will be really glad you gave this speech today.\"\n\nTrump's speech reminded Spriha of how different his style is from the measured, diplomatic tone that usually defines Davos. Whether his message landed the way he intended, however, is another question.\n\nBI's Katie Balevic, Dominick Reuter, Noah Sheidlower, and Allie Kelly have the full rundown of Trump's address .\n\nThe Insider Today team: Dan DeFrancesco, deputy editor and anchor, in New York. Grace Lett, editor, in Chicago. Ella Hopkins, associate editor, in London. Hallam Bullock, senior editor, in London. Amanda Yen, associate editor, in New York. Elizabeth Casolo, fellow, in Chicago. Lisa Ryan, executive editor, in New York.",
        "word_count": 532,
        "url": "https://www.businessinsider.com/trump-message-ceos-davos-america-business-2025-1"
    },
    {
        "title": "Andrew emails show contact with Epstein lasted longer",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Andrew emails show contact with Epstein lasted beyond 2010\n\nPrince Andrew has faced ongoing questions about his links to Jeffrey Epstein\n\nIn his BBC Newsnight interview, Prince Andrew had said he had not seen or spoken to Epstein after going to his house in New York in December 2010, a meeting which he described as a \"wrong decision\".\n\nThe court documents, from the UK's Financial Conduct Authority (FCA), show the email as being sent in February 2011.\n\n\"Keep in close touch and we'll play some more soon!!!!\" said an email sent to Epstein from a \"member of the British Royal Family\", believed to be Prince Andrew.\n\nThe Duke of York was in contact with the US sex offender Jeffrey Epstein longer than he had previously admitted, emails published in court documents appear to show.\n\nThe email was revealed in a court case involving the FCA and banker Jes Staley, who was banned from senior positions in the financial services industry over claims he had not fully revealed the extent of his relationship with Epstein.\n\nStaley had been CEO at Barclays, but left the bank following an investigation into his connection to Epstein, which he has said he deeply regretted.\n\nStaley is appealing against the FCA's ruling, but the financial regulator's evidence showing Staley's contact with Epstein also reveals emails relating to a \"member of the British Royal Family\".\n\nThese email exchanges between the royal and Epstein appear friendly and familiar.\n\nIn June 2010, Epstein emailed: \"If you can find time to show jes around with vera that would be fun.. he told me he ran into you tonight,\" in messages first reported by business news agency Bloomberg.\n\nThe Royal Family member responded by asking who Vera was, and a few days later Epstein replied: \"my future ex wife, i know jes and she would love to see home\". A dinner then seems to have been arranged.\n\nIn Prince Andrew's Newsnight interview, he was asked about the extent of his association with wealthy financier Epstein, a convicted sex offender who died in jail in 2019 while awaiting a further trial.\n\nThe prince said that he had ceased contact with Epstein \"after I was aware that he was under investigation and that was later in 2006 and I wasn't in touch with him again until 2010\".\n\nA photographer had captured Prince Andrew and Epstein walking together in New York's Central Park in December 2010, while the prince stayed at Epstein's house.\n\n\"Was that visit, December of 2010, the only time you saw him after he was convicted?\" interviewer Emily Maitlis had asked the royal.\n\nPrince Andrew replied \"yes\". Maitlis then asked: \"Did you see him or speak to him again?\", to which Andrew responded: \"No.\"\n\nBut emails a few months after that New York meeting suggest, if not a direct conversation, there were still friendly exchanges.\n\nAccording to the court documents, on 27 February 2011, Epstein emailed: \"jes staley will be in London on next tue afternoon, if you have time.\"\n\nThere was a reply from the \"member of the British Royal Family\" with a question: \"Jes is coming on 1st March or next week?\"\n\nThe court documents say there was a \"discussion of press articles\" and then the message: \"Keep in close touch and we'll play some more soon!!!!\"\n\nPrince Andrew is believed to have first met Epstein in 1999, through Epstein's friend Ghislaine Maxwell.\n\nThe following year, in June 2000, Epstein and Maxwell were among guests at a party at Windsor Castle. Later that year, Prince Andrew held a birthday party for Maxwell at Sandringham, with Epstein in attendance.\n\nThe relationship appeared to continue, with Epstein attending another Windsor Castle party in July 2006 - after which Prince Andrew said he stopped contact with Epstein until their December 2010 meeting.\n\nBetween those times, in 2008, Epstein was convicted in the US for procuring a minor for prostitution and was sentenced to 18 months in prison.\n\nAfter Epstein left prison, Prince Andrew met him in New York in 2010. Andrew said this meeting was to end their relationship.\n\nIn July 2019, Epstein was arrested on charges of the sex trafficking of minors. He died in prison in August 2019 while awaiting trial.\n\nIn November that year, Prince Andrew gave his Newsnight interview and in the subsequent fallout stepped down from royal duties.\n\nThe Duke of York's office has been contacted for comment.",
        "word_count": 731,
        "url": "https://www.bbc.com/news/articles/cp8qz22dqdzo"
    },
    {
        "title": "Traces of London’s first Roman basilica found beneath office basement",
        "author": "Mark Milligan, Mark Milligan Is Multi-Award-Winning Journalist, The Managing Editor At Heritagedaily. His Background Is In Archaeology, Computer Science, Having Written Over Articles Across Several Online Publications. Mark Is A Member Of The Association Of British Science Writers, Absw, The World Federation Of Science Journalists, In Was The Recipient Of The British Citizen Award For Education, The Bca Medal Of Honour, The Uk Prime Minister'S Points Of Light Award.",
        "published_date": "2025-02-12",
        "content": "Archaeologists from the Museum of London Archaeology (MOLA) have discovered traces of London’s first Roman basilica, dating back nearly 2,000-years.\n\nLondon, known as Londinium during the Roman period, was founded in AD 43 as a planned commercial port or civilian enterprise in what is now the City of London, the central business district of Greater London.\n\n- Advertisement -\n\nBetween AD 60 and 61, Queen Boudica of the Iceni led a formidable tribal alliance in a fierce revolt, devastating Londinium (London), Camulodunum (Colchester), and Verulamium (St Albans).\n\nIn the aftermath, Londinium was reconstructed as a planned settlement that followed the traditional Roman grid system. By the late 1st century AD, it had expanded into one of the largest cities in Roman Britannia, surpassing Camulodunum (Colchester) as the provincial capital.\n\nRecent excavations at 85 Gracechurch Street, an office block set for demolition and redevelopment, have revealed traces of the London’s first Roman basilica and forum.\n\nAccording to experts, the basilica was constructed around AD 80 and served as a public building for legal and administrative purposes, while the forum was a gathering place and centre for trade.\n\n- Advertisement -\n\nArchaeologists have discovered remnants of stone walls made from Kentish limestone, forming the foundation of the structure, which measures 40 by 20 by 12 metres.\n\nThe structure was only in use for around 20 years, where it was replaced by a much larger complex (one of the largest in the Roman Empire north of the Alps) during the 2nd century AD. Around this time, Londinium had reached its peak with around 45,000-60,000 inhabitants, covering an area of 330 acres north of the River Thames.\n\n“This is so significant – this is the heart of Roman London,” said Sophie Jackson, from the Museum of London Archaeology (Mola), who revealed the new find exclusively to BBC News.\n\nHeader Image Credit : Tony Jolliffe – BBC News\n\nSources : BBC",
        "word_count": 316,
        "url": "https://www.heritagedaily.com/2025/02/traces-of-londons-first-roman-basilica-found-beneath-office-basement/154534"
    },
    {
        "title": "Kevin Spacey told Guy Pearce to 'grow up' for saying he 'targeted' him while filming 'LA Confidential'",
        "author": "Eammon Jacobs",
        "published_date": "Unknown",
        "content": "Guy Pearce said Kevin Spacey \"targeted\" him on the set of \"L.A. Confidential\" in 1996.\n\nWhen Spacey was accused of sexual assault in 2017, Pearce said he \"broke down.\"\n\nSpacey responded in a video on X, telling Pearce to \"grow up.\"\n\nKevin Spacey responded to Guy Pearce accusing him of sexually harassing him on the 1996 set of the neo-noir thriller, \"L.A. Confidential,\" by telling him to \"grow up.\"\n\n\"L.A. Confidential\" tells the story of three police officers, played by Pearce, Spacey, and Russell Crowe, who investigate corruption and murder in 1950s Los Angeles.\n\nPearce, who stars in this year's Oscar-nominated movie \"The Brutalist,\" recalled working with Spacey on The Hollywood Reporter's \"Awards Chatter\" podcast. Pearce said he considers himself a victim, but added \"I was certainly not a victim by any means to the extent that other people have been to sexual predators.\"\n\nHe said he tried to ignore advances Spacey made toward him during production, without going into further detail.\n\nPearce said: \"I did that thing where you go: 'Ah, that's nothing. Ah, no, that's nothing.' I did that for five months, and really I was sort of scared of Kevin because he's quite an aggressive man.\n\n\"He's extremely charming and brilliant at what he does, really impressive, etc. He holds a room remarkably. But I was young and susceptible, and he targeted me, no question.\"\n\nHe added: \"I had a couple of confrontations with Kevin post-that, that got ugly.\" Pearce didn't specify what happened, when these alleged interactions were or their outcome.\n\nIn 2017, actor Anthony Rapp accused Spacey of sexually assaulting him at a party in 1986, when he was 14 years old.\n\nRapp sued Spacey in October 2022, but a jury found him not liable after a civil trial in New York.\n\nRapp's allegations were followed by others against Spacey, from men who worked in the film industry and at the Old Vic Theater in London, where Spacey was the artistic director from 2004 to 2015.\n\nRecalling hearing the news, Pearce said: \"I was in London working on something, and I heard this and I broke down and sobbed, and I couldn't stop.\n\n\"I think it really dawned on me the impact that had occurred and how I sort of brushed it off and how I had either shelved it or blocked it out or whatever. That was a really incredible wake-up call I suppose.\"\n\nIn 2024, Spacey responded to a documentary about the allegations: \"I take full responsibility for my past behaviour and my actions. But I cannot and will not take responsibility or apologise to anyone who's made up stuff about me or exaggerated stories about me.\"\n\nKevin Spacey told Guy Pearce to \"grow up\"\n\nOn Tuesday, Spacey responded to Pearce's comments in a video posted on X.\n\nHe said: \"We worked together a long time ago, if I did something then that upset you, you could've reached out to me, we could've had that conversation. But instead, you decided to speak to the press, who of course are now coming after me because they'd like to know what my response is to the things that you said. You really want to know what my response is? Grow up.\"\n\nGrow up, Guy Pearce. You are not a victim. pic.twitter.com/33paGTj4Aq — Kevin Spacey (@KevinSpacey) February 18, 2025\n\nDuring the video, Spacey also claimed that Pearce visited him on the set of \"Midnight in the Garden of Good and Evil\" in Savannah, Georgia in 1997 to spend time with him.\n\nRepresentatives for Pearce and Spacey did not respond to Business Insider's request for comment.",
        "word_count": 599,
        "url": "https://www.businessinsider.com/guy-pearce-kevin-spacey-targeted-broke-down-sexual-assault-2025-2"
    },
    {
        "title": "Rachel Reeves: What we've learned about her expenses and Labour response",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "What we've learned about Rachel Reeves's expenses - and the Labour response\n\n14 February 2025 Billy Kenber Politics investigations correspondent Sean Seddon BBC News\n\nReuters\n\nSince BBC News reported on Thursday that Rachel Reeves had exaggerated her online CV and had been investigated over her use of expenses while working at Halifax Bank of Scotland (HBOS), Labour colleagues have mounted a robust defence of the chancellor. Sir Keir Starmer said she had \"dealt with any issues that arise\" from the questions about her CV, and Health Secretary Wes Streeting told BBC Newsnight that she was doing a \"brilliant and difficult job\". But Labour figures have questioned our reporting on the expenses investigation, with one cabinet minister calling it totally inaccurate. Here we examine the key Labour responses and look at the evidence that supports our journalism.\n\nWhat did we reveal about Reeves's expenses?\n\nThe BBC News investigation revealed that concerns were raised about Reeves's expenses while working at HBOS between 2006 and 2009. A detailed six-page whistleblowing complaint was submitted, with dozens of pages of supporting documents including emails, receipts and memos. It accused Reeves and two other managers, one of whom was her boss, of using the bank's money to \"fund a lifestyle\", with spending on events, taxis and gifts, including for each other. We have seen these documents and spoken to more than 20 people, many of whom were former colleagues. The chancellor and her expenses before she became an MP\n\nWhat happened to the whistleblower's complaint?\n\nThe complaint led to an internal investigation by the bank's risk department. This was passed to internal audit, which reviewed the allegations and concluded that they were substantiated and there appeared to be evidence of wrongdoing by Reeves and her two colleagues, according to a senior source with direct knowledge of the investigation. What we have not been able to establish is what happened next and whether the bank ever reached a formal conclusion.\n\nHow are Labour defending Reeves?\n\nReeves has said she was not aware of an investigation or issue with her expenses and said she left the bank on good terms. She said her expenses had always been signed off in the proper way. The person who signed off her expenses, her boss, was also subject to the internal investigation. Other Labour figures have criticised BBC News's reporting on the story, with two MPs repeating similar attacks. On Friday, Science Secretary Peter Kyle told BBC Radio 4's Today programme that the reporting was \"inaccurate\". Both he and Siobhain McDonagh, a Labour MP who appeared on BBC's Politics Live on Thursday, raised comments by a former HR manager, Jane Wayper - which, they said, disproved the BBC News's story.\n\nEPA-EFE/REX/Shutterstock Science Secretary Peter Kyle has criticised the BBC's reporting on Rachel Reeves\n\nWhat did the HR manager say?\n\nWayper spoke to the BBC after being given permission to do so by Reeves's team. She provided an on-the-record statement which said she \"would have been made aware of any investigation which concluded there was a case to answer\" on the basis that she \"would have been required to organise and oversee a disciplinary process\". However, the BBC has not reported that the case reached a formal conclusion, or that there was disciplinary action. Kyle incorrectly claimed that the quote had not been included in our report - but it had been in the article since it was first published on Thursday morning. He also incorrectly referred to Wayper as the head of HR at the bank. In reality she was an HR business partner working in the department where Reeves worked.\n\nWhat has Reeves said?\n\nOn Friday, Reeves was asked about the expenses claims directly. She said: \"No-one ever raised any concerns about my expenses when I worked for Halifax Bank of Scotland.\" She said her expenses had been \"signed off in the proper way\" and \"no issues were ever raised\" during her time at the bank. Her expenses were signed off by her manager, who was also one of the three employees who were the subject of the expenses probe. Reeves left the bank in May 2009, as did her boss. The other senior manager was on sick leave in May and never returned to work at the bank. There is no suggestion any of the departures were linked to the investigation or spending issues and a spokesman for Reeves said the chancellor left the bank on good terms.\n\nWhat has BBC News established about her LinkedIn CV?",
        "word_count": 748,
        "url": "https://www.bbc.com/news/articles/cpvmg924nk1o"
    },
    {
        "title": "London’s first Roman basilica found under office basement",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Beginnings of Roman London discovered in office basement\n\n12 February 2025 Rebecca Morelle • @BBCMorelle Science Editor Alison Francis Senior Science Journalist\n\nTony Jolliffe/ BBC The wall is 2,000 years old and was part of Roman London's first basilica\n\nA discovery underneath the basement of an office block has been described as one of the most important pieces of Roman history unearthed in the city of London. Archaeologists have found a substantial piece of the ancient city's first basilica - a 2,000 year old public building where major political, economic and administrative decisions were made. The excavation has so far revealed sections of stone wall that formed the base of the basilica, which would have been two-and-a-half storeys high. The site, which will eventually be opened to the public, sheds light on the city's beginnings.\n\nTony Jolliffe/BBC Archaeologists found the Roman masonry under the concrete floor of the office\n\n\"This is so significant - this is the heart of Roman London,\" said Sophie Jackson, from the Museum of London Archaeology (Mola), who revealed the new find exclusively to BBC News. \"This building will tell us so much about the origins of London, why London grew and why it was chosen as the capital of Britain. It's just amazing.\"\n\nTony Jolliffe/ BBC News The wall is made of limestone from Kent\n\nThe site was discovered at 85 Gracechurch Street, an office building that's about to be demolished and redeveloped. Earlier archaeological investigations revealed the ancient basilica's approximate location, so the team created several small test pits to see what was hidden beneath the concrete floor. On the third attempt, digging between the filing cabinets, they struck lucky. \"You can see a huge chunk of Roman masonry, and it's incredible that it survives this well. We're absolutely thrilled that there's so much of it here,\" said Sophie Jackson.\n\nTony Jolliffe/BBC A tile is stamped and the three lines next to it are the finger marks of the tile maker\n\nThe wall is made from a type of limestone from Kent, and formed an imposing building - the basilica would have been about 40m long, 20m wide and 12m high. Other artefacts have been found too, including a roof tile imprinted with the stamp of an official from the ancient city.\n\nThe basilica was part of London's forum, a social and commercial hub with a courtyard that was about the size of a football pitch. \"The basilica is the town hall, and then in front of it was a big open market square with a range of shops and offices around the outside,\" explained Ms Jackson. \"It's the place you came to do business, to get your court case sorted out, it's where laws were made, and it's where decisions were made about London, but also about the rest of the country.\" It was built around 80 AD, just a few decades after the Romans invaded Britain and founded Londinium - the Roman name for the city. But the first basilica and forum were only in use for about 20 years. They were replaced by a much larger second forum, perhaps reflecting how quickly the city was growing in size and importance.\n\nPeter Marsden The basilica sits at the back of the Roman forum, which had an open courtyard\n\nThe discovery has meant a change of plans for the building's owners, Hertshten Properties. The Roman remains, which will now be fully excavated, are to be incorporated into the new offices - pending planning approval - and opened up to the public. For the architects, redesigning a building around an archaeological site has had some technical challenges. \"The scheme has been comprehensively adjusted,\" explained James Taylor from architecture firm Woods Bagot. \"Simple things like the columns have had to literally move position, so you're not destroying all these special stones that we found in the ground.\" And so as not to disturb what's there, fewer lifts can now be installed - and this has meant that the team has had to reduce the height of the building. But Mr Taylor said the effort will be worth it. \"To actually see people using and enjoying the space, moving through the public hall and down to see the remains, will be absolutely incredible.\"\n\nWoods Bagot An artist's impression of what the public will eventually be able to see",
        "word_count": 722,
        "url": "https://www.bbc.com/news/articles/cx2jdnv0ywyo"
    },
    {
        "title": "How the China tariffs will impact what US consumers pay for things",
        "author": "Dan Defrancesco",
        "published_date": "Unknown",
        "content": "This post originally appeared in the Business Insider Today newsletter.\n\nYou can sign up for Business Insider's daily newsletter here.\n\nGood morning. The US Agency for International Development, or USAID, will place nearly all of its direct-hire workforce on administrative leave starting Friday at midnight, according to an email sent to staff on Tuesday evening and posted on the agency's website.\n\nMeanwhile, in today's big story, we're breaking down how the China tariffs will impact what you pay for things .\n\nWhat's on deck\n\nMarkets: What Trump's plan for a US sovereign wealth fund could look like.\n\nTech: An Amazon VP reiterated the company's commitment to DEI initiatives in an internal meeting.\n\nBusiness: The White House says more than 20,000 federal workers have taken buyouts, and more will come .\n\nBut first, the tariff fight isn't over.\n\nIf this was forwarded to you, sign up here.\n\nThe big story\n\nThe cost of a trade war\n\nSAUL LOEB/AFP via Getty Images\n\nThe trade war between Washington and Beijing is set to take place in US consumers' wallets.\n\nFrom new phones to kitchen appliances and clothes, President Donald Trump's additional 10% tax on Chinese imports could result in a slew of higher prices , write Theron Mohamed and Ayelet Sheffey.\n\nWith China sending $427 billion in goods to the US in 2023 (the most recent year of full data), there are no shortages of things that will be affected by the tariffs.\n\nIt's not just expensive tech like computers and cellphones that's at risk. The closure of a loophole allowing importers to avoid taxes on shipments valued less than $800 when sent directly to consumers has left brands like Shein and Temu scrambling .\n\nConcerns about logistics continued yesterday when the US Postal Service said that it is suspending inbound parcels from China and Hong Kong until further notice , effective immediately. While only parcels are impacted, the suspension may cause exporters to use alternative logistics companies like DHL, UPS, and FedEx. That might cause a demand surge that could increase freight costs, an expert told BI.\n\nPDD Holdings, Temu's parent company, was down 6% in premarket trading this morning following the USPS announcement.\n\nCompanies haven't been shy about saying they'll need to raise prices due to tariffs , and the taxes also provide cover to juice their costs regardless of the tariffs' real impact.\n\nEven trade plans that might never come to fruition — Mexico and Canada — could still cause enough uncertainty that they disrupt supply chains, leading to higher prices .\n\nWith so many unknowns, some investors are hedging their bets using outcome ETFs and monitoring 21-day realized volatility to reduce downside risk while not completely cannibalizing their returns.\n\nIf that all sounds like a foreign language to you, there's always the prediction markets. Over there, you can wager on where some of President Trump's next tariffs might land .\n\nGetty Images; Jenny Chang-Rodriguez\n\nAnother corner of the economy is leaving US consumers feeling pretty beat.\n\nRising egg prices are so severe that Waffle House is charging a 50-cent fee for each egg it sells . The restaurant chain said it opted for a surcharge over a blanket price increase across its menu.\n\nThe eggs-tra fee is only supposed to be temporary, but this won't be over easy. Data from the US Department of Agriculture projects the average price for a dozen eggs won't drop from $4.80 to $2.50 until the second quarter .\n\nThat's not egg-celent news, but it's tough to blame anyone. As BI's Emily Stewart previously covered, a combination of bird flu and increased demand has scrambled the egg market .\n\nNews brief\n\nTop headlines\n\nWhat's happening today\n\nDisney, News Corp, Ford, and Uber report earnings.\n\nThe Insider Today team: Dan DeFrancesco, deputy editor and anchor, in New York. Grace Lett, editor, in Chicago. Ella Hopkins, associate editor, in London. Hallam Bullock, senior editor, in London. Amanda Yen, associate editor, in New York. Elizabeth Casolo, fellow, in Chicago.",
        "word_count": 662,
        "url": "https://www.businessinsider.com/how-china-tariffs-impact-us-consumer-wallets-2025-2"
    },
    {
        "title": "Microsoft is shutting down its flagship retail storefront in the UK — cuts lease short in the heart of London",
        "author": "Zac Bowden, Senior Editor, Laura Knotek, Social Links Navigation",
        "published_date": "2025-01-23",
        "content": "Microsoft's flagship UK \"Experience Centre\" storefront in London will close its doors next month, the company has confirmed. In a statement to Windows Central, a Microsoft spokesperson said \"To better align with its focus on digital growth, Microsoft has decided to exit the lease at the Microsoft Experience Centre in London early.\"\n\nThe 21,000 square foot Microsoft Store in London first opened in July 2019 to much fanfare. It was designed to be a hub for technology from both Microsoft and its partners, showcasing high-end hardware from third-party OEMs as well as the latest products from Surface and Xbox.\n\nThe store also included an Answer Desk and support area, where Surface and Xbox customers could bring their devices for technical support should they need it. With the only physical storefront now closing, this will no longer be an avenue for support for customers with Surface PCs or Xbox consoles.\n\nUnfortunately, even though the Microsoft Store is located in a prime location in the heart of London's Oxford Street, the store seemingly hasn’t seen much footfall since its original launch date. \"We regularly review our locations and our workforce to ensure we are aligning to market opportunities and make changes to meet the demands of the business\" said the Microsoft spokesperson.\n\nIn addition to being a storefront and experience centre, Microsoft also used the space for business meetings with partners and colleagues. The store featured three floors, with the first two being used as retail space, and the third floor consisting of meeting spaces that the company frequently used.\n\nThe closure of the Microsoft Store in the UK is another blow for Microsoft's consumer facing products and services, which will no longer have a home on the streets of London. The company has been significantly scaling back on Surface and consumer efforts in the last handful of years, and the UK Microsoft Store is the latest victim.",
        "word_count": 316,
        "url": "https://www.windowscentral.com/microsoft/microsoft-is-shutting-down-its-flagship-retail-storefront-in-the-uk-cuts-lease-short-in-the-heart-of-london"
    },
    {
        "title": "Russia could be allowed to keep its military bases, Syria says",
        "author": "Mia Jankowicz",
        "published_date": "Unknown",
        "content": "Syria is open to allowing Russia to hold onto two key military bases after Bashar Assad's ousting.\n\nSyria's new defense minister said that relations with Russia, which supported Assad, have improved.\n\nHmeimim and Tartus bases are strategic for Russia, offering major air and naval advantages.\n\nSyria is open to allowing Russia to keep hold of its two military bases in the country, two months after rebel groups ousted Kremlin ally Bashar Assad and set in motion a Russian troop and military equipment withdrawal.\n\nIn an interview with the Washington Post, Syrian Defense Minister Murhaf Abu Qasra said that there is a possibility Russia could hold onto the bases — Hmeimim air base and Tartus port — \"if we get benefits for Syria out of this.\"\n\nIt's not clear what military, economic, or political support could be offered, but Abu Qasra said that Russia's stance had \"improved significantly\" toward the new government.\n\nAssad, who ruled Syria for 24 years, fled to Russia in early December after a lightning two-week military campaign by rebel forces.\n\nThis threw Russia's hold on the bases — described by Andreas Krieg, a Gulf specialist at the Institute of Middle Eastern Studies at King's College London, as Russia's \"most important bases outside the direct sphere of Russian influence\" — into question.\n\nRussia was granted a 49-year lease on the bases in 2017 in return for military assistance.\n\nAt the end of January, Russian Deputy Foreign Minister Mikhail Bogdanov said that \"nothing has changed\" and that preserving Russian access to the bases \"requires additional negotiations,\" according to Russian state-controlled news agency TASS.\n\nPrior to his ousting, Assad had enjoyed strong military and political support from Russian President Vladimir Putin, who stationed troops there and helped suppress rebel areas and a 2015 uprising with air and missile strikes.\n\nWithin days of Assad's removal, satellite images picked up a flurry of Russian activity at the bases: equipment being packed up, ships moving in and out of port, and the likely transfer of soldiers.\n\nIn January, Ukraine said that Russia was moving military gear from Tartus to Libya, where it also has a strong influence.\n\nThe Syrian bases are a key foothold in the Middle East and beyond for Russia.\n\nHmeimim affords Russian air forces a base for refueling and overflight for much of Africa. Tartus, on the Mediterranean, is unique in Russia's assets in being its only warm-water port with direct access to the oceans.\n\nThe rebel groups now governing Syria were previously targetted by Russian forces, but Abu Qasra told the Post, \"in politics, there are no permanent enemies.\"\n\nOne trump card held by Russia is Assad himself. According to the Post, the new Syrian government wants Assad's extradition so that he can be held to account for his bloody rule.",
        "word_count": 462,
        "url": "https://www.businessinsider.com/russia-could-keep-hold-of-key-syria-military-bases-minister-2025-2"
    },
    {
        "title": "AI-enabled satellites could help the US evade a crippling cyber attack",
        "author": "Tom Porter",
        "published_date": "Unknown",
        "content": "The Pentagon is developing AI-enabled satellite technology.\n\nAI satellites offer advantages amid intensifying competition in space.\n\nThey could supercharge data analysis and help evade the consequences of a Chinese cyber-attack.\n\nA vast network of military satellites belonging to the US has long underpinned its dominance in space. But China is challenging the US status as the space superpower, and its satellite system is in the crosshairs.\n\nDefense News reported last month that the US Navy is moving forward with plans to build a network of fully autonomous satellites that are able to navigate independently without GPS or ground control.\n\nAnalysts say that AI could help the US stay ahead, providing its satellites with the capacity to evade the consequences of a potentially crippling attack, as well as more power to collect and analyze large amounts of data.\n\nThe race for satellite dominance\n\nThe stakes in the battle for satellite supremacy are high, Melanie Garson, an associate professor in International Conflict Resolution & International Security at University College London, told Business Insider.\n\nThe winner would control a vital aspect of space infrastructure, which would also provide an advantage in intelligence gathering and precision strikes in the event of a war.\n\nAI \"will provide additional capabilities for surveillance and espionage as well as being able to interfere with the other's space assets through spectrum warfare or cyberattacks,\" Garson said.\n\nThe US has hundreds of military satellites in orbit, with China and Russia not far behind.\n\nIf a war were to break out between the US and China, military experts say that China has the capability to do serious damage to US space-based assets through a range of anti-satellite, or ASAT, capabilities, including programming its satellites to attack others.\n\nA CIA report that leaked in 2023 said China was focusing its efforts in the event of a war on hacking the systems used to control US satellite networks.\n\nSystems confrontation and destruction warfare is believed to be a preferred Chinese military tactic for 21st-century warfare.\n\nCrippling these systems would leave satellites unable to transfer communications and data, or even coordinate with each other, the report said.\n\nRelated stories\n\nAI could be the key\n\nAI for satellites could be crucial to preserving US capabilities. Unlike satellites that require human input, autonomous satellites can operate independently, processing and analyzing data to make their own decisions.\n\nThe autonomy makes them less vulnerable to possible attacks on bases or communications networks or to being cut off from operators by electronic warfare like signal jamming, said Clayton Swope, deputy director of the Aerospace Security Project and a senior fellow in the Defense and Security Department at the Center for Strategic and International Studies.\n\n\"Decentralized decision-making may add resilience by decreasing the reliance on ground-based infrastructure,\" Krista Langeland, deputy lead of the RAND Space Enterprise Initiative, told BI. \"AI capabilities could also help with detection and characterization of an attack.\"\n\nAnother advantage is that AI could help process vast amounts of data in space, and identify potentially hostile satellites more quickly.\n\n\"Space is huge,\" Swope said, \"so AI will help satellites better understand what's happening around them and keep track of what other satellites are doing.\"\n\n\"That could help US satellites maneuver to avoid accidental collisions but also stay clear of potentially hostile adversarial satellites,\" he said.\n\nA distant goal\n\nThe power of the technology to revolutionize US satellite technology and security is significant, Alison Grey, a satellites expert at PA Consulting, told BI.\n\n\"Ultimately, AI-enabled automation can enable a network to react and recover from various threats in space,\" she said, \"whether that's from natural phenomena, anomalies in one's own system, or potentially hostile activity.\"\n\nHowever, while the technology is already being applied in some military satellites, realizing its full potential is likely to be some way off.\n\nSpace Force's former top acquisition official, Frank Calvelli, told an event last year that he expects satellites to be \"significantly more autonomous\" within the next 10 to 15 years.\n\nEven so, efforts are intensifying to begin realizing its potential. Defense News said that the US Navy is researching a fully autonomous model, the Autosat, and wants to take the tests further.\n\n\"We've done a demo of this and proven out the principles and are looking for the next step,\" Steven Meier, director of space technology at the Naval Research Laboratory, said at a recent summit in Virginia. \"We want to get funding to actually build a system along these lines and launch it.\"",
        "word_count": 743,
        "url": "https://www.businessinsider.com/ai-could-help-us-satellites-evade-crippling-cyber-attack-china-2025-2"
    },
    {
        "title": "Injured Patrick Page Out Of London ‘Hadestown’ Reunion But Will Return For Live Capture Taping",
        "author": "Greg Evans, .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow, Class, Wp-Block-Co-Authors-Plus, Display Inline, .Wp-Block-Co-Authors-Plus-Avatar, Where Img, Height Auto Max-Width, Vertical-Align Bottom .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow .Wp-Block-Co-Authors-Plus-Avatar, Vertical-Align Middle .Wp-Block-Co-Authors-Plus-Avatar Is .Alignleft .Alignright",
        "published_date": "2025-02-17",
        "content": "Patrick Page, Broadway‘s Tony-nominated Hades of Hadestown who was scheduled to join the other original production castmates in a monthlong West End reunion engagement this month, has withdrawn from the run due to a full rupture of his Achilles tendon.\n\nPage, however, will perform for the live capture pro-shot performances on February 28 and March 1. The filming of the original cast West End reunion was announced in January.\n\nIn an Instagram message, Page, pictured with his ankle in a cast (see it below) wrote, “Bad news first: my injury is a full rupture of the Achilles tendon. Obviously, that’s a serious business, and I will not be able to perform in the West End production. The role of Hades will be carried magnificently by Phillip Boykin.\n\n“The good news is that I WILL perform in the live capture pro-shot (including the live-audience performances 2/28 & 3/1) before returning to NYC for my surgery — so you will all be able to see the full OG cast perform together when the film is released.”\n\nWatch on Deadline\n\nAnaïs Mitchell’s Tony-winning Broadway musical, based on the Orpheus myth, opened on Broadway April 17, 2019, with the original cast including Reeve Carney as Orpheus, André De Shields as Hermes, Amber Gray as Persephone, Eva Noblezada as Eurydice and Page as Hades.\n\nThe Hadestown filming will take place at London’s Lyric Theatre across three performances on Friday, February 28 and both matinee and evening performances on Saturday March 1.\n\nHadestown, with a new London cast, opened to huge critical acclaim at the Lyric Theatre last February. It is produced in London by Mara Isaacs, Dale Franzen, Hunter Arnold, Tom Kirdahy and the National Theatre in association with JAS Theatricals.\n\nThe original Broadway cast – Carney, De Shields, Gray, Noblezada and Page – is appearing with the support of Equity UK, incorporating the Variety Artistes’ Federation, pursuant to an exchange program between American Equity and Equity UK.",
        "word_count": 323,
        "url": "https://deadline.com/2025/02/patrick-page-hadestown-london-1236292755/"
    },
    {
        "title": "Microsoft is closing its flagship London retail store",
        "author": "Mike Moore, Deputy Editor, Techradar Pro, Social Links Navigation",
        "published_date": "2025-01-28",
        "content": "Microsoft is closing its flagship London retail store\n\nOxford Circus \"Experience Centre\" will shut in February\n\nOpened in July 2019, it was part store, part demo zone, part press briefing space\n\nMicrosoft has announced it is closing its flagship physical retail store in London as part of apparent plans to scale back operations.\n\nThe company has confirmed the plans, telling Windows Central it will be ending its lease on London's Oxford Circus earlier than planned.\n\nThe 21,000 square foot store, set across three floors, will now be closing in February 2025 after six years in operation.\n\nMicrosoft closing London store\n\n\"To better align with its focus on digital growth, Microsoft has decided to exit the lease at the Microsoft Experience Centre in London early,\" a company spokesperson told Windows Central.\n\n\"We regularly review our locations and our workforce to ensure we are aligning to market opportunities and make changes to meet the demands of the business.\"\n\nThe store, set on one of London's busiest (and presumably most expensive) settings, first opened in July 2019. Located just a few spaces up from Apple's flagship London store, the centre was Microsoft's big pitch to show off its huge range of products and services from casual shoppers, with displays of Xbox and Surface hardware alongside third-party offerings.\n\nThe store also hosted a demo space and gaming zone, along with support desks for users encountering any issues with their Microsoft devices, similar to Apple's Genius Bar.\n\nAre you a pro? Subscribe to our newsletter Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nUpstairs, there were also meeting and conference facilities that TechRadar Pro visited on many occasions for launches and interviews.\n\nThe move means Microsoft will now no longer have a physical standalone presence in the UK capital, unlike Apple and Google, although its products will still be shown off in partner retailers across the city.\n\nA similar Microsoft Experience Centre remains in New York, but there's no news on whether this facility will stay open for the time being.",
        "word_count": 372,
        "url": "https://www.techradar.com/pro/microsoft-is-closing-its-flagship-london-retail-store"
    },
    {
        "title": "Kay Burley Retiring From Sky News After 36 Years",
        "author": "Jake Kanter, .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow, Class, Wp-Block-Co-Authors-Plus, Display Inline, .Wp-Block-Co-Authors-Plus-Avatar, Where Img, Height Auto Max-Width, Vertical-Align Bottom .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow .Wp-Block-Co-Authors-Plus-Avatar, Vertical-Align Middle .Wp-Block-Co-Authors-Plus-Avatar Is .Alignleft .Alignright",
        "published_date": "2025-02-05",
        "content": "Kay Burley, one of the UK’s best-known news anchors, is retiring from Sky News after 36 years.\n\nBurley’s decision follows Deadline revealing last year that the presenter was expected to leave the Sky News breakfast show amid speculation she was stepping down altogether.\n\nBurley confirmed the news on today’s breakfast show, telling viewers that it would be her final broadcast on Sky News. She was cheered and clapped out by colleagues, who gathered in the studio.\n\n“It’s been an honor and a privilege to work with some of the best and hardest working teams in the business news,” she said. “After over a million minutes of live TV news, more than anyone else in the world, it’s time for me to indulge in some of my other passions, including my love for travel.”\n\nWatch on Deadline\n\nIn an email to staff, David Rhodes, Sky News executive chairman, said: “Kay’s legacy in television journalism is unmatched, as is her commitment to Sky’s legacy. And I’m sure some MPs in Westminster will sleep easy knowing they won’t face her indomitable questioning in the mornings.”\n\nHe continued: “We thank Kay for her huge contribution to Sky, to the art of the interview and to British journalism. And we wish her the best of luck.”\n\nBurley’s exit marks the end of an era. She was one of Sky News’ original presenters when Rupert Murdoch launched the pay-TV broadcaster in 1989.\n\nBefore hosting breakfast, Burley anchored a late afternoon show. She was relied upon by Sky News during major news events and hosted the network’s general election night coverage in July.\n\nShe has been in the hot seat for some of the biggest stories of the past four decades, including the invasion of Iraq, the death of Princess Diana, and the 9/11 terrorist attack on New York. The latter clinched Sky News the first BAFTA award in its history.\n\nBurley was taken off air for six months in 2020 after it was revealed she broke Covid rules while celebrating her 60th birthday in London. She apologized for the “error of judgment.”\n\nRhodes, the former CBS News president, has been evolving the channel’s schedule amid changes in viewing habits and increased competition from GB News. Sky News has set a target of being a “premium video-first newsroom built for the digital future” by 2030.\n\nThere has been speculation at Sky News for months about who will replace Burley on breakfast. Insiders consider Wilfred Frost, the former CNBC presenter, to be the frontrunner.",
        "word_count": 416,
        "url": "https://deadline.com/2025/02/kay-burley-retiring-sky-news-36-years-1236278683/"
    },
    {
        "title": "Christina Haack's ex-husband Ant Anstead appeared on her HGTV show 'The Flip Off.' Here's a timeline of their relationship.",
        "author": "Samantha Grindell",
        "published_date": "Unknown",
        "content": "September 27, 2022: Haack called Anstead \"hypocritical.\"\n\nChristina Haack in 2025. Michael Tullberg/Getty Images\n\nIn her supplemental declaration, which BI reviewed, Haack said, \"From the start, Ant's intention was not to resolve this matter privately and amicably.\"\n\n\"I have never exploited our son Hudson,\" Haack's declaration said. \"He appeared in a few of my own Instagram ads that each took less than minutes to film. I have all the footage and they were all fun activities that he enjoyed doing, such as playing with toys or making cookies.\"\n\nHaack also said Anstead wanted to be able to post Hudson on social media and tag his brand Radford, while she had \"repeatedly taken the position that I will agree that Hudson shall not appear on television or on social media.\"\n\n\"Ant insists that he be allowed to post Hudson on his social media, while tagging products and businesses,\" Haack said. \"Ant admits in his supplemental declaration that he will usually 'tag' his business 'Radford.' It is Ant who insists that he be able to use Hudson in social media posts to promote the post and expand its 'organic' reach.\"\n\n\"If it is in the best interest of Hudson to be clear of public scrutiny, I feel Hudson should be off all public social media until he is old enough to make his own decisions,\" Haack said in the declaration.\n\nIn the same document, Haack also said Anstead \"never had a problem\" with Hudson appearing on Instagram or their HGTV shows until 2021, calling his declaration \"hypocritical.\"\n\nHaack noted that Anstead also refused to resolve their issues in mediation in her declaration, making their custody disagreement public record.\n\n\"We agreed to resolve this custody matter privately, and yet he continues to file publicly, proving his desire and need for the public's attention,\" Haack said. \"It is all quite disturbing, and now that it is out in the public, it will be far more damaging to Hudson in the long run when he is old enough to see how this matter played out publicly.\"\n\nRepresentatives for Haack declined to comment on the matter when contacted by BI at the time.",
        "word_count": 357,
        "url": "https://www.businessinsider.com/christina-haack-ant-anstead-relationship-timeline-2022-4"
    },
    {
        "title": "The CEOs of Microsoft and Alphabet have bought part of the London Hundred cricket franchise",
        "author": "Mike Moore, Deputy Editor, Techradar Pro, Social Links Navigation",
        "published_date": "2025-02-03",
        "content": "Microsoft and Alphabet CEOs are among the latest investors in a London cricket team\n\nLondon Spirit seals £145m deal for 49% stake in franchise\n\nBid led by Palo Alto Networks chairman Nikesh Arora\n\nThe CEOs of Alphabet and Microsoft are among several technology heads behind a record-breaking bid for a minority stake in a franchise of the UK's Hundred cricket competition.\n\nSatya Nadella and Sundar Pichai have joined a number of other cricket fans holding major roles at technology firms who have come together for a £145 million bid for a 49% in the London Spirit franchise.\n\nThe bid is the largest in this year's tender, and values the London Spirit, which plays its matches at the iconic Lord's cricket ground in the capital, at over £300 million.\n\nLondon Spirit deal\n\nLeading the bid, officially made by a consortium called the Cricket Investor Holdings Limited, is Nikesh Arora, the chief executive of security firm Palo Alto Networks, who heads up what the Marylebone Cricket Club (MCC), owner of Lord's, called \"11 high net-worth individuals\".\n\nAlong with Nadella and Pichai, this includes Shantanu Narayen, chief executive of Adobe, Egon Durban, the chief executive of Silver Lake Management, and Satyan Gajwani, the co-founder of Major League Cricket and vice-chairman of Times Internet.\n\nNadella and Pichai are both huge fans of cricket, which enjoys a huge fan base in their home nation of India. Nadella in particular is known for sneaking cricket references into the background of online talks and addresses, and is also an investor in the new Major League Cricket competition, co-owning the Seattle Orcas team.\n\nThe group was only able to bid for a 49% stake due to the remainder being retained by the MCC. Each of the hosts for the eight teams were given a 51% stake in their franchise, which they can sell or keep, with the ECB then selling the remaining 49%.\n\nAre you a pro? Subscribe to our newsletter Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nElsewhere in the auction, Indian-American IT entrepreneur Sanjay Govil, the founder and chairman of Infinite Computer Solutions, also spent £80m for a stake in the Welsh Fire franchise.\n\nIndia's richest man, Mukesh Ambani, founder of the Reliance Group, snapped up the stake in the Oval Invincibles, London's other franchise in the competition.\n\nVia Cricket.com",
        "word_count": 421,
        "url": "https://www.techradar.com/pro/the-ceos-of-microsoft-and-alphabet-have-bought-part-of-the-london-hundred-cricket-franchise"
    },
    {
        "title": "Man fined for loudspeaker call at French station",
        "author": "Unknown",
        "published_date": "Unknown",
        "content": "Man fined for loudspeaker call at French station\n\n6 February 2025 Seher Asaf BBC News\n\nGetty Images Surveys suggest speaking loudly on a phone in public is among behaviours deemed most unacceptable (archive image).\n\nA man who was fined €200 (£166) for making a call on loudspeaker at a train station in France has begun a fight against the penalty. The man, named only as David, told French broadcaster BFM TV he was on a call with his sister at Nantes station on Sunday when an employee from SNCF, the French railway company, approached him. David said he was told that he would be fined €150 if he did not turn off the loudspeaker - a fine which he claims was later increased to €200 because he did not pay it on the spot. He has since hired a lawyer to dispute the fine. SNCF confirmed the man was fined by its security staff in a quiet area of the station.\n\nThe state-owned train company disputed some details of the passenger's account, according to French outlet La Parisien. David, reported to be 54 years old, said he initially hung up the phone when he was told about the fine, thinking it was a joke, BFM TV reported. SNCF described an escalating interaction between the passenger and its staff member before the fine was issued. It told BBC News its security staff operate on trains and at stations and are authorised to issue fines against passengers. SNCF confirmed the fine increased from €150 \"because the customer refused to pay\". According to Ouest-France, the incident happened on Sunday. While there is no national law in France prohibiting the use of mobile phones on loudspeaker in public places, there are noise control regulations. According to the French Transport Code, those who use \"sound devices or instruments\" or \"disturb the peace of others by noise\" in areas used for public transport could face a fine.\n\nStrong feelings",
        "word_count": 323,
        "url": "https://www.bbc.com/news/articles/c4g949m4g41o"
    },
    {
        "title": "BBC Studios Hires Former Banijay Rights Exec Robin Pollok For L.A. Role",
        "author": "Jesse Whittock, .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow, Class, Wp-Block-Co-Authors-Plus, Display Inline, .Wp-Block-Co-Authors-Plus-Avatar, Where Img, Height Auto Max-Width, Vertical-Align Bottom .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow .Wp-Block-Co-Authors-Plus-Avatar, Vertical-Align Middle .Wp-Block-Co-Authors-Plus-Avatar Is .Alignleft .Alignright",
        "published_date": "2025-01-24",
        "content": "EXCLUSIVE: Robin Pollok has landed a new role at BBC Studios in L.A.\n\nThe former Banijay Rights distribution exec has been named Senior Sales Executive at Janet Brown’s Global Content Sales division at BBC Studios, spread across NY and L.A. Among his duties, he’ll be responsible for the recent A Good Girls Guide To Murder co-production deal with Netflix and shopping BBC drama The Jetty.\n\nPollok will look to strike sales deals and co-production agreements in the U.S., expanding BBCS’s presence among linear, streaming and digital counterparts across the country. Specifically, he will be working on a scripted slate including upcoming dramas Wild Cherry, Reunion and The Famous Five.\n\nWatch on Deadline\n\nPollok will report to Lawrence Szabo, the former Paramount Global exec who joined BBCS in 2023 as EVP, U.S. Content Distribution.\n\n“We are pleased to welcome Robin to the content sales team at BBC Studios,” said Szabo. “Robin arrives at BBC Studios with demonstrated success fostering valuable partnerships with clients across the international marketplace, as well as a deep passion for British storytelling. We look forward to tapping into Robin’s expertise, creativity, and vision as we bring our dynamic slate of new scripted projects to market and help our partners grow their business.”\n\nThis comes after Pollok relocated from London, where he worked at Banijay Entertainment’s sales arm as VP, overseeing deals in Africa, the Middle East, Israel and Greece. We revealed Sarah Mottershead had replaced him in the role last year, as he exited to prepare for his U.S. relocation. Mottershead joined from Studiocanal TV.\n\nPollok joined Banijay when the France-based production and distribution giant acquired Endemol Shine Group, where he had begun his TV sales career and rose to a Director-level post.\n\nPollok’s hire also follows a rejig at BBCS’s production team in L.A., with former NBCUniversal exec Jenny Groom hired as EVP, Unscripted Development and Ryan O’Dowd and Krystal Whitney promoted to President of Unscripted and EVP, Current Programming, respectively. Deadline was first with the news.",
        "word_count": 331,
        "url": "https://deadline.com/2025/01/bbc-studios-hires-former-banijay-rights-exec-robin-pollok-1236266457/"
    },
    {
        "title": "IMI confirms hack, becomes latest engineering giant to face cyberattack",
        "author": "Sead Fadilpašić, Social Links Navigation",
        "published_date": "2025-02-07",
        "content": "British engineering company IMI plc notifies London Stock Exchange of a recent cyberattack\n\nThe company did not share the details, but this seems to have been a data breach\n\nTop British engineering company IMI has confirmed suffering a cyberattack, filing a new report with the London Stock Exchange, notifying the securities exchange of “unauthorized access”.\n\n“IMI is currently responding to a cyber security incident involving unauthorized access to the Company's systems,” the filing reads. “As soon as IMI became aware of the unauthorized access, the company engaged external cyber security experts to investigate and contain the incident.”\n\nOther than that, the company did not share any details. It said it was taking “necessary steps” to comply with regulatory obligations, and that it will provide an update “when appropriate”.\n\nData breach\n\nWhen reached out by TechCrunch, the company did not want to discuss the matter further, so we don’t know the nature of the attack, who the miscreants are, or how they managed to break into IMI’s infrastructure.\n\nHowever the publication did find out, from the UK’s Information Commissioner’s Office, that the company provided it with a data breach report, so it’s safe to assume that at least some company data was stolen.\n\nThe ICO is currently “assessing the information provided,” it was said.\n\nIMI was founded in 1862 as Imperial Metal Industries. Its core business areas include precision engineering (advanced motion and fluid control solutions for industrial automation), critical engineering (valves and actuators for the energy and power industries), and hydronic engineering (heating, cooling, and climate control solutions for buildings).\n\nAre you a pro? Subscribe to our newsletter Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nThe company serves sectors like oil and gas, pharmaceuticals, power generation, and transportation. In fiscal 2023, the company reported $398 million in profits before tax, up 6% compared to the year before.",
        "word_count": 344,
        "url": "https://www.techradar.com/pro/security/imi-confirms-hack-becomes-latest-engineering-giant-to-face-cyberattack"
    },
    {
        "title": "Australia’s WTFN Reshuffles With Co-Founder Daryl Talbot Moving To Exec Director & Wes Crook Named CEO",
        "author": "Jesse Whittock, .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow, Class, Wp-Block-Co-Authors-Plus, Display Inline, .Wp-Block-Co-Authors-Plus-Avatar, Where Img, Height Auto Max-Width, Vertical-Align Bottom .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow .Wp-Block-Co-Authors-Plus-Avatar, Vertical-Align Middle .Wp-Block-Co-Authors-Plus-Avatar Is .Alignleft .Alignright",
        "published_date": "2025-02-03",
        "content": "EXCLUSIVE: Australian producer WTFN has reshuffled its management pack.\n\nCo-founder Daryl Talbot has moved out of the CEO seat at the 22-year-old company to become Executive Director, with COO Wes Crook rising to replace him. Steve Oemcke, the other co-founder, remains Chief Creative Officer and Derek Dyson is Chief Commercial Officer.\n\nWTFN is best known for Australian unscripted shows such as Bondi Vet, Sydney Harbour Force, The Hunters, Emergency and Space Invaders, but also operates in international distribution through subsidiary Fred Media and digital vendor Radar. The two sales businesses merged in September last year.\n\nTalbot, a former Nine Network producer and news reporter, launched WTFN with former gameshow host Oemcke in 2003, and they have gone on to build one of Australia‘s most prolific independent production and distribution operations. The Sydney-based company owns a library of more than 2,000 in-house hours, a sizeable number including numerous multi-season returners, and talent agency Empire Talent, and has offices in L.A. and London.\n\nWatch on Deadline\n\nThis shuffle is among the most significant management switches at the company to date. “We have been through some restructuring,” Talbot told Deadline. “The industry isn’t standing still and you can’t be left behind. The new structure gives me headspace to think about our strategy and our international focus.”\n\nSteve Oemcke and Daryl Talbot WTFN\n\nTalbot said that while there is “no denying from a macro-economic position that the last few years have been pretty tough for everyone,” WTFN starts 2025 in “probably the strongest position we’ve ever been in.” He predicted the company will experience double-digit digital growth this year, and added, “It has been a journey to get here and navigate the changes in the industry, along with Covid. To come out of all of that and be really well placed is great.”\n\nLast year, we revealed WTFN had engaged a bank to explore a sale or new investment with distribution growth in mind, but nothing has materialized yet on that front and it remains privately owned.\n\nTalbot declined to comment when asked about the process this, but was keen to talk up how the company had built up value through what WTFN calls a ‘total distribution’ strategy after realizing that production alone wouldn’t keep the business alive. This comprised identifying the need for an international sales business more than a decade ago, and launching a digital business that includes FAST channels and social media content.\n\n“We went from building houses to building houses, owning them and renting them out,” said Talbot. “That has allowed us to build out own library and given us options going forward. We’ve got a strong recurring production business that consistently does a job for the networks, and we’re out there pitching new shows, but owning and controlling the content is critical to the future. You have to have the commercial model that allows you to think up those new shows.”",
        "word_count": 482,
        "url": "https://deadline.com/2025/02/wtfn-management-changes-bondi-vet-maker-1236274230/"
    }
]