[
    {
        "title": "The A-level student who became an enemy of the Chinese state",
        "link": "https://www.bbc.com/news/articles/c93lp2wd0qzo",
        "snippet": "Chloe Cheung had just left school when Hong Kong police had put a million-dollar bounty on her head."
    },
    {
        "title": "What we've learned about Rachel Reeves's expenses - and the Labour response",
        "link": "https://www.bbc.com/news/articles/cpvmg924nk1o",
        "snippet": "Senior figures defended the chancellor after we revealed her expenses were investigated before she was an MP."
    },
    {
        "title": "What is Mandelson's strategy for charming Trumpworld?",
        "link": "https://www.bbc.com/news/articles/cdxnpngpj89o",
        "snippet": "As Peter Mandelson takes up the role of ambassador to the US, No 10 is determined the UK builds a strong relationship with Donald Trump."
    },
    {
        "title": "The Venn Diagram of Trump’s Authoritarian Actions",
        "link": "https://kottke.org/25/02/the-venn-diagram-of-trumps-authoritarian-actions",
        "snippet": "Professor Christina Pagel of University College London has mapped the actions of the Trump administration’s first few week"
    },
    {
        "title": "Russia could be allowed to keep its military bases, Syria says",
        "link": "https://www.businessinsider.com/russia-could-keep-hold-of-key-syria-military-bases-minister-2025-2",
        "snippet": "Syria says it's open to allowing Russia to keep hold of two key military bases, months after rebel groups ousted Kremlin ally Bashar Assad."
    },
    {
        "title": "Can The Daily Beast be saved?",
        "link": "https://www.businessinsider.com/daily-beast-joanna-coles-ben-sherwood-barry-diller-2025-2",
        "snippet": "The Daily Beast is profitable for the first time. Has it lost its bite to get there?"
    },
    {
        "title": "What investors can learn from the DeepSeek tech shock",
        "link": "https://www.businessinsider.com/lessons-deepseek-tech-shock-investors-market-volatility-2025-2",
        "snippet": "The DeepSeek saga offers investors valuable lessons on the risks that come from a market so heavily focused on one theme."
    },
    {
        "title": "Ctrl-Alt-Speech: The TickTock On TikTok",
        "link": "https://www.techdirt.com/2025/01/23/ctrl-alt-speech-the-ticktock-on-tiktok/",
        "snippet": "Ctrl-Alt-Speech is a weekly podcast about the latest news in online speech, from Mike Masnick and Everything in Moderation‘s Ben Whitelaw. Subscribe now on Apple Podcasts, Overcast, Spotify, Pocket Casts, YouTube, or your podcast app of choice — or go straigh…"
    },
    {
        "title": "International Insider: James Bond Shocker; London TV Week; Netflix’s Mexican Gold Rush",
        "link": "http://deadline.com/2025/02/james-bond-deal-berlinale-international-insider-1236297113/",
        "snippet": "Good afternoon Insiders, welcome welcome, Max Goldbart here. Big news this week with the shaken-not-stirred revelation that was the Amazon-Broccoli deal. We’ve all that and more below. Sign up here. Bond Shocker! The name’s Bezos… Jeff Bezos: Much like a Bond…"
    },
    {
        "title": "Melania Trump’s Hat Eclipses History: Politics Of First Lady Fashion",
        "link": "https://www.forbes.com/sites/gemmaallen/2025/01/22/melania-trumps-hat-eclipses-history-politics-of-first-lady-fashion/",
        "snippet": "Exploring how First Lady fashion became political theater, from Jackie O to Melania Trump,revealing gender bias where women's style overshadows policy in public discourse"
    },
    {
        "title": "New report shows social media giants obstruct independent research for political online safety",
        "link": "https://phys.org/news/2025-01-social-media-giants-obstruct-independent.html",
        "snippet": "A new report by academics at Royal Holloway has highlighted the scale of obstruction major social media platforms are creating for researchers looking into political online safety. The work is published in the SocArXiv."
    },
    {
        "title": "The Sunday Papers",
        "link": "https://www.rockpapershotgun.com/the-sunday-papers-753",
        "snippet": "Sundays are for bracing for the February half-term week here in the UK, during which schools are closed and parents must occupy kids while it's still mostly cold and rainy outside. Quick, tidy the house, book in the playdates, get the shopping done, catch-up …"
    },
    {
        "title": "2:00PM Water Cooler 2/13/2025",
        "link": "https://www.nakedcapitalism.com/2025/02/200pm-water-cooler-2-13-2025.html",
        "snippet": "~ Today's Water Cooler: Politics, Syndemics ~"
    },
    {
        "title": "Your Whole Self",
        "link": "https://www.nybooks.com/online/2025/01/28/your-whole-self-emily-greenhouse/",
        "snippet": "Immediately upon meeting Emily Greenhouse, the editor of The New York Review of Books, it was obvious to me that hers is a vibrant, compassionate mind with an appetite for everything: politics, economics, art, literature, music, fashion. She has a boundless e…"
    },
    {
        "title": "Russia-Ukraine war: List of key events – day 1,079",
        "link": "https://www.aljazeera.com/news/2025/2/7/russia-ukraine-war-list-of-key-events-day-15",
        "snippet": "Here are the key developments on the 1,079th day of Russia’s full-scale invasion of Ukraine."
    },
    {
        "title": "2:00PM Water Cooler 2/17/2025",
        "link": "https://www.nakedcapitalism.com/2025/02/200pm-water-cooler-2-17-2025.html",
        "snippet": "~ Today's Water Cooler: Politics, Syndemics; Humphrey's Executor on the chopping block; Elon's (putative) baby momma; Velvet ropes and the American dream ~"
    },
    {
        "title": "A new local news empire, built on newsletters, is growing in the United Kingdom",
        "link": "https://www.poynter.org/business-work/2025/manchester-mill-joshi-herrmann-newsletters-local-news/",
        "snippet": "The path that led Joshi Herrmann to build a fledgling media empire in the United Kingdom was anything but conventional. Rather than climbing the traditional ladder from local papers to […]\nThe post A new local news empire, built on newsletters, is growing in …"
    },
    {
        "title": "Smoot–Hawley Tariff Act",
        "link": "https://en.wikipedia.org/wiki/Smoot%E2%80%93Hawley_Tariff_Act",
        "snippet": "Comments"
    },
    {
        "title": "Hitler’s Oligarchs",
        "link": "https://www.theatlantic.com/ideas/archive/2025/02/hitler-oligarchs-hugenberg-nazi/681584/",
        "snippet": "First they reviled him. Then they supported and enabled him. Then they regretted it."
    },
    {
        "title": "Centrist Dads Unreformed",
        "link": "https://www.nybooks.com/articles/2025/03/13/centrist-dads-unreformed-caledonian-road-andrew-ohagan/",
        "snippet": "The vast social world of Andrew O’Hagan’s new novel is designed to pose a challenge to good liberal values."
    },
    {
        "title": "Berlin Film Festival To Try To Keep Politics At Bay",
        "link": "https://www.ibtimes.com/berlin-film-festival-try-keep-politics-bay-3763075",
        "snippet": "The Berlin Film Festival, which begins this week, is set for a challenge faced by the entire Western arts industry: how to stop politics from taking over the conversation."
    },
    {
        "title": "Donald Trump Jr. Accused Of Killing Protected Duck In Italy",
        "link": "https://www.forbes.com/sites/maryroeloffs/2025/02/04/donald-trump-jr-accused-of-killing-protected-duck-in-italy/",
        "snippet": "Italian politician Andrea Zanoni has reported Donald Trump Jr. to Italian police for killing a rare bird—but it's not the first time his hunting trips have landed him in hot water."
    },
    {
        "title": "Why DeepSeek prompted a $1 trillion tech sell-off",
        "link": "https://www.businessinsider.com/deepseek-ai-shook-tech-industry-global-markets-lost-trillion-dollars-2025-1",
        "snippet": "The AI company sent shockwaves through global markets when it released its latest model. Here's what happened."
    },
    {
        "title": "Berlin film festival to try to keep politics at bay",
        "link": "https://japantoday.com/category/entertainment/berlin-film-festival-to-try-to-keep-politics-at-bay",
        "snippet": "The Berlin Film Festival, which begins this week, is set for a challenge faced by the entire Western arts industry: how to stop politics from taking over the conversation. The first major European film festival of the year saw its 2024 edition overshadowed by…"
    },
    {
        "title": "Rupert Murdoch’s media company settles with Prince Harry, including a rare full apology",
        "link": "https://www.poynter.org/commentary/2025/prince-harry-wins-lawsuit-news-world-sun-rupert-murdoch-apology/",
        "snippet": "Sorry seems to be the hardest word. Well, it’s rare, anyway, in Rupert Murdoch’s media world. That’s what made Wednesday’s news so surprising. As expected, Murdoch’s British newspapers division, News […]\nThe post Rupert Murdoch’s media company settles with Pr…"
    },
    {
        "title": "Africa without borders could help the continent prosper. What's getting in the way?",
        "link": "https://phys.org/news/2025-01-africa-borders-continent-prosper.html",
        "snippet": "The vision of a \"borderless Africa\" is one of unity and shared prosperity for the continent. It is rooted in the ideals of the pan-Africanist movement."
    },
    {
        "title": "Financial Times’ Peter Spiegel Joins the Washington Post as Managing Editor",
        "link": "https://www.thewrap.com/peter-spiegel-washington-post-managing-editor/",
        "snippet": "The journalist will oversee coverage of national politics, the federal government, national security, the judiciary, immigration, race, health and science\nThe post Financial Times’ Peter Spiegel Joins the Washington Post as Managing Editor appeared first on T…"
    },
    {
        "title": "A Novelist Who Looks Into the Dark",
        "link": "https://www.theatlantic.com/magazine/archive/2025/03/novelist-ali-smith-gliff/681442/",
        "snippet": "Ali Smith scrambles plotlines, upends characters, and flouts chronology—while telling propulsively readable stories."
    },
    {
        "title": "Links 2/9/2025",
        "link": "https://www.nakedcapitalism.com/2025/02/links-2-9-2025.html",
        "snippet": "Our lazy daily links"
    },
    {
        "title": "Power Girl's New Costume in the Daily LITG 23rd January 2025",
        "link": "https://bleedingcool.com/comics/power-girls-new-costume-in-the-daily-litg-23rd-january-2025/",
        "snippet": "Power Girl's New Costume made the top of Bleeding Cool traffic yesterday. You are all so obvious. And I am back on my way to London Toy Fair for the final day! Welcome to Lying In The Gutters, the daily runaround for the biggest stories the day before – as we…"
    },
    {
        "title": "Can a Brit Become the Face of Politico?",
        "link": "http://nymag.com/intelligencer/article/can-jack-blanchard-become-the-face-of-politico.html",
        "snippet": "“I’m planning on working on becoming an insider while I’m here,” said Jack Blanchard, the new lead writer of Politico’s Playbook."
    },
    {
        "title": "The growing Influence of Israel’s Ultranationalist Settler Movement",
        "link": "https://www.juancole.com/2025/02/influence-ultranationalist-movement.html",
        "snippet": "By Leonie Fleischmann, City St George's, University of London (The Conversation) - Days after taking office, as he issued executive order after executive order to change the political face of America, Donald Trump also turned his attention to the war in Gaza.…"
    },
    {
        "title": "What Might Satire Look Like In Trump's Second Term?",
        "link": "https://www.forbes.com/sites/rdaniel-foster/2025/01/27/what-might-satire-look-like-in-trumps-second-term/",
        "snippet": "With his bombast, exaggerations and implausible suggestions, Donald Trump can defy satire. How will comedians skewer him during his second term?"
    },
    {
        "title": "Trump 'absolutely' welcome to visit UK, says London mayor in major U-turn",
        "link": "https://news.sky.com/story/sadiq-khan-london-mayor-says-president-trump-absolutely-welcome-to-visit-uk-in-major-u-turn-13312116",
        "snippet": "London's mayor Sir Sadiq Khan has defended his past attacks on Donald Trump, telling Sky News that standing up for the city \"does mean sometimes saying boo to a goose\"."
    },
    {
        "title": "Fark NotNewsletter: This Continues [FarkBlog]",
        "link": "https://www.fark.com/comments/blog1506/Fark-NotNewsletter-This-Continues",
        "snippet": "<table> <tr><td> </td><td> [link] [9 comments] </td></tr></table>"
    },
    {
        "title": "Kemi Badenoch says Tories couldn't find money for major defence boost while in government",
        "link": "https://news.sky.com/story/we-could-not-make-it-work-kemi-badenoch-admits-tories-couldnt-find-money-for-major-defence-boost-13311529",
        "snippet": "There's been a lot of talk in politics recently about \"Western values\"."
    },
    {
        "title": "2025 SkS Weekly Climate Change & Global Warming News Roundup #06",
        "link": "https://skepticalscience.com/2025-SkS-Weekly-News-Roundup_06.html",
        "snippet": "A listing of 23 news and opinion articles we found interesting and shared on social media during the past week: Sun, February 2, 2025 thru Sat, February 8, 2025.\nThis week's roundup is again published soleley by category. We are still interested in feedback t…"
    },
    {
        "title": "The A-level student who became an enemy of the Chinese state",
        "link": "https://www.bbc.com/news/articles/c93lp2wd0qzo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
        "snippet": "Chloe Cheung was just a year out of school when Hong Kong police issued a million-dollar bounty for her arrest."
    },
    {
        "title": "「新自由主義、あるいは世界の官僚化」（デヴィッド・グレーバー）の日本語訳｜缶ビ",
        "link": "https://note.com/clean_kalmia251/n/nc37eb69053bb",
        "snippet": "翻訳元は以下です。なるべく直訳するように努めました。  \n\n\nNeoliberalism, or The Bureaucratization of the World - David Graeber\n\n\nAmericans often find it difficult to talk about politics with\n\n\ndavidgraeber.org\n\n\n\n \n 新自由主義、あるいは世界の官僚化  デヴィッド・グレーバー (2009)  　アメリカ人はしばしば世界の他の地域の人々と政治の話をすることに…"
    },
    {
        "title": "Germany heads to the polls on Sunday with far-right party expected to make gains",
        "link": "https://www.cbc.ca/news/world/germany-election-preview-1.7464825",
        "snippet": "Germany holds its snap national election on Sunday following the collapse of Olaf Scholz's three-way coalition, and the coalition that emerges will face huge challenges, from reviving a flagging economy to forging a foreign policy amid the unpredictability of…"
    },
    {
        "title": "Irish ambassador in London personally approved book launch for ex-housing minister Eoghan Murphy",
        "link": "https://www.independent.ie/irish-news/irish-ambassador-in-london-personally-approved-book-launch-for-ex-housing-minister-eoghan-murphy/a1264531495.html",
        "snippet": "The Irish ambassador in London personally approved a book launch for ex-housing minister Eoghan Murphy, saying it would help demonstrate “the challenges faced by political officeholders” in the modern world."
    },
    {
        "title": "An ailing Pope Francis – and the vultures circling in the Vatican",
        "link": "https://theweek.com/religion/an-ailing-pope-francis-and-the-vultures-circling-in-the-vatican",
        "snippet": "Caught between his progressive inner circle and an influx of conservatism, the Holy Father should 'brace' himself for a battle"
    },
    {
        "title": "What We Know About Bill Gates’ Memoir ‘Source Code’",
        "link": "https://www.forbes.com/sites/maryroeloffs/2025/01/28/what-we-know-about-bill-gates-memoir-source-code/",
        "snippet": "Billionaire Bill Gates will release his fifth book, the first of three planned personal memoirs, later this year."
    },
    {
        "title": "Leaving X can be a tricky decision for brands",
        "link": "https://www.bbc.com/news/articles/cqx9e0y17wwo",
        "snippet": "Many companies have left X but it's not always a simple decision."
    },
    {
        "title": "I’ve worked in 60 countries – here is what people have said to me about Ireland",
        "link": "https://www.irishtimes.com/abroad/2025/02/04/after-working-in-60-countries-here-is-what-people-have-said-to-me-about-ireland/",
        "snippet": "Belgian colleagues kindly explained the basics of how modern societies work; I adhered to a rule of never engaging Americans on Irish politics"
    }
]